Repository: khaledhosny/l10n-manual
Catalog: extras.po
Languages: ar

source: Effecting Change Through Localisation
ar: إحداث التغيير بتوطين المعلوماتية

source: Localisation guide for Free and Open Source Software
ar: دَلِيلٌ لِتَوطِينِ البَرمَجِيَّاتِ الحُرَّةِ مفتوحةِ المَصدَرِ

source: Our modern world is rapidly converging on a digital age. At the same time many of the world's marginalised languages are under pressure from dominant languages. For our languages to remain robust and relevant they must make the leap into modern technology.
ar: يدخل عالمنا بسرعة إلى عصره الرقمي، و يتواكب مع هذا أن عديدا من لغات العالم المُهمَّشة ترزح تحت ضغط من اللغات السائدة، و لأجل أن تظَّل لغاتنا حيّة و مفيدة ينبغي أن ندفعها إلى مجالات التقنية الحديثة.

source: This book guides native speakers through the task of translating computer software into local languages, empowering them to take their languages into the digital age.
ar: القصد من هذا الدليل إرشاد المعنيين بترجمة برمجيات الحواسيب إلى لغاتهم، و تمكينهم من دفع لغاتهم إلى العصر الرَّقميّ.

source: Contact:
ar: تواصل معنا:

source: Technology in the interest of language
ar: تقنية المعلوماتية في خدمة اللغة

source: The African Network for Localisation
ar: الشبكة الأفريقية للتوطين

source: Translation by
ar: ترجمة

source: Diagram
ar: رسم بياني

source: New translator
ar: مترجم جيد

source: No existing translation
ar: لا تُوجد ترجمة حاليا

source: Existing translation available
ar: توجد ترجمة

source: Template generated
ar: تم توليد القالب

source: Find translation
ar: ابحث عن ترجمة

source: Upgrade the existing translation to the template
ar: رقِّ الترجمة الحالية إلى هذا القالب

source: Translate
ar: تَرجِم

source: Review
ar: راجِع

source: Submit
ar: أودِع
