Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: Whether you work on your own or in a group or even a formal organisation, clear goals will help to motivate and to keep your focus on what you want to achieve. Many companies work towards formulating a vision and mission as part of their strategic planning. Knowing what you are trying to achieve not only helps you to keep an eye on the target, but also makes it easier to know when you succeeded!
ar: سواء كنت تعمل مستقلا أو في مجموعة أو حتى في مؤسسة رسمية، فسيفيدك تحديد أهداف واضحة في التركيز على ما تسعى إليه. كثير من الشركات تعمل على وضع رؤية وهدف محدد أثناء مرحلة التخطيط، فمعرفة ما تسعى إلى تحقيقه لا يفيد وحسب في إبقاء هدفك نصب عينيك، بل يسهِّل تحديد معيار للنجاح.

source: If you are working as a volunteer, you should try to make your localisation work as much fun as possible. Set it as a secondary goal if you want.
ar: إذا كنت تعمل متطوعا فعليك أن تحاول جعل الأمر ممتعا، اجعل هذا هدفا ثانويا إذا أردت.

source: Setting goals to reach objectives
ar: تحديد الأهداف لتحقيق المقاصد

source: At Translate.org.za in South Africa we wanted to empower people and uplift their languages. At least, that is what we told ourselves, but initially we were not working along the best path to achieve that goal – we were translating software that we liked, instead of software that people are actually likely to use. Since we couldn’t possibly translate all software, we had to choose, which means we had to prioritise. If you understand your goals better, you will find more constructive ways to prioritise different projects, and hopefully, reach your goals faster or more successfully.
ar: في مشروع Translate.org.za في جنوب أفريقيا أردنا أن تمكين الناس و دعم لغاتهم، أو هكذا انتوينا، لكننا في البداية أخطأنا الطريق الأمثل لتحقيق هذا الهدف، فكنا نترجم البرمجيات التي تعجبنا بدلا من البرمجيات التي قد يستخدمها الناس أكثر. ولأننا لا نستطيع ترجمة كل شيء كان علينا الاختيار وتحديد الأولويات. كلما حددت أهدافك بدقة استطعت تحديد أولويات المشروعات المختلفة و الوصول لأهدافك أسرع أو بنجاح أكبر.

source: Since you will try to reach your goals with limited resources (volunteers, money, time, etc.) you should plan for continuity and sustainability. Think of how you will motivate volunteers. If money is involved, set up a budget and see how well you keep to it. Measure the work so that you become good at time planning. We will discusse some techniques for evaluating projects and prioritising your work in the section on “<bf0>Prioritisation (when you can't do everything)</bf0>” on page <bf1>55</bf1>.
ar: محدودية الموارد المتاحة لك (سواء المتطوعين أو المال أو الوقت إلى غير ذلك) تُحتِّم التخطيط لوسائل استدامة واستمرارية المشروع. فكِّر في كيفية تحفيز المتطوعين. و إن توفر المال سيكون عليك وضع ميزانية ومراقبة مدى الالتزام بها، وعليك كذلك حساب الوقت المستغرق في إنجاز العمل لتستطيع تنظيم الوقت أفضل. قسم “<bf0>الأولويات (عندما لا تستطيع عمل كل شيء)</bf0>” صفحة <bf1>55</bf1> يناقش بعض وسائل تقييم المشروعات وتحديد أولوياتها.

source: There are many things to learn about localisation and translation, and it might seem like a big undertaking. However, you can do good localisation while avoiding some important mistakes, and have fun while learning. Here are a few principles to keep in mind.
ar: يتطلب التوطين تعلُّم الكثير، وهذا قد يجعلها تبدو مهمة صعبة، مع هذا فمن الممكن إخراج ترجمة جيدة بتفادي بعض الأخطاء المهمة، و كذلك الاستمتاع أثناء التعلم. وهذه بعض المبادئ التي ينبغي الانتباه لها.

source: <f0>Start small. </f0><f1>Don’t think that you need to start with the biggest and most popular pieces of software. Choose a task that you can complete easily, and fits in your available time. </f1><t2/><f3>You will get a lot of reward and motivation from completing something small.</f3>
ar: <f0>ابدأ بداية متواضعة.</f0> ليس عليك البدء بأكبر البرمجيات وأكثرها شعبية، اختر مهمة يمكنك أداؤها بسهولة في الوقت المتاح لك، <f3>إتمام المهمة سيُشعرك بالفخر ويحفزك أكثر.</f3>

source: <f0>Read the instructions. </f0><f1>You can often find a lot of advice to help you in a given situation. The </f1><f2>specific software you are translating might have instructions to help with the difficult parts. Maybe a certain sentence has a comment from the programmer to explain a difficult concept. A language guide for your language might clear up some difficulty you have with spelling or grammar.</f2>
ar: <f0>اقرأ التعليمات.</f0> فغالبا ستجد بها نصائح تفيد في حالات معينة. فقد ينشر مشروع البرمجية التي تترجمها تعليمات للمساعدة في الأجزاء الصعبة، أو قد يضع المبرمج تعليقات على جمل معينة لشرح مفاهيم غير واضحة. الاستعانة بدليل للقواعد اللغوية يساعد في تفادي الأخطاء الشائعة ومشاكل النحو أو الإملاء التي قد تواجهك.

source: <f0>Stay consistent. </f0><f1>Consistency is an important goal in localisation. You want to make sure that you use terminology consistently, as well as using a consistent style in an application. Furthermore you should aim to harmonise your terminology and style with other applications on the same platform that the application will run on (Windows, KDE, GNOME, OS X, etc.). Then you should aim for consistency with the language use outside cyberspace – what people use at universities, newspapers, magazines, etc. Eventually you will develop your own style, and you don’t need to follow other people’s mistakes blindly, but don’t do things differently without a reason.</f1>
ar: <f0>حافظ على الاتساق.</f0> الاتساق أحد الأهداف المهمة في التوطين. يجب أن تتأكد من الاتساق في استعمال المصطلحات، واتساق أسلوب الترجمة، وأن تتناغم مع مصطلحات وأسلوب التطبيقات الأخرى في المنصة التي سيعمل عليها التطبيق (وِندوز أو كدي أو گنوم، إلخ.) و خذ في الحسبان الاتساق مع اللغة التي يستعملها الناس خارج عالم الحوسبة؛ في الجامعات والصحف والمجلات و غيرها، عندما يكون ذلك مفيدا. مع الوقت ستطور أسلوبك الخاص ولن تقع في أخطاء الآخرين، لكن لا تسعى للاختلاف لمجرد الاختلاف.

source: <f0>Be careful, but be bold. </f0><f1>This advice might sound like a contradiction, but try to balance these two opposing goals. You should be careful in what you do, and strive for good quality. Don’t be lazy to do your research, and ensure that you or someone else reviews your translations. Maybe you should leave a translation that you can’t do well yet until you have the required information. However, sometimes it might just help your progress if you go ahead and coin the new term, or change a bad habit that has formed in your team. In FOSS you can usually fix your mistakes quite easily, and if you learn from your mistakes, you might gain a lot from not being too careful. Find a balance between being careful and being bold.</f1>
ar: <f0>كن حريصا وجريئا.</f0> قد تبدو هذه النصيحة متناقضة، لكن اسعَ إلى الموازنة بين هذين الهدفين المتضادين. ينبغي أن تكون حريصا في عملك وأن تسعى للأفضل. لا تتردد في البحث والدراسة، وتأكد أن تراجع أنت و شخص آخر الترجمة. أحيانا يكون من الأفضل تأجيل الترجمة حتى تصل إلى فهم أفضل. لكن في أحيان أخرى يكون عليك المضي قدما وصَوغُ مصطلح جديد أو تغيير عادة سيئة شاعت بين المترجمين. من السهل عادة إصلاح الأخطاء في البرمجيات الحرة، وإذا كنت ممن يتعلمون من أخطائهم فسيفيدك كثيرا عدم المبالغة في الحرص.

source: <f0>Expect criticism. </f0><f1>Unfortunately, not everyone will always appreciate your hard work. If you are breaking new ground you stand the chance of attracting criticism. This is to be expected, and isn’t necessarily bad. Criticism means that someone paid attention to what you did. Constructive criticism might help to improve your work, to fine-tune your terminology, or to reduce your errors. Especially if you are doing localisation that is entirely new for your language, take into consideration that users sometimes need a bit of time to get used to new terms in a localised user interface. Your audience will develop with you, and new terminology might become established and accepted even if they were criticised initially. Don’t ignore criticism, but realise that new localisations usually look surprising and might attract comments.</f1>
ar: <f0>توقع النقد.</f0> للأسف قد لا يقدر الجميع المجهود الذي تبذله. عندما تأخذ زمام المبادرة فإنك تُعرِّضُ نفسك للنقد، وهذا أمر متوقع وليس سيئا بالضرورة. فهذا يعني أن شخصا ما اهتم بما تفعله، والنقد الجيد يساعدك على تحسين عملك، بتنقيح المصطلحات التي تستعملها أو تقليل أخطائك. ضع في الاعتبار كذلك أن المستخدمين يحتاجون أحيانا لبعض الوقت للاعتياد على المصطلحات الجديدة في الواجهة المعربة، وخاصة إن كان مجالا جديدا على لغتك. يتطور المستخدمون معك، والمصطلحات التي انتقدوها في البداية ستُصبِح مقبولة ومعتادة إن كانت مبنية على تفكير سليم. لا تتجاهل النقد، بل تجاوب معه، و خذ في حسبانك أن الواجهات المترجمة قد تفاجئ الناس وتبعث على النقد.

source: <f0>Enjoy it. </f0><f1>Don’t get so caught up in the work that you don’t enjoy it. Most FOSS localisation is done by volunteers for fun. If the work isn’t rewarding in some way, you might not be able to sustain your work, and you might not reach your goals. Translate software that you use and enjoy. Give compliments to the programmers. If you like to get credit for your work, ensure that you work hard on publicity and marketing for your work.</f1>
ar: <f0>استمتع.</f0> لا تتورط في عمل لا تحبه. غالبا ما يعمل على توطين البرمجيات الحرة متطوعون يستمتعون بهذا. إذا لم يكن الأمر مرضيا بشكل أو بآخر فقد لا تستطيع الاستمرار فيه ومن ثم لن تحقق أهدافك، لذا ترجم البرمجيات التي تستخدمها وتستمتع بها، و أطرِ على المبرمجين. إذا أردت أن يشيد الناس بعملك فعليك أن تعمل بجد على نشره وتسويقه

source: The localisation work you do will take place in a certain environment. Not all advice is equally suitable for all situations. If you are aware of your resources, your users and the world they live in, it will help you do better localisation, and work more effectively.
ar: العمل الذي تقوم به يحدث في بيئة يتفاعل معها، وليست كل النصائح مناسبة لكل المواقف، لذا عليك أن تعي ما يتوفر لك من موارد وطبيعة مستخدميك والبيئة التي يعيشون فيها لتنجز عملا أحسن وبفاعلية أفضل.

source: Target audience: speakers of your language
ar: الجمهور المستهدف: متحدثو لغتك

source: In all translation work it is important to know who you are translating for. Who will read <t0/>the text that you are writing? How old are they? What level of literacy is expected? If your target audience is young children from a rural school, you will probably translate differently than for university professors! If you are localising into your language, remember that the speakers of that language are also your primary audience for marketing and promoting your work. Don’t unnecessarily use another language like English to support users or discuss terminology.
ar: في أي ترجمة يجب أن تعرف أولا لمن تترجم؛ من سيقرأ النص الذي تترجمه. من أي فئة عمرية. وأي مستوى تعليمي. فقد تختلف الترجمة إن كنت تترجم للأطفال في المدارس الريفية عما إذا كنت تترجم لأساتذة الجامعات. ولا تنس أن المتحدثين باللغة التي تترجم إليها هم الجمهور الأساسي الذي تسوق لهم عملك، فلا تتواصل بلغة أخرى كالإنگليزية دون داعٍ عند الرد على أسئلة المستخدمين أو مناقشة المصطلحات، بل إن التواصل مع الجمهور بلغتهم هو وسيلة لإتقان الترجمة ذاتها و لتسويقها بينهم.

source: Target audience: users of open source software
ar: الجمهور المستهدف: مستخدمو البرمجيات الحرة

source: Users of Open Source Software tend to have a stronger community orientation, and like to stay up to date with software news. You might also be able to find volunteers to help with terminology, reviewing, or testing of the translated software. Someone might be willing to help with promotion. People might be more willing to volunteer their time because you are providing localised software that respects the user’s freedom.
ar: عادة ما يكون لمستخدمي البرمجيات الحرة حِسٌّ مجتمعي، كما أنهم يواظبون على الاطلاع على آخر أخبار البرمجيات. كما يمكن أن تجد بينهم متطوعين للتباحث معهم في صوغ المصطلحات أو لمراجعة الترجمة أو لاختبار البرمجيات المترجمة، وقد تجد من يهتم بالمساعدة في الدعاية. قد يتحمس الناس للتطوع بوقتهم لأنك توطن برمجيات تحترم حرية المستخدم.

source: Keep in mind that while it might be easy to contribute by complaining, few people will really help with substantial contributions. Realise that users might have high expectations, and you might not impress them with bad work.
ar: ضع في اعتبارك أن الشكوى سهلة لكن قليلون من يساعدون بمشاركات مؤثرة، واعلم أن المستخدمين قد يُعلِّقون عليك آمالا كبيرة، ثم لا يكون الناتج على قدر ما تمنوا.

source: Your localisation team
ar: فريق التوطين

source: If you have big goals you might need lots of help to get there. Building a strong team will help you do more work, and improve the work by bringing in different skills. Always try to contact previous translators that might have done work you are building on. Document what you do, and make sure that people know about it. Think about ways to promote the work you do amongst the people you are trying to reach. Think about newspapers, radio, television, blogging, and social networks.
ar: إن كانت أهدافك كبيرة فستحتاج الكثير من المساعدة لتحقيقها، وبناء فريق قوي يساعدك على إنجاز عمل أكبر، وانضمام ذوي الخبرات المختلفة يساعد على إتقانه. إذا كنت تُتِّم عمل مترجمين سابقين فحاول التواصل معهم. عليك أيضا توثيق ما تفعله وإطلاع الآخرين عليه. ابحث عن طرق للترويج للعمل الذي تقوم به بين من تسعى إلى مساعدتهم، بتوظيف الصحف والإذاعة والتلفاز والمدونات والشبكات الاجتماعية.

source: Try to train newcomers so that they can become useful contributors. Create awareness of localisation. At Translate.org.za, we have often held events called <f0>Translate@thons</f0><f1> where we get people together for a day or two to translate a piece of software. It is a great way to show people what software localisation is, train people in the basics, while having fun as a group and working towards a common goal.</f1>
ar: حاول تدريب المستخدمين الجدد ليصبحوا مشاركين فعالين، وانشر الوعي بالتوطين. في مشروع Translate.org.za كثيرا ما ننظم ماراثونات يجتمع فيها أشخاص ليوم أو يومين ليترجموا إحدى البرمجيات، وهي طريقة فعالة لتعريف الناس بماهية توطين البرمجيات وتدريبهم على أساسياته وفي نفس الوقت تستمتع مجموعة من الناس بالعمل لتحقيق هدف مشترك.

source: Read more about hosting a Translate@thon:
ar: تعرف أكثر على هذه الماراثونات:

source: If you are working alone, don’t let all the references to localisation teams upset you. A lot of FOSS localisation (especially for smaller languages) is done by single volunteers working mostly alone. If localisation is new in your language, keep in mind that someone needs to be first – it could just as well be you. Some people join an existing project more easily than creating a new one.
ar: إذا كنت تعمل وحدك فلا تنزعج من تكرار الإشارة إلى فرق التوطين، فكثير من مشروعات توطين البرمجيات الحرة (خاصة إلى اللغات قليلة الانتشار) يقوم عليها متطوعون يعملون منفردين. إذا كان توطين البرمجيات أمرا جديدا في لغتك فعلى شخص ما أن يكون الرائد، وقد تكون أنت. بعض الناس يسهل عليهم الانضمام إلى فريق موجود على بدء فريق من الصفر.

source: The role of English
ar: دور اللغة الإنگليزية

source: When talking about the environment in which you do software localisation, it is important to say something about the special role of English. English has become a dominant language in the world of software, and this affects the way we do our work. Most software is translated from English into other languages. Some of your users and fellow translators might be very used to English terminology and style and might prefer that.
ar: من المهم الحديث عن دور اللغة الإنگليزية في معرض مناقشة بيئة توطين البرمجيات، فقد أصبحت الإنگليزية اللغة السائدة في عالم البرمجيات وهذا يؤثر على طريقة عملنا. أغلب البرمجيات تترجم من الإنگليزية، كما قد تجد بعض المستخدمين وحتى بعض رفقاك في الترجمة معتادين على المصطلحات والأسلوب الإنگليزي ويميلون إليه، بوعي أو بغير.

source: In FOSS projects, you will find that a lot of communication amongst participants usually takes place in English. If you are able to work comfortably in English, you will take part more easily in such projects, and should also be able to interpret the English texts more easily. When communicating in English with other people, try to clearly explain your <t0/>points, and review your text to avoid misunderstandings due to spelling or other mistakes.
ar: ستجد أن أغلب التواصل في مشروعات البرمجيات الحرة يكون بالإنگليزية، لذا سيسهل عليك المشاركة في هذه المشروعات إن كنت تجيد الإنگليزية، كما سيسهل عليك فهم النصوص الإنگليزية أفضل، إن كانت مكتوبة بلغة سليمة، و اعلم أن الإنگليزية ليست اللغة الأم لكل المشاركين في المشروعات، فعندما تتواصل مع الآخرين بالإنگليزية حاول أن تشرح ما تريده بوضوح وأن تراجع النص قبل إرساله حتى لا يساء فهمه نتيجة أخطاء الإملاء وغيرها، و لكي توفّر وقتك و قت الآخرين.

source: However, there are many ways to help someone who doesn’t know English well. Some software (like Pootle) can show you another language (like French or Arabic) while translating to help you understand the text better. Machine translation systems on the web might help you to communicate with other team members in a language you don’t understand well. People who don’t know a second language can still be valuable contributors – even if just for marketing and testing.
ar: ومع هذا توجد وسائل عديدة لمساعدة من لا يجيد الإنگليزية بقدر كاف، فبعض البرمجيات (مثل بُوتِل) يمكن أن تعرض النص بلغة أخرى إضافية للمساعدة على فهم أفضل للنص، و هذا قد يساعد حتى من يتقنون الإنگليزية على استجلاء المعنى. كما قد تساعد خدمات الترجمة الآلية في التواصل مع الآخرين بلغات لا تجيدها. ويمكن كذلك الاستفادة من الأشخاص الذين لا يعرفون أي لغات أجنبية في أمور مثل الترويج للبرمجيات المترجمة و هم مفيدون للغاية في اختبار الترجمات.

source: Orientate yourself
ar: تَعرَّف على ما تترجمه

source: When you are ready to start to translate a specific piece of software, ensure that you are familiar with it first. In the FOSS world, you can usually get the software and try it out without too much trouble. Visit the project website, read through some of the documentation, and try to run the software on your own computer. It will provide you with useful background information on what the software can do, and what it is that you will be translating. Another useful source of information is the help files that might be available inside the application.
ar: عندما تكون مستعدا لترجمة برمجية ما ابدأ باستخدامها والاعتياد عليها. يسهل في عالم البرمجيات الحرة الحصول على البرمجيات وتجربتها. عليك كذلك زيارة موقع مشروع البرمجية و مطالعة وثائقها. سيجعلك هذا تعرف ما الذي تفعله البرمجية وبالتالي معنى ما تترجمه. كما تشكل ملفات المساعدة التي قد توجد مع البرمجية مصدرا مهما آخر للمعلومات.

source: If you are starting a new translation for the software in your language, even an older version of the software should give you a very good idea of how the software works, and what the terms being used really mean. Always try to approach your translation with good knowledge of the software rather than relying on the text only.
ar: وإذا كنت تستحدث ترجمة جديدة من الصفر فستفيدك أي إصدارة قديمة من البرمجية في التعرف عليها وطريقة عملها وما تعنيه المصطلحات المختلفة. حاول دوما أن تبني الترجمة على معرفة جيدة بالبرمجية ولا تعتمد على النصوص وحدها.

source: Before you start
ar: قبل البدء

source: There are many tools that you could use for translation. It would be impossible to discuss them all here. We will provide most of the explanations with reference to Pootle and Virtaal. They have been developed to help localisers work more productively, manage their teams better, and increase quality.
ar: الأدوات التي يمكن استخدامها للترجمة عديدة ولا نستطيع التطرق إليها كلها. لذا سيكون أغلب الشرح عن بُوتِل وفِرتال، فكلتاهما طُوِّرَتا لزيادة إنتاجية المترجمين ومساعدتهم على إدارة فِرَقهم وتحسين الجودة.

source: <f0>Pootle</f0> is a popular web-based system for translation and translation management. It is used by several FOSS projects to manage their localisation work. Pootle allows online translation, and it has several features to help with review and team organisation. It is ideal for team work, casual contributions, and translation sprints (Translate@thons). Visit the official Pootle server to see what it is all about:
ar: <f0>بُوتِل</f0> نظام لإنجاز الترجمة وإدارتها عبر الوِب، تستخدمه كثير من المشروعات الحرة لإدارة صيرورة التوطين، و به وظائف عِدة تساعد في مراجعة الترجمة وتنظيم عمل الفريق. وهو مناسب للعمل الجماعي، وللمساهمين غير المتمرسين، ولماراثونات الترجمة. راجع صفحة مشروع بوتل لمطالعة المزيد عنه:

source: While online translation is useful, we realise that internet connectivity is still a problem for many people. <f0>Virtaal</f0> is a program for translating on your computer, even if you don’t have internet access. It provides many powerful features to improve productivity without sacrificing quality. Installation instructions and more information is available on the Virtaal website:
ar: مع أن الترجمة عبر الوِب مفيدة إلا أن توفر اتصال جيد بالإنترنت مايزال عائقا أمام كثيرين. <f0>فِرْتَال</f0> أداة ترجمة تعمل على الحاسوب بغير حاجة لاتصال بالإنترنت، و به وظائف عديدة لزيادة الإنتاجية مع المحافظة على الجودة. تجود تعليمات التنصيب و مزيد من المعلومات على موقع فرتال:

source: You don’t need to choose between these two tools – they complement each other. Even if a project is hosted on Pootle, you can still translate it offline in Virtaal and upload your files later. These tools are described in more detail in the section on “<bf0>Localisation tools</bf0>” on page <bf1>39</bf1>. Several sections will refer to specific features of the tools, so it is a good idea for you to have Virtaal installed, and preferably also an account on a Pootle server so you can follow the instructions in the book. Virtaal will provide the most help during your translation with colour highlighting of important things, and integration with helpful resources if you have an internet connection.
ar: لست مضطرا إلى الاختيار ما بين هاتين الأداتين فهما تكمل إحداهما الأخرى. فالمشروعات المستضافة على بوتل تمكن ترجمتها بلا اتصال بالإنترنت باستخدام فرتال ثم رفع الملفات المترجمة إلى بوتل. قسم “<bf0>أدوات التوطين</bf0>” في صفحة <bf1>39</bf1> يشرح هاتين الأداتين بتفصيل أكبر. عدة أقسام في هذا الكتاب تتحدث عن وظائف معينة في هاتين الأداتين لذا من المحبذ تنصيب فرتال و فتح حساب في أحد خواديم بوتل لتجربة الإرشادات الواردة في الكتاب. سيقدم فرتال العون الأكبر أثناء الترجمة عبر تلوين الأجزاء المهمة لإبرازها، والتكامل مع كثير من الموارد المساعدة إذا كنت متصلا بالإنترنت.

source: Both these programs are built on top of the <f0>Translate Toolkit</f0><f1> – a powerful collection of small utility programs for localisers. The programs in the Translate Toolkit are run from a command-line window, and therefore won’t be discussed much in the book. Installation instructions and more information is available on the website of the Translate Toolkit:</f1>
ar: بُنِيَت كلتا الأداتين على <f0>عُدّة الترجمة</f0> و هي تجميعة قوية من أدوات صغيرة لمساعدة المُوَطِّنين. تشتغل أدوات عدة الترجمة من سطر الأوامر لذا لن نتطرق إليها كثيرا في هذا الكتاب. تتوفر تعليمات التنصيب و مزيد من المعلومات على موقع عدة الترجمة:

source: Before you can do any work, you need to ensure that you can view your language on screen. For many languages this is not a problem any more, but you need to know that you have the necessary fonts installed on your computer. Maybe there is a version of Wikipedia with your language, or a local online newspaper, and you can verify that you can view all the characters correctly. If you are having any problems, these sites might provide some links to fonts and instructions to be able to view your language on screen. It is important to know that you must work with so-called Unicode fonts. You can consult the Unicode font guide: <a0>http://www.unifont.org/fontguide/</a0>
ar: قبل البدء في العمل تأكد من أنك تستطيع عرض لغتك بشكل سليم على شاشة الحاسوب. لم تعد هذه مشكلة لكثير من اللغات وكل ما تحتاجه هو التحقق من تنصيب الخطوط المطلوبة على الحاسوب. يمكنك مطالعة صفحة ويكيبيديا بلغتك أو موقع إحدى الصحف المحلية على الإنترنت للتأكد من أن كل الحروف تظهر كما ينبغي، وإذا وجدت مشاكل فقد تجد في تلك المواقع روابط إلى الخطوط المطلوبة وتعليمات لطريقة عرض لغتك على الشاشة. من المهم الانتباه إلى أنك تحتاج إلى ما تُعرف بخطوط يُونِيكود، ويمكنك مراجعة دليل خطوط يونيكود: <a0>http://www.unifont.org/fontguide</a0>
