Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: <f0>Some projects might expect that you interact with their </f0><f1>version control system</f1><f2>. A version control system is a system used to keep all files for the projects, and therefore usually also the translation files. Most software is developed with such a system in use, and in the case of FOSS, it will usually be publicly accessible. This might be the preferred way to obtain files, and to submit them back to the project. In order to submit a file to the version control system, you will need to be authorised to do so, and each project might have its own way of doing this. In most projects it isn’t compulsory to understand the version control system in order to localise the application, but in some cases it might </f2><f3>simply be best for you to become familiar with some of the basics of how it works. The programmers should be able to help you get started and recommend any required documentation. Some basics are explained on page </f3><f4><bf5>48</bf5></f4><f6> in the section on “</f6><f7><bf8>Version control systems</bf8></f7><f9>”.</f9>
ar: بعض المشروعات تتوقع منك أن تتعامل مع <f1>نظام إدارة الإصدارات</f1> الذي يستخدمونه. تُستخدم نظم إدارة الإصدارات لإدارة كل ملفات المشروع بما فيها ملفات الترجمة، وتُطوّر أغلب البرمجيات باستخدام هذه النظم، وفي حالة مشروعات البرمجيات الحرة يكون محتواها متاحة للعموم. وقد يكون هذا هو الأسلوب المفضل للحصول على الملفات ثم إيداعها بعد تمام العمل عليها. تلزمك صلاحيات معينة لتستطيع إيداع الملفات في أنظمة إدارة الإصدارات وقد يكون لكل مشروع نظام مختلف لمنح هذه الصلاحيات. في الغالب لست مضطرا إلى فهم أنظمة إدارة الإصدارات لتوطين البرمجيات، لكن في بعض الحالات يكون أفضل لك أن تعرف أساسيات عملها. يمكنك الاستعانة بالمطورين لإرشادك؛ و إحالتك إلى أية وثائق تعنيك مطالعتها. يشرح قسم “نظم إدارة الإصدارات” صفحة <bf5>48</bf5> بعض أساسياتها.

source: In whatever way you obtain your files, it is important to know whether the files are already up to date, or whether you are required to “upgrade” them to contain the newest work. This is one of the reasons why you should usually <f0>not</f0> start by translating from a released version of the software, since that won’t give you up to date files.
ar: سواء حصلت على الملفات بهذه الطريقة أو تلك فعليك التأكد من إن كانت الملفات مُحدّثة أم أنّ عليك تحديثها بنفسك لتحوي آخر الإضافات من المقاطع. وهذا أحد أسباب أنك يجب <f0>ألا</f0> تبدأ الترجمة اعتمادا على أحد إصدارات البرمجية المتداولة لأنها قد لا تحتوي على أحدث الملفات.

source: For most FOSS projects you will be required to translate a single file. The most common format is .po, although several others exist, such as .ts, .properties and .php. The files are likely found in a directory called “po”, “locales”, “lang”, or something similar.
ar: أغلب مشروعات البرمجيات الحرة لا تتطلب سوى ترجمة ملف واحد يكون غالبا في نسق ‪.po‬ لكن هناك أنساق أخرى مثل ‪.ts‬ و ‪.properties‬ و ‪.php‬، وغالبا ما تكون الملفات في دليل يسمى “po” أو “locales” أو “lang” أو شيء مماثل.

source: Many projects are dependent on translations done outside of the main project, such as those done by software libraries. For a fully translated application, it might be necessary to complete these translations as well. Ask the programmers if you are in doubt.
ar: تعتمد كثير من المشروعات على برمجيات أخرى خارج المشروع الأساسي (مثل المكتبات البرمجية) ولتكتمل ترجمة التطبيق تنبغي ترجمة تلك البرمجيات الأخرى. اسأل المطورين إذا لم تكن متأكدا.

source: In some cases there might be a special procedure for adding a new translation. For example, it is common to put a line with your language code in a file called LINGUAS. There might also be a convention to add an entry to the ChangeLog for each change to the software. This differs from project to project, so check the project documentation.
ar: أحيانا يوجد إجراء معيّن لإضافة ترجمة مستحدثة، فمثلا تشيع الحاجة إلى إضافة رمز اللغة في ملف يسمى LINGUAS، وقد يكون من المعتاد ذِكرُ إضافة اللغة الجديدة في سِجِلِّ التغييرات (ملف يسمى ChangeLog). يتفاوت هذا من مشروع لآخر وعليك مراجعة الوثائق.

source: In the case where the project provides files that can’t be opened directly in translation tools, you might need to look into converting these files into a translation format. In many cases, this is important, and have many advantages. Read more here:
ar: في حال ما كان من غير الممكن فتح الملفات التي يوفرها المشروع مباشرة في أدوات الترجمة فقد يتوجب في هذه الحالة تحويلها إلى أحد أنساق ملفات الترجمة. في كثير من الحالات يكون هذا التحويل مهما و ذا مميزات عديدة. اطلع على المزيد عن هذه المسألة في:

source: The Translate Toolkit has several converters used by many FOSS projects to translate their files (see page <bf0>9</bf0>). Several other converters also exist, such as po4a and xml2po.
ar: تحتوي عُدَّة الترجمة على عدد من أدوات تحويل الصيغ التي تستخدمها كثير من المشروعات الحرة (راجع صفحة <bf0>12</bf0>)، كما توجد مُحوِّلات أخرى مثل po4a و xml2po.

source: You will be required to interact with people while you are involved in a project. This section describes some of the ways that FOSS projects commonly communicate and transfer information between people.
ar: عند انخراطك في أي مشروع ستحتاج للتواصل مع الآخرين. يشرح هذا القسم بعضا من أساليب التواصل الشائعة في مشروعات البرمجيات الحرة.

source: E-mail
ar: البريد الإلكتروني

source: A <f0>mailing list</f0> is a system that distributes e-mail to subscribers to facilitate group discussion by e-mail. Any e-mail sent to the mailing list address is automatically distributed to all subscribers. A lot of projects use mailing lists for communication between project contributors. There might be a single list for programmers, users and translators, or several mailing lists each with its own purpose. You will often need to join a mailing list to meaningfully take part in a project. It might be the best way to be notified of upcoming releases, have your questions answered, and get the know more about the project.
ar: <f0>القوائم البريدية</f0> نظام لتوزيع رسائل البريد الإلكتروني إلى المشتركين لتسهيل النقاشات الجماعية عبر البريد، فأي رسالة ترسل إلى عنوان القائمة البريدية تُرسل تلقائيا إلى كل المشتركين في القائمة. تستخدم القوائم البريدية للتواصل بين المشاركين في كثير من المشروعات، وقد توجد قائمة واحدة للمطورين والمترجمين والمستخدمين، أو عدة قوائم بريدية؛ واحدة لكل غرض. في الأغلب ستحتاج للاشتراك في أحد القوائم البريدية لتستطيع المساهمة بفعالية في المشروع، وقد تكون هذه أفضل طريقة لتطلع على تطورات المشروع والإصدارات الوشيكة والاستجابة إلى استفساراتك.

source: Note that a lot of FOSS projects prefer such mailing lists to keep to the intended topic. Any off-topic discussion, advertisements or purely social use of a mailing list will be unacceptable in many projects. There might also be conventions about whether attachments are allowed in messages to the list, etc. As you receive some messages from the list, you might notice some of the conventions. You should never add the mailing list address to other services like social networks.
ar: لاحظ أن كثيرا من مشروعات البرمجيات الحرة تفضل المحافظة على الغرض الأساسي للقائمة البريدية، وأية نقاشات بعيدة عن غرض القائمة، أو دعاية، أو استخدام للقائمة في الأمور الاجتماعية ليس مرحب به في الكثير من المشروعات. كما قد توجد قواعد أخرى حسب أعراف كل قائمة، مثل السماح بالمرفقات من عدمه إلى غير ذلك، و قد تستنتج بعضا من تلك القواعد من الرسائل التي تصلك من القائمة، كما ينبغي عليك تجنب إضافة عنوان القائمة البريدية إلى خدمات الشبكات الاجتماعية وما شابهها.

source: Remember that most of these mailing lists are usually archived and publicly available. Any e-mail you send will show your e-mail address, and the content will be available to anybody with web access. Always stay polite and refrain from arguments. Keep in mind that the members of these lists are usually from different backgrounds, and people will have different cultural values and abilities in English. Do your best to be very clear in what you say or ask.
ar: تذكر أن أغلب هذه القوائم البريدية مؤرشفة ومتاحة للعموم، وأي رسالة ترسلها سيظهر بها على الأغلب عنوان بريدك وسيُتاح محتواها لأي شخص يستطيع الوصول إلى الوب. التزم بآداب الحوار وابتعد عن الجدال غير المبرر وضع في حسبانك تباين الخلفيات الثقافية لأعضاء القوائم وتفاوت مستويات تمكنهم من اللغة الإنگليزية. حاول أن تكون مراسلاتك واضحة بقدر ما تستطيع.

source: It is usually not considered a good idea to contact any specific project member directly by e-mail, unless this is an indicated way to do something (like submitting your translation) or if you get to know the person involved well. Therefore you should always use the mailing list address for answering, and thereby ensure that relevant discussions stay on the mailing list for everyone’s benefit.
ar: لا يحبذ إرسال رسائل مباشرة إلى عضو بعينه في المشروع ما لم يكن هناك داع (كأن تكون هذه الطريقة التي يعتمدها المشروع لإيداع الترجمات) أو أن تكون بينكما معرفة شخصية. لذا دوما الرد على المراسلات على عنوان القائمة البريدية، لضمان تضمين النقاشات في القائمة ليستفيد منها الجميع.

source: Chat channels
ar: قنوات الدردشة

source: Several FOSS projects use chat services such as IRC as an additional communication medium. It is sometimes used for user support, or for more interactive discussions. It might the best way to get a quick answer to a question, or to learn some procedure that might involve a few questions and answers. Although chat programs are often the recommended way to join these channels, you might also be able to use your web browser.
ar: تتخذ العديد من المشروعات الحرة من خدمات الدردشة مثل IRC وسيلة إضافية للتواصل، لمساعدة المستخدمين أو لنقاشات أكثر تفاعلية، وقد تكون هي الوسيلة المثلى للحصول على إجابات سريعة أو الاستعلام عن مسألة تتطلب عدة أسئلة وأجوبة. عادة ما تستخدم برمجيات الدردشة للانضمام إلى تلك القنوات لكن يمكن أحيانا استخدام متصفح الوب.

source: Although several people might seem to be in a channel, it might be that they are not actually at their computer and reading your message. Always be patient for an answer, and stay in the channel while waiting for an answer. It is not uncommon for people to get back to their computer after lunch or a meeting and answer you after an hour of waiting. People might even be in another time zone than you are, and might only see your question after waking up.
ar: قد يظهر أن أشخاصا عديدين موجودون في القناة لكنهم في الواقع قد لا يكونون أمام حواسيبهم في ذلك الوقت وبالتالي لا يقرؤون رسالتك، لذا عليك أن تتحلى بالصبر و المكوث في القناة ريثما تصلك الإجابة، فكثيرا ما يعود الأشخاص إلى حواسيبهم ويردون عليك بعد ساعة مثلا. وقد يكونون في توقيت مختلف عن توقيتك فلا يرون رسالتك إلا بعد استيقاظهم.

source: Just as with mailing lists, you should be polite, and it is possible that communication in the channel is logged and publicly available. When you have a question to ask, simply <t0/>ask it. It isn’t necessary to ask if you can ask a question. In most channels the participants would prefer that you state your question up front with all relevant information.
ar: مثلما في القوائم البريدية، عليك الالتزام بآداب الحوار، كما قد يكون سِجِلُّ المحادثات في القناة منشورا للكافة. إذا كان لديك سؤال فاسأله مباشرة، فليس عليك الاستئذان قبل السؤال، ففي كثير من القنوات يفضل المشاركين أن تصوغ سؤالك بكل التفاصيل المطلوبة منذ البداية.

source: <f0>Never paste large amounts of text in a channel. Some servers might cut your connection, and it is not a pleasant way to work with many lines of text. Better ways might be e-mail, or a </f0><f1>pastebin</f1><f2> – a web site where you can paste text and then only use the link in the chat channel.</f2>
ar: لا تلصق أبدا مقاطع كبيرة من النصوص إلى القناة، فقد تقطع بعض الخواديم اتصالك بسبب ذلك، كما أن سطور النص الطويلة الكثيرة تزعج المشاركين في القناة. من الأفضل في هذه الحالات التراسل بالبريد الإلكتروني، أو وضع النص الذي تريد إطلاع غيرك عليه على إحدى خدمات <f1>pastebin</f1>، و هي خدمات على الوب يمكن لصق النص فيها الربط إليه من الحوار في القناة.

source: Bug trackers
ar: مُقتَفِياتُ العِلّاتِ

source: Many projects make use of a <f0>bug tracker</f0> such as Bugzilla or Trac – a web based system where problems, requests, and improvements to the software are planned and discussed. A link is usually provided on the project’s web site.
ar: تَستخدم مشروعات كثيرة <f0>مقتفيات علات</f0> مثل بگزيلا أو تراك، وهي نظم تُدرَجُ فيها المشكلات والطلبات والتحسينات المقترحة على البرمجيات فتُناقش و يُخطط لها. عادة ما يوضع رابط إليها في موقع المشروع.

source: You might be expected to submit your translations in such a system. Additionally, this might be the best place to report any errors you find in the original source text that you translate. Although there are often many fields, don’t worry about them. You can usually just leave any difficult ones at their default values. In time you might learn each project’s preferred way of filling in these forms.
ar: قد يُطلب منك إيداع الترجمات عبر أحد هذه النظم، كما قد تكون المكان المناسب للإبلاغ عن أية أخطاء تجدها في النص المصدر الذي تترجمه. توجد حُقول عديدة في استمارة البلاغ لكن لا تشغل بالك بها واترك ما لا تعرف معناه منها على قِيَمِها المبدئية، ومع الوقت ستفهم الأسلوب المفضل في كل مشروع لملء تلك الاستمارات.

source: Wikis and forums
ar: الويكيّات والمنتديات

source: Wikis are sometimes used to build a project’s website, project documentation, or even instructions for participants. The idea of a wiki has become well known due to Wikipedia. You might want to get involved in translating the project documentation or website, and some of this might happen in wikis. Spend a little bit of time to ensure that you are familiar with the wiki syntax used for the project wiki (how to format the text).
ar: أحيانا يستخدم ويكي لبناء موقع المشروع أو وثائقه بما فيها توجيهات المشاركة. قد تشاركُ في ترجمة موقع المشروع أو وثائقه وقد يجري ذلك عبر الويكي، لذا عليك التآلف مع استخدام صيغ تنسيق النصوص في ويكي.

source: Forums are not very common in FOSS projects, but are sometimes used for user support or discussions among participants. You might want to help out with user support in your language when you are familiar with the software.
ar: ليس من الشائع استخدام المنتديات في مشروعات البرمجيات الحرة، لكنها قد تستخدم أحيانا لمساعدة المستخدمين أو للنقاشات بين المشاركين، وقد تُحبُّ استخدامها لمساعدة المستخدمين بلغتك، و هي مساهمة قيّمة المشروع، لكن استطلع إن كانت النقاشات بلغات غير الإنگليزية مسموح بها، أو اطلب قسما للدعم التقني بلغتك.

source: If we believe that software localisation is important, obviously documentation and support in the user’s language is also important. For small languages there might never be enough people to help with all these things, so remember to prioritise your work and keep your goals in mind.
ar: إن كنت تؤمن بأهمية توطين البرمجيات فاعلم أن وجود المساعدة والوثائق بلغة المستخدم مهمة أيضا. قد لا يتوفر عدد كاف من الناس لأداء كل هذه المهام (خاصة للغات الصغيرة) لذا لا تنسَ تحديد أولوياتك ووضع أهدافك نصب عينيك.

source: We briefly mentioned version control systems in an earlier section. Although there are many things to learn about version control systems, you will probably only need to know a few basic operations to contribute translations. Find out which version control system is used in the project, and find out how to do the following:
ar: عرجنا فيما سبق على نظم إدارة الإصدارات. يوجد الكثير مما ينبغي تعلُّمُه عن هذه النظم لكنك في الأغلب لا تلزمك سوى معرفة بعض الإجراءات الأساسية للمساهمة بالترجمة. اعرف أي نظام لإدارة الإصدارات يستخدمُ المشروعُ وكيفية أداء المهام التالية به:

source: Get the complete project with all files from version control
ar: جلب نسخة كاملة من المشروع بها كل الملفات

source: How to update the files at a later stage to the newest changes made by others
ar: كيفية تحديث الملفات لاحقا إلى آخر التغييرات التي حدثت في المشروع

source: How to submit a file
ar: كيفية إيداع ملف

source: If you can do these things, you will probably be able to do most of what is expected from you. Although all changes can be undone in a version control system, you shouldn’t be careless or make any unnecessary changes. Ensure that you know the following:
ar: تغطي هذه الأمور أغلب المهام المطلوبة منك. بالرغم من أنه يمكن التراجع عن أي تغييرات باستخدام نظام إدارة الإصدارات إلا أن عليك الحرص ألا تُحْدِث تغييرات بلا سبب. اعرف ما يلي:

source: When you are allowed to submit a file
ar: متى يُسمح لك بإيداع الملفات

source: If any specific commit message is expected
ar: إن كان إدخال رسالة في السجل مطلوبا عند الإيداع الملف

source: Whether there are any other changes you might need to make (such as a LINGUAS <t0/>file)
ar: إن كان عليك التعديل في ملفات أخرى (مثل ملف LINGUAS)

source: If you need to do any specific preparation before you commit, such as switching to a different branch
ar: إن كانت تجهيزات معينة مطلوبة قبل الإيداع مثل التحول إلى فرع آخر

source: <f0>Branches</f0> are usually a way of doing work on two different versions of a product at the same time. You might need to only submit your translation to one version of the product, and therefore only to one branch in the version control system. Ask the programmers if you are unsure.
ar: <f0>الفروع</f0> أسلوب للعمل بالتوازي على إصدارتين مختلفتين من برمجية ما في الوقت ذاته. قد يتوجب عليك إيداع الترجمات في إصدارة بعينها وبالتالي في فرع بعينه في نظام إدارة الإصدارات، وعليك سؤال المطورين للتأكد.

source: Some of the principles of version control systems are explained here:
ar: تشرح الصفحة التالية بعض مبادئ نظم إدارة الإصدارات:

source: Each software project has its own schedule and pace of development. If a project releases new versions very often and accepts translations at any time, you can probably contribute your translation whenever it suits you. For projects that only release on certain occasions, you want to ensure that your work will be useful to as many people as possible, so you should try to think strategically about your participation in the project.
ar: لكل مشروع برمجي جدوله و إيقاعه الذي يسير عليه. فالمشروعات التي تُصدِر إصدارات جديدة بسرعة وتقبل الترجمات في أي وقت تمكنك المشاركة فيها في الوقت الذي يناسبك. أما المشروعات التي تُصدِر في مناسبات معينة فتتطلب تخطيطا جيدا لمشاركتك في المشروع لتضمن أن يستفيد من عملك أكبر عدد من الناس.

source: It is common for projects to announce their release plans in advance and ask translators to update their translations. This is an excellent time to contribute your translation, as it is probably an indication that the developer is actually thinking about translators, and is trying to create good circumstances for them to do their work in. If you are starting with a new translation of a project, you should take extra care to ensure you have enough time to complete the whole task and do the testing. Read more in the section on “<bf0>Counting and estimating</bf0>” on page <bf1>56</bf1> and about “<bf2>Testing and review</bf2>” on page <bf3>53</bf3>.
ar: من المُعتاد أن تُعلِنَ المشروعاتُ عن خُطط الإصدارات مقدما وأن تَطلبَ من المترجمين تحديث ترجماتهم، و يكون هذا الوقت هو الأنسب لتساهم فيه بترجمتك، إذ قد ينم هذا عن انصباب اهتمام المطور بالمترجمين وسعيه لتوفير بيئة مناسبة لمساهماتهم و تقديم الدعم لهم. إذا كنت تستحدث ترجمة جديدة فاحرص على أن يكون أمامك وقت كافٍ للانتهاء من الترجمة واختبارها. اقرأ المزيد في قسم “<bf0>العدُّ والتقدير</bf0>” في صفحة <bf1>53</bf1> و قسم “<bf2>الاختبار والمراجعة</bf2>” في صفحة <bf3>51</bf3>.

source: If you are translating a really large project for the first time, you probably need to start long before such an announcement anyway, which means that you are somewhat less affected by it for the biggest part of your work.
ar: إذا كنت تترجم مشروعا ضخما للمرة الأولى فقد يكون عليك البدء في العمل قبل مثل هذا الإعلان بفترة كبيرة على أيّ حال، لذا فلن يؤثر الإعلان كثيرا خلال القسم الأكبر من عملك.

source: Such an announcement from a developer coincides with a phase called the <f0>string freeze</f0>. This means that the text that needs to be translated is finalised for the release, and no further changes are planned for the text. This means that you can do your translation work knowing that you are translating the final text and probably won’t need to adapt your translations to changes in the original text until the release happens. Such an announcement might also specify which software version will be released, and maybe which branch in the version control system should be used. If you are unsure, ask the relevant developers – you don’t want to spend your time translating the wrong version!
ar: يتواكب الإعلان عن تلقّي الترجمات مع مرحلة تسمى <f0>تجميد النصوص</f0> وتعني تثبيت النصوص للإصدارة الوشيكة فلا تُحدث فيها أية تغييرات، وهو ما يتيح للمترجمين فرصة العمل على الترجمة دون خشية تغير النص قُبيل الإصدار. وقد يحدد هذا الإعلان الإصدارة الوشيكة و أي أفرع نظام إدارة الإصدارات سيُستخدم. فإن لم تكن متأكدا فاسأل المطورين ولا تخاطر بالعمل على الإصدارة الخطأ.

source: If you start too late, you might not complete the work, or you might be too late for your contribution to be accepted into the release. Starting earlier is usually safer, but not necessarily better. If you start before the string freeze, you might need to make extra changes when the final string freeze is announced. If you stay up to date with the news in the project, you can avoid disappointment.
ar: إذا بدأت متأخرا كثيرا فقد لا تتم العمل في الموعد فتتأخر على موعد قبول المساهمات في تلك الإصدارة. البدء مبكرا آمن لكن أحيانا لا يكون أفضل، فإذا بدأت قبل تجميد النصوص فقد تطرأ تغييرات قبل إعلان تجميد النصوص. لكن إن استشعرت أن التغييرات المحتملة في النصوص قد تكون قليلة،و الوقت اللازم لتداركها أقل من الوقت اللازم للعمل على الترجمة كلها، فقد يكون من المجدي العمل على الترجمة على أية حال. متابعة أخبار المشروع تجنبك الإحباطات.

source: Motivations
ar: الدوافع

source: As mentioned earlier, people will have different motivations to contribute to FOSS projects. Some developers do it as a hobby, or to solve some problem that they wanted to solve. Some contributors work for companies who contribute to FOSS projects for several <t0/>reasons. The important thing to realise is that many of the people you encounter in a FOSS project, might be involved there for different reasons than you are. If you want to get help from someone, it might demand some of their time, and they might not be able to help you right away because they are at work. Someone might not be interested to help you because they are not interested in the specific issue you need help with. Usually people are quite helpful, but it is useful to keep in mind that very few people have an obligation to help you. Therefore always be polite, especially when asking for help. Also try to help other people in the project when you can. There is a big culture of doing favours in FOSS projects, so remember that they are favours, and try to do the same to others.
ar: كما ذكرنا سابقا، تختلف دوافع الناس للمشاركة في مشروعات البرمجيات الحرة، البعض يتخذها هواية أو لحل مشكلة واجهتهم شخصيا، والبعض يعمل في شركات تساهم في البرمجيات الحرة لدوافع عديدة. المهم أن تعي احتمال اختلاف دوافع الناس الذين تقابلهم في البرمجيات الحرة عن دوافعك، وعندما تطلب المساعدة من شخص ما فهذا يستغرق منه وقتا و جهدا وقد ينشغل بعمله عن مساعدتك، وقد لا يهتم شخص ما بمساعدتك لأن الأمر الذي تطلب المساعدة فيه لا يستهويه. عادة ما يسعى الناس لمساعدتك لكن عليك إدراك أن أغلبهم غير ملزمين بذلك، لذا عليك التأدب دوما، و بالذات عند طلب المساعدة. كما عليك السعي لمساعدة الآخرين بقدر استطاعتك. ثقافة عمل المعروف منتشرة في أوساط البرمجيات الحرة، لذا تذكر أنك تطلب معروفا وأن عليك أن تُسدي مثله للآخرين.

source: Licences
ar: الرُّخص
