Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: This is not frequently required, and you might never need to bother with such formatting. For more information, see the possible choices for formatting variables:
ar: لا يطرأ هذا كثيرا وقد لا تعرض له أبدا. لمزيد من المعلومات، طالع:

source: Localisation tools
ar: أدوات التوطين

source: We introduced the two main localisation tools discussed in this book earlier on page <bf0>9</bf0>. Virtaal and Pootle complement each other and together fulfil most of the functionality a translation team should need. Pootle allows translation online and offline with a focus on volunteer contribution. Virtaal is a powerful translation tool focused on simplicity and productivity, and works well with or without an internet connection. You can always download files from Pootle for translating offline in Virtaal if you prefer.
ar: تناولنا أداتي التوطين الرئيسيتين في هذا الكتاب في صفحة <bf0>12</bf0>. يكمل فِِرتال وبُوتِل بعضهما البعض لتحقيق وظائف عديدة مما يحتاجه فريق الترجمة. يُمكِّن بُوتِل من الترجمة عبر الإنترنت أو بدونها مع التركيز على المشاركات التطوعية، بينما فرتال أداة ترجمة تركز على البساطة وتعظيم الإنتاجية وتعمل في وجود اتصال بالإنترنت أو بدونه. بالإمكان تنزيل الملفات من بوتل لترجمتها في فرتال على حاسوبك إن كنت تفضل هذا.

source: Virtaal is a powerful translation tool, yet simple to use. You can increase your productivity by ensuring you know all the shortcuts and tricks and without being distracted by a cluttered interface.
ar: فرتال أداة ترجمة قوية وبسيطة في آن. يمكنك بها زيادة إنتاجيتك بمعرفة اختصارات وحِيَل أخرى دون أن تشتتك واجهة متخمة بالوظائف.

source: Although most features are available using the mouse, Virtaal is designed to encourage you to work as much as possible with your keyboard to increase your speed and keep the translation fun.
ar: مع أن أغلب وظائف فرتال يمكن الوصول إليها بالفأرة إلا أنها صممت لتساعد على أداء العمل بلوحة المفاتيح قدر الإمكان لزيادة السرعة وجعل الترجمة أكثر متعة.

source: Opening a file
ar: فتح ملف

source: Mostly you should be able to simply open a translation file by clicking on the file in your file manager. The file might be associated with another program in which case you can look for Virtaal in the context menu by right-clicking on the file.
ar: في أغلب الأحوال يمكن فتح ملف الترجمة بالنقر عليه في مدير الملفات، لكن في حال كان الملف مرتبطا ببرمجية أخرى فيمكن البحث عن فرتال في قائمة السياق بالنقر الأيمن على الملف.

source: You can also run Virtaal and open a file with File→Open or Ctrl+O.
ar: يمكن أيضا تشغيل فرتال ثم فتح ملف من قائمة ملف←افتح أو <Ctrl+O>.

source: Supported file formats include:
ar: تشمل أنساق الملفات المدعومة:

source: OmegaT glossaries
ar: مسارد OmegaT

source: Normal translation
ar: أسلوب الترجمة المعتادة

source: After opening a file, the first translation unit will be shown with your cursor in the field below the source text. You can simply type your translation and press <Enter> when finished - just like in your word processor. Note that <Enter> moves you to the next position where you want to type. In the case of units with plurals, enter will take you to the next line in the same unit.
ar: بعد فتح الملف ستظهر أول وحدة ترجمة و سيكون مؤشر الكتابة في الحقل أسفل النص المَصدَر، فيمكن ببساطة كتابة الترجمة ثم ضغط <Enter> عند الانتهاء من الوحدة، مثل أي محرر نصوص. لاحظ أن <Enter> تنقلك إلى الموضع التالي الذي ستكتب فيه، ففي حالة وحدات ترجمة الجموع ستنقلك إلى السطر التالي في نفس الوحدة.

source: If you have the correct spell checkers installed, spell checking should be active for both the source and the target text.
ar: إذا كان في النظام مدقق إملائي مُنصَّب فسيُفعَّل التدقيق الإملائي للترجمة وللنص المصدر أيضا.

source: You can undo normally using Ctrl+Z.
ar: يمكنك التراجع عما كتبته بضغط <Ctrl+Z> كالمعتاد.

source: Time savers
ar: أسلوب اختصار الوقت

source: Auto-completion
ar: الإكمال التلقائي

source: Virtaal will save you some time by trying to complete some long words for you. You will see the auto-completion suggesting a possible word, and the suggestion can be accepted by pressing <Tab>. If the suggestion is not what you want, you can simply continue typing the word you had in mind. If you accepted a suggestion that you don't want, you can simply undo normally with Ctrl+Z.
ar: يوفر فرتال عليك بعض الوقت بمحاولة إكمال الكلمات الطويلة. ستقترح وظيفةُ الإكمال التلقائي كلمة محتملة ويمكنك قبول الاقتراح بضغط <Tab>، أو إذا لم يكن الاقتراح هو المطلوب فيمكنك مواصلة الكتابة، وإذا قبلت اقتراحا لا تريده فيمكنك التراجع عنه بضغط <Ctrl+Z> كالمعتاد.

source: Auto-correction
ar: التصويب التلقائي

source: Virtaal will save you some time by fixing certain common typing mistakes or spelling errors. How mistakes are corrected depends on your language, and there might possibly not be information for your language yet. Feel free to get involved in the project to improve this feature for your language.
ar: يُوفر فرتال عليك بعض الوقت بتصويب بعض أخطاء الكتابة الشائعة، لكن هذا التصويب يعتمد على اللغة فبعض اللغات لا يحتوي فرتال على معلومات تصويب لها. ندعوك إلى المشاركة في المشروع لتحسين هذه الوظيفة للغتك.

source: If Virtaal automatically corrected something which you didn't want, you can simply undo the step with Ctrl+Z.
ar: إذا صوَّبَ فرتال تلقائيا شيئا لا تريده فيمكن التراجع عنه بضغط <Ctrl+Z>.

source: Copy original to target
ar: نسخ النصّ المَصدَر إلى الترجمة

source: Sometimes it is easier to have the original string as a start to only replace a few translatable elements. Translations containing XML markup or many variables might be more work to type again than to just start with the source text. You can easily copy the original text into your translation area by pressing <Alt+Down>.
ar: في بعض الأحيان يكون من الأيسر نسخ النص المصدر كما هو إلى الترجمة ثم استبدال الأجزاء التي تتطلب ترجمة، خاصة في النصوص التي تحتوي على رَقْم XML أو كثيرا من المتغيرات التي تستغرق كتابتها وقتا أطوَل مما إذا نسخت من النص المصدر. يمكنك نسخ النص المصدر إلى حقل الترجمة بيسر بالضغط على <Alt+Down>.

source: For some languages, you will see how Virtaal automatically changes the punctuation marks to fit the conventions of your language. This could involve quotation or other punctuation marks, or the spacing between certain elements. For example, a “quotation” automatically becomes a « quotation » in French, without the translator having to change the quote characters or the spacing.
ar: في بعض اللغات يَستبدِل فِرتال علامات الترقيم تلقائيا لتناسب قواعد اللغة الوجهة، مثل الفاصلة أو التنصيص أو غيرها من علامات الترقيم، أو المسافات بين العناصر. مثلا ‪“item, item?”‬ ستتحول تلقائيا إلى ‪“item، item؟”‬ في العربية دون تدخل من المترجم.

source: If you don't want the changes to the source text that Virtaal automatically did, you can simply undo the step with Ctrl+Z.
ar: إذا كنت لا تريد هذه التغييرات التلقائية في النص فيمكن التراجع عنها بضغط <Ctrl>+Z.

source: Copy a placeable to the target
ar: نسخ مُدْرَج إلى الترجمة

source: Placeables are special parts of the text that can be automatically highlighted and easily inserted into the translation. You will see that certain parts of the source text will be highlighted. To select which placeable to insert, press <Alt+Right> to move the highlighting to the correct placeable. You can insert the currently highlighted placeable by pressing <Alt+Down>. After you have inserted a placeable, the next placeable will be highlighted.
ar: المُدْرَجات مقاطع خاصة من النص يمكن إبرازها تلقائيا وإدراجها بسهولة في الترجمة. سترى أن بعض مقاطع النص مُبرَزة على نحو خاص، ويمكن تحديدها بضغط <Alt+Right> ثم ضغط <Alt+Down> لإدراجها في الترجمة، بعدها سيُبرَز المُدْرَج التالي.

source: Copy a term to the target
ar: نسخ مصطلح إلى الترجمة

source: Highlighted text will show which terms Virtaal recognised, and allow you to handle them as placeables. You can use <Alt+Right> and <Alt+Down> the same way as with other placeables. If there is more than one suggestion for a term, Virtaal will display the choices in a menu. Select the translation you want, or press <Escape> to continue typing.
ar: تظهر النصوص التي يتعرف عليها فرتال مبرزة على نحو خاص، ويمكن التعامل معها مثل المُدْرَجات، فيمكن استخدام <Alt+Right> و <Alt+Down> بذات الأسلوب. إذا كان للمصطلح أكثر من اقتراح فسيعرض فرتال الاقتراحات في قائمة ويمكن اختيار الترجمة المختارة أو ضغط <Escape> ومواصلة الكتابة.

source: Use a suggestion from TM or MT
ar: استعمال اقتراحات ذاكرة الترجمة أو الترجمة الآلية

source: If Virtaal has a suggestion obtained from translation memory or machine translation, it is displayed underneath the editing area. You can put the first suggestion into the target text with Ctrl+1, or use Ctrl+2, etc. to select the others. You can also double click the suggestion to obtain the same effect.
ar: إن كانت لدى فرتال اقتراحات من ذاكرة الترجمة أو الترجمة الآلية فسيعرضها تحت منطقة التحرير، و عندها يمكنك وضع المُقتَرَحِ الأول في حقل الترجمة بضغط <Ctrl+1> أو الثاني بضغط <Ctrl+2> وهكذا، أو بالنقر المزدوج بالفأرة على الاقتراح الذي تريده.

source: Navigation
ar: التنقل

source: Above we saw how we can easily advance to the next point of translation by pressing <Enter>. You can also move around easily between rows with <Ctrl+Down> and <Ctrl+Up>. To move in large steps, use <Ctrl+PgDown> and <Ctrl+PgUp>.
ar: رأينا سابقا كيف ننتقل إلى النقطة التالية في الترجمة بضغط <Enter>. يمكن كذلك الانتقال بين الصفوف بضغط <Ctrl+Down> و <Ctrl+Up>، أو ضغط <Ctrl+PgDown> و <Ctrl+PgUp> للانتقال بخطوات أكبر.

source: Virtaal will move you between certain rows. Normally it will move between all rows, but other ways of navigation can be selected at the top of the Virtaal window.
ar: سينقلك فرتال بين الصفوف على نحو معين، في المعتاد ينقلك بين كل الصفوف، لكن يمكنك اختيار طرق تنقل أخرى من أعلى نافذة فرتال.

source: Incomplete mode
ar: طَورُ النَّواقِصِ

source: If you activate the “Incomplete” mode, Virtaal will move between untranslated and unreviewed units. This allows you to quickly find the places where you need to work. Translations will still appear up between the same rows in the file so that you can see the context that you are translating in.
ar: إن فعَّلتَ طور “النَّواقِص” فإن فرتال سيستعرض لك الوحدات التي لم تُترجَم أو لم تُراجع، وهذا يُسرِّعُ لك إيجاد المواضع التي ينبغي العمل عليها. ستظهر الترجمات في ترتيبها كما هو بين جاراتها في الملف لتطّلعَ على السياق الذي تترجم فيه.

source: Searching mode
ar: طَورُ البحث

source: If you activate “Search” mode or simply press <F3>, Virtaal will move between all the rows that correspond to your search query. Translations will still appear between the same rows in the file so that you can see the context that you are translating in.
ar: عند تفعيل طَورِ البحث أو لو ضغطتَ <F3> سينقلك فرتال بين الصفوف التي تحوي النص الذي تبحث عنه. ستظهر الترجمات في ترتيبها كما هو بين جاراتها في الملف لتطّلع على السياق الذي تترجم فيه.

source: To move back from the search box to your translation, simply press <Enter>, or go back to another mode.
ar: يمكنك الانتقال من حقل البحث إلى حقل الترجمة بضغط <Enter> أو باختيار طَورٍ آخر.

source: Pootle is a popular web-based system for translation and translation management. It is used by several FOSS projects to manage their localisation work. Pootle allows online translation, and it has several features to help with review and team organisation. It is ideal for team work, casual contributions, and translation sprints (Translate@thons).
ar: بوتل نظام لإنجاز الترجمات وإدارتها عبر الوب تستخدمه كثير من مشروعات البرمجيات الحرة لإدارة صيرورة التوطين. يُعين بوتل على الترجمة عبر الوب، وله خصائص عديدة تُيسِّر مراجعة الترجمة وتنظيم عمل الفريق، وهو مناسب للعمل الجماعي وللمساهمين غير المتمرسين، ولمَرَثونات الترجمة.

source: A Pootle server can host one or several projects for any number of languages. Some servers are used to translate the software of one project into many languages, whereas others are used for coordinating the team work for a single language team on several localisation projects. Pootle allows team work with different roles for different team members. Pootle users can also make use of several features to help them improve their quality, such as terminology assistance, and quality checks.
ar: يمكن لخادوم بوتل أن يستضيف مشروعا أو أكثر بأي عدد من اللغات. تُستخدم بعض الخواديم لترجمة برمجيات مشروع واحد إلى لغات عدة، بينما تستخدم خواديم أخرى لتنسيق عمل فريق لغة واحدة على مشروعات توطين برمجيات عدة. يتيح بوتل إسناد أدوار مختلفة لأعضاء الفريق. يستطيع مستخدِمو بوتل الاستفادة من كثير من وظائفه في تحسين جودة الترجمة، مثل مَسرَد المصطلحات واختبارات الجودة.

source: Since Pootle is a web-based system, it is installed by server administrators, and the activity allowed on a Pootle server, is determined by them. To translate anything not yet on the server, contact the administrators. Realise that each Pootle server might have its own purpose and way of assigning permissions to volunteers.
ar: ولأن بوتل نظام يعمل عبر الوب تقع مهمة تنصيبه وتحديد الوظائف المسموح بها على عاتق مدراء الخواديم. إذا أردت ترجمة شيئ ما ليس موجودًا على الخادوم فعليك الرجوع إلى مدير النظام. لا تنسَ أنه قد يكون لكل خادوم بوتل غرض معين و طريقة مختلفة لإدارته ولإعطاء الصلاحيات للمتطوعين.

source: Most Pootle functionality require you to log in with an account.
ar: أغلب وظائف بوتل تتطلب ولوج المستخدم بحساب على الخادوم.

source: Finding your work
ar: إيجاد ما تترجمه

source: From the front page of a Pootle server, you can discover the available projects and languages on the server. A summary of the progress is shown to get an impression of the completeness and activity for a specific project or language. Once you have selected the language and project, you will see more detailed statistics about every file in the project, and have access to more functions for translation and review.
ar: سترى في صفحة بوتل الرئيسية المشروعات واللغات الموجودة على الخادوم، كما ستجد ملخصًا بتقدم كل مشروع أو لغة يطلعك على درجة اكتماله ونشاطه. عند اختيار لغة أو مشروع ستجد إحصائيات أكثر تفصيلا عن كل ملف في المشروع، كما ستتاح لك وسائل الترجمة والمراجعة.

source: If you want to translate, the “Translate” tab provides access to the features for both online and offline translation. To quickly go to the incomplete parts of the project, choose “Quick Translate” for the file or directory. To translate offline, download the appropriate file or files. After completing the work offline in Virtaal, use the upload form at the bottom of the page to submit the work back to the Pootle server.
ar: إذا أردت الترجمة سيتيح لك لِسانُ “ترجم” الوصول إلى خصائص الترجمة سواء تنزيل الترجمات للعمل عليها على حاسوبك أو الترجمة في بُوتل عبر الإنترنت. للوصول السريع إلى الأجزاء غير التامة من الترجمة اختر “ترجم بسرعة” للملف أو الدليل الذي تريد. ويمكن تنزيل الملفات التي تريدها لترجمتها على حاسوبك (باستخدام فِرتال مثلا) وبعد تمام الترجمة استخدم استمارة رفع الملف التي في أدنى الصفحة لإيداع العمل في الخادوم.

source: To review work (even your own work), visit the “Review” tab. It provides access to suggestions left by team members as well as quality checks that might indicate possible places of improvement in the translation.
ar: لمراجعة الترجمة (بما فيها ترجماتك أنت) اذهب إلى لسان “راجع” الذي يتيح لك الوصول إلى الاقتراحات التي أضافها أعضاء الفريق بالإضافة إلى اختبارات الجودة التي قد تشير إلى مواضع تتطلب التحسين.

source: If you are the administrator for this project or language, you might also be able to configure permissions and perform certain file management work. Refer to the Pootle documentation for more information on these features.
ar: إذا كانت لك صلاحيات إدارة هذا المشروع أو اللغة فتستطيع أيضا ضبط الصلاحيات وأداء مهام الإدارة الأخرى. راجع وثائق بُوتل لمزيد من المعلومات عن هذه الخصائص.

source: Server administrators can add languages, projects, and also provide translation templates (refer to the section on “<bf0>A simple localisation process</bf0>” on page <bf1>45</bf1> to understand the role of templates). There should be contact details to allow Pootle users to contact the server administrators.
ar: بوسع مدراء الموقع إضافة لغات أو مشروعات جديدة وقوالب للترجمة (راجع قسم “<bf0>صيرورة توطين بسيطة</bf0>” صفحة <bf1>45</bf1> لمعرفة فائدة القوالب). عادة ما تُنشر بيانات اتصال ليُمكن للمستخدمين التواصل مع مديري الخادوم\مشروع الترجمة.

source: Pootle can help translators with terminology. Terminology can be specified to be global per language, and can be overridden per project for each language. A project called “terminology” can contain any files that will be used for terminology matching.
ar: قد يساعد بُوتل المترجمين في مسألة المصطلحات، فيمكن وضع مسرد مصطلحات عام لكل لغة مع إمكانية تخطيها بإضافة مسارد لكل مشروع على حدة. يمكن يحتوي مشروع يسمى “terminology” على أية ملفات تستخدم لمطابقة المصطلحات.

source: Project administrators can generate a list of frequently occurring terms from the “Translate” tab in the Pootle interface, which can help to quickly standardise some frequently occurring terms. It is also possible to add extra entries.
ar: يستطيع مديرو المشروعات توليد قائمة المصطلحات المتواترة من لسان “ترجم” في واجهة بُوتل، ويمكن أن يساعد هذا في تسريع توحيد المصطلحات المتواترة، كما يمكن إضافة مصطلحات أخرى إلى القائمة يدويًا.

source: Suggestions
ar: الاقتراحات

source: Pootle has the ability to optionally allow users to provide suggestions that need to be reviewed before they are accepted into the real translation files. Who is allowed to do what is determined by the configuration of permissions for the project or the server.
ar: يمكن في بوتل إعطاء المستخدمين صلاحية اقتراح ترجمات تحتاج من يراجعها قبل اعتمادها في الترجمة النهائية، وتتحكم في هذا إعدادات صلاحيات الخادوم أو المشروع.

source: This allows for a team to form with different roles for different team members, and makes it possible to have a more explicit review step that requires suggestions to be checked before they become the real translations. This also allows the collection of alternative translations.
ar: يتيح هذا إسناد أدوار مختلفة لأعضاء الفريق مع إمكانية جعل المراجعة خطوة إجبارية قبل اعتماد أي اقتراحات. كما يتيح هذا جمع ترجمات بديلة.

source: Quality checks
ar: اختبارات الجودة

source: Pootle provides a powerful way of reviewing translations for quality by testing for several issues that can affect the quality of your translations. Refer to the section about “<bf0>Automated review</bf0>” on page <bf1>53</bf1>.
ar: في بوتِل وظيفة لمراجعة جودة الترجمات بفحص عدة مؤشرات يمكنها أن تدل على نقاط ضعف في الجودة. طالع قسم “<bf0>المراجعة المؤتمتة</bf0>” في صفحة <bf1>51</bf1>.

source: If Pootle indicates a possible problem with a translation, it doesn't mean that the translation is necessarily wrong, just that you might want to review it. Pootle administrators should indicate the correct project type (GNOME, KDE, Mozilla, etc.) in the administration pages. This will improve the accuracy of the quality checks.
ar: ليست كل المشاكل التي يشير إليها بُوتل أخطاء فعلية، إنما هو تنبيه باحتمال وجود خطأ عليك مراجعته. على مدراء بوتل تحديد نوع المشروع (گنوم، كدي، موزيلا، إلخ.) في صفحات الإدارة لمساعدة بوتل على إجراء اختبارات الجودة المناسبة.

source: Searching
ar: البحث

source: Pootle provides a searching functionality that allows translators and reviewers to search through translations for some text. The search box is shown close to the top of the page. Searching can be used to find specific things you want to work on, see how issues were solved before, or to verify consistency in your translations.
ar: يوفر بوتل وظيفة بحث تتيح للمترجمين والمراجعين البحث في الترجمات. ستجد مربع البحث في أعلى الصفحة، و يمكن استخدامه للبحث عن أشياء محددة تريد العمل عليها أو لمطالعة كيف حُلَّت بعض المشاكل سابقا أو للتأكد من اتساق الترجمات المختلفة.

source: Search results are up to date, and will reflect the current translations in Pootle.
ar: نتائج البحث دوما حديثة وتعكس الترجمات الحالية الموجودة على بوتل.

source: Localisation projects
ar: مشروعات التوطين

source: In the simplest case, you might be offered a single file to translate, open it in your translation program such as Virtaal, and send it back to the project when you finished the translation and review. Although things are usually more complex than that, this is realistic for some projects, especially when the program is translated into your language for the first time. You can also keep things simple initially by working on projects with a simpler process. In our case studies, you will find a description of the project Tux Paint, which is very simple and an ideal starting point (see page <bf0>61</bf0>).
ar: في أبسط حالات الترجمة فإنّك تُعطى ملفا واحدة لترجمته فتفتحه بأداة ترجمة مثل فِرتال ثم تعيده إلى المطورين بعد تمام ترجمة العبارات الواردة فيه ومراجعتها. لكن عادة ما تكون الأمور أكثر تعقيدا، مع أن بعض المشروعات تعمل بهذه الصيرورة، خاصة عندما تكون المرة الأولى التي تُتَرجم فيها البرمجية إلى لغتك. يمكنك تبسيط الأمور على نفسك بتفادي المشروعات المعقدة في البداية. في فصل دراسات الحالة (صفحة <bf0>57</bf0>) ستجد وصفا لمشروع “رسم تُكس” وهو مشروع بسيط للغاية يصلح للبدء به.

source: In the general case, however, you might need to perform extra steps, or you might need to create your own files to translate following some prescribed steps. In the case where there is an existing translation, you will need to update the translation file to contain all the newest strings to translate, so that it corresponds to the program version you are translating.
ar: في الحالات العامة قد يكون عليك إجراء خطوات إضافية أو قد يتوجب عليك توليد ملفات الترجمة بنفسك متبعا خطوات محددة. في حال وجود ترجمة سابقة سيتعين عليك تحديث ملف الترجمة ليحوي كل المقاطع الجديدة التي تُنتظر ترجمتها، بحيث تتطابق الترجمة مع إصدارة البرمجية التي تترجمها.

source: A lot of projects follow a process similar to this:
ar: تتبع كثير من المشروعات صيرورة مشابهة لما يلي:

source: A translation template is generated from the source code (programming files) containing all the translatable text.
ar: يُوَلّد من الكود المصدري (ملفات البرمجة) قالب ترجمة يحوي كل النصوص التي ستُترجَم.

source: New translations simply start from this template. Existing translations are upgraded to conform to the new template.
ar: تبدأ الترجمات الجديدة بترجمة هذا القالب، وملفات الترجمة القديمة تُحدّث لتطابق القالب الجديد.

source: Translators translate the file, often also performing some review stages.
ar: يُتَرجم الملف، وأحيانا يخضع كذلك للمراجعة.

source: The finalised version is submitted to the project, and will form the start of any future work in this language.
ar: تودّعُ النسخة النهائية في المشروع، وستُبنى عليها في المستقبل أي ترجمات إلى هذه اللغة.

source: Note that you should never need to start translating from scratch if some previous <t0/>translation is available.
ar: لاحظ أنه لا يتوجب عليك أبدا البدء من الصفر في حال وجود أي ترجمات سابقة بل، تبني عليها و تُحسِّنها.

source: To translate an application, you will need to find the files to work on. Hopefully the project has documentation specifically for translators explaining exactly what to do, including how to submit your work to the project. For a project that use a Pootle server, this might be absolutely straight forward. However, even if they don’t, things might be quite predictable.
ar: لترجمة أي برمجية تحتاجُ الملفاتِ التي ستعمل عليها. كثير من المشروعات توثق كيفية الحصول على ملفات الترجمة وإيداعها في المشروع عند إتمامها. هذه الخطوات في الأغلب بسيطة للغاية في المشروعات التي تستخدم بُوتل، لكن حتى المشروعات التي لا تستخدمه غالبا ما تحدد فيها خطوات واضحة.

source: Many projects might simply make a single file per language available for download. Maybe all you need to do is to download the file, translate and test, and e-mail it to a developer. There might be more specific instructions about submitting, such as creating a bug report and attaching your translation.
ar: كثير من المشروعات تستعمل ملفا واحدا لكل لغة وقد يكون كل ما عليك هو تنزيل الملف ثم ترجمته وإرساله إلى المطور، وبعض المشروعات تضع تعليمات محددة لإيداع الملف (مثل فتح بلاغ علة وإرفاق الترجمة به).
