Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: While your writing culture might encourage you to always take a more formal approach than the English software, you might want to vary your level of formality by looking at the source text. The software used for social networking and instant messaging might feel more natural with a little more relaxed tone.
ar: إن كان أسلوب الكتابة في لغتك أميل إلى الرسمي فربما كان من الأفضل التمييز بين درجات مختلفة من الرسمية بمطالعة النص المصدر، فبرمجيات الشبكات الاجتماعية والتراسل الفوري مثلا لا تناسبها الرسمية المفرطة.

source: It is important to always try to convey the correct meaning as intended in the source text. While you might feel you can translate something to sound much better than the original text, you should ensure that you are not changing the intended message of the text. Refer to some of the principles in “<bf0>General principles</bf0>” on page <bf1>19</bf1>. For example, a translation shouldn’t be more specific or more general than the original text. The text might be used in unexpected ways, and a translation too far from the original meaning might be <t2/>inappropriate for some situations.
ar: من المهم للغاية في الترجمة السعي إلى إيصال المعنى المراد في النص المصدر. فأحيانا تظن أن بوسعك صوغ الترجمة بأحسن مما هي عليه في المصدر، لكن عليك قبل فعل هذا التيقن من أنك لست تغير المعنى المراد. مع هذا فالصياغة قد تكون غامضة في المصدر أو أن بنية العبارات و إيجازها يحتمل التأويل. راجع النقاط في قسم “مبادئ أساسية” في صفحة <bf1>19</bf1> ففيها أمثلة على هذا. على سبيل المثال يجب ألا تكون الترجمة أكثر عمومية و لا أكثر تخصيصا من النص المصدر. واعلم أن النصّ قد يُستعمل في سياقات قد لا تتوقعها، فإذا بعدت الترجمة كثيرا عن الأصل فإنها قد لا تلائم بعض تلك السياقات.

source: <f0>Earlier we encouraged both </f0><f1>being careful</f1><f2> and </f2><f3>being bold</f3><f4>. This section might similarly seem to contradict the previous section by encouraging conformance to the target language where the previous section encouraged conformance to the original text. These are both important goals, and won’t usually conflict with each other. We want to translate so that the result is both well written in </f4><f5>the target language, and conveys the same message as the source text.</f5>
ar: شجعناك سابقا على أن تكون <f1>حريصا</f1> و <f3>جريئا</f3>، وقد يبدو هذا القسم أيضا متناقضا مع السابق إذ يشجعك على الالتزام بمتطلبات اللغة الوجهة عوضا عن الالتزام بالأصل. لكن في الحقيقة كلا الهدفين مهمين ولا يتعارضان في الأغلب؛ فالمطلوب أن تُخرج الترجمة نصا سليما يتبع الأساليب اللغوية للغة المترجم إليها وفي الوقت ذاته يوصل المعنى المقصود في النص المَصدَر.

source: Your translation should always be true to the style of your language. Don’t fall into the trap of using the word order of the English text if it isn’t the most natural way to say it in your language. Don’t translate expressions literally. Change cultural references where it makes sense. Be aware of taboo words or words with unintended meanings that might distract the user from the message.
ar: يجب أن تلتزم الترجمة بالأساليب والتراكيب اللغوية الصحيحة في لغتك؛ فلا تقع في خطأ اتباع نفس ترتيب الكلمات في الجملة الإنگليزية إذا لم يكن الأنسب في لغتك، ولا تترجم التعبيرات حرفيا فبعض التعبيرات نتاج لثقافة معينة ليست موجودة في اللغة المنقول إليها. واحذر من الكلمات غير اللائقة في لغتك أو التي تحمل معاني غير مقصودة تبعد المستخدم عن الرسالة المطلوب إيصالها.

source: The developer documentation of a project might discourage the use of the passive voice. This might only apply to English. Unless this is specifically meant to apply to translations, feel free to ignore this advice if the passive voice is a good style to use in your language.
ar: في بعض المشروعات تُنفِّرُ وثائق المطورين من صيغة البناء للمجهول، لكن قد يكون النص الإنگليزي فقط هو المعني بهذا، لذا لا تترد في تجاهل مثل هذا التوجيه إذا كان المبني للمجهول هو الأنسب في لغتك، إلا إذا كانت تلك التوجيهات مقصودة بها الترجمة أيضا.

source: Terminology
ar: المصطلحات

source: Terms are words or short phrases with specific meaning. If we want to do good translation, we are obviously interested in terms and their translations. We can consider short phrases under terminology work, partly because they are often defined in similar ways, and we can usually handle them in dictionaries and translation tools in the same way. They also provide an opportunity to capture some aspects of style.
ar: المُصطَلَحُ كلمة أو عبارة قصيرة لها معنى محدد مُتَّفقٌ عليه، والترجمة الجيدة تتطلب العناية بالمصطلحات وترجماتها. ويمكن إدراج العبارات القصيرة مع المصطلحات إذ كثيرا ما تكون لها معان محددة مثل المصطلحات ويمكن إضافتها للمعاجم ومعاملتها في أدوات الترجمة على النحو ذاته كالمصطلحات. كما يمكن استعمالها لتوضيح بعض جوانب مسألة الأسلوب.

source: As you can see, a term can consist of one or several words. They can be nouns, verbs, or any other type of word, or even a short phrase that we might find in translation work.
ar: كما ترى قد يتألف المصطلح من كلمة أو أكثر، كما يمكن أن يكون اسما أو فعلا أو حتى عبارة قصيرة تتكرر في الترجمة.

source: Developing terminology is an important and ongoing task while translating software. Of course, this is also true of most aspects of translation style. Using good, consistent terminology and style will help users to be comfortable with the software, and will give them pride in using translated software rather than being ashamed of bad quality. Bad translations can also damage the image of the software.
ar: تطوير المصطلحات من المهام الأساسية المستمرة أثناء الترجمة، فحسن اختيار المصطلحات والاتساق في استعمالها يساعد المستخدمين على التكيف مع البرمجيات المترجمة والفخر باستخدامها بدلا من الخجل منها ومن سوء مستواها. كما تحط الترجمة السيئة من قدر البرمجية في نظر المستخدم.

source: New terms are constantly used in software that will need to be translated. Terminology creation will therefore never finish while you translate software. However, if you have good translations for common terms, it will help all your team members to translate more productively, and will of course help with the consistency. You don’t need a dictionary with thousands of terms before you can do useful localisation work.
ar: تظهر دوما مصطلحات جديدة البرمجيات تتطلب صوغ مقابلات لها، لهذا فمهمة وضع المصطلحات مستمرة باستمرار ترجمة البرمجيات. مع هذا فمُراكمة مسردٍ لترجمات المصطلحات الشائعة يساعد كل أعضاء الفريق على الترجمة أسرع، وسيساعد على اتساق الترجمات مع بعضها. و لاحظ أنك لست بحاجة لمعجم يحوي آلاف المصطلحات قبل الشروع في الترجمة.

source: Translation with lots of difficult terms can be frustrating for new translators, and they might make lots of errors if they are not familiar with the computer terms. Therefore it is important for the motivation of especially new team members to have some existing terms specified, so that they have some help from the start. A good terminology list is a big help in a Translat@thon for motivation and quality.
ar: تُثَبِّطُ الترجمات التي تحوي كثيرا من المصطلحات الصعبة المترجمينَ الجدد وقد يقعون في أخطاء كثيرة إذا لم تكن لهم خبرة بمصطلحات الحاسوب، لذا من المهم للغاية وجود مسرد للمصطلحات لمساعدة أعضاء الفريق وخاصة الجدد منهم وتحفيزهم على المواصلة. كما يساعد المسرد الجيد كثيرا في جودة الترجمة وتحفيز المترجمين في ماراثونات الترجمة.

source: Another reason why good terminology is important, is to ensure that it is actually correct. Some terms are hard to understand, and might be very specific to the software involved. If a translator misunderstands some English term, it can badly affect quality. You will get a lot of benefit if you continually work on terminology as a separate part of your project. Good terminology can ensure that the translated version of the program isn’t misleading the users, or giving the wrong impression. Remember that you don’t just want any translation, and in cases where a term should be translated in two different ways depending on the context, you want to capture that as part of your terminology development.
ar: أحد فوائد مراكمة مسرد مصطلحات جيد أنه يضمن دقة ترجمة المصطلحات، فبعض المصطلحات صعبة الفهم وأحيانا تكون لها معان خاصة في سياق البرمجية موضوع الترجمة، وإذا أخطأ المترجم المعنى المقصود تدَنَّت جودة الترجمة. ولهذا ستستفيد كثيرا من إفراد مساحة مستقلة في مشروعك للعمل على مسرد المصطلحات. المصطلحات الجيدة تضمن أن تحمل الترجمة المعنى الصحيح وألا تُربك المستخدم. تذكَّر أنك لا تريد أي ترجمة و كفى، وفي حال كان للمصطلح أكثر من مقابل حسب السياق فمن المهم أن يشتمل مسرد المصطلحات هذه المعلومة.

source: <f0>Short phrases might give the opportunity to unify some stylistic aspects of a translation, such as how requests to a user is made (as we see in the examples above, “</f0>Are you sure you want<f1>”).</f1>
ar: قد تكون العبارات القصيرة فرصة لتوحيد بعض الجوانب الأسلوبية في الترجمة، مثل كيفية صوغ الطلبات الموجهة إلى المستخدِم، (كما في الأمثلة أعلاه ”Are you sure you want“).

source: <f0>In this example sentence, there are some possibilities for making terminology mistakes. Maybe the translation of “secure” isn’t standardised, or the translation of “network connection” is not obvious. The sentence starts with a phrase “</f0>Are you sure you want to ...<f1>” which can probably be translated in different ways, but inconsistent translations might give a bad impression of the software.</f1>
ar: في هذا المثال عدة مواضع تحتمل الخطأ، كألّا تكون لكلمة “secure” ترجمة متفق عليها، أو لا تكون ترجمة “network connection” بديهية كفاية. تبدأ الجملة كذلك بعبارة “Are you sure you want to ...” والتي تمكن ترجمتها بأكثر من أسلوب، لكن عدم الاتفاق على ترجمة موحدة لها قد يعطي انطباعا سيئا عن البرمجية.

source: Let’s indicate which terms might be recognised from our terminology list by underlining them:
ar: الكلمات الموضحة بسطر تحتها قد تصلح لإضافتها إلى مسرد المصطلحات لتسهيل و توحيد ترجمتها:

source: As you can see, it will be quick and easy to translate this with all of these terms available to use. The translation should be consistent with other translations as well as the prescribed terminology and style, and the translator will also be much more productive if the translation tool makes it easy to insert these terms without actually having to type them. Of course this example is artificial, but you can expect real benefits from even a small list with a few hundred relevant terms.
ar: يظهر لنا أن وجود مسرد يحوي ترجمة كل من هذه المصطلحات يُيسر ترجمة النصّ السابق، كما ستأتي الترجمة متسقة مع الترجمات الأخرى ومع أسلوب الترجمة المتفق عليه، كما ستزيد إنتاجية المترجم إن كان يستخدم أداة ترجمة تسهل إدراج المصطلحات دون حاجة لكتابتها يدويا. ومع أن هذا المثال مُختلق إلا أنه يوضح الفوائد التي قد تجنيها حتى من مسرد لا يحوي إلا بضع مئات من المصطلحات.

source: If you are motivated to translate software, it might feel very demotivating to think about doing a lot of terminology work. You want to translate software, not write a dictionary, right? (Of course, writing a dictionary is also very useful.) In the previous section we explained why good terminology is useful and important, but obviously you want to prioritise your work to the most frequently used terms, especially at the start of your work.
ar: قد يبدو أمر المصطلحات هذا مملا فأنت تريد ترجمة البرمجيات وليس تأليف المعاجم، أليس كذلك؟ (طبعا تأليف معجم أمر مفيد للغاية في حد ذاته). أوضحنا في القسم السابق أهمية وفائدة مسرد المصطلحات، لكن عليك بالطبع إبداء أولوية للمصطلحات الشائعة خاصة في بداية عملك.

source: You may only want to work on a smaller list of terms initially. Therefore it will be useful to know you are working on the most important ones. You might know of some common terms that should perhaps be in your list, but trying to create the list of terms by yourself is not a good use of your time. It is also more useful to work on terms actually occurring in your translation work, rather than some terms that might be useful, but aren’t needed for your current work. A good way to tackle this problem is to use a terminology extraction program, such as <f0>poterminology</f0> from the Translate Toolkit (see page <bf1>9</bf1>). The same feature is also available in Pootle (see page <bf2>42</bf2>). Such software analyses the text for frequently occurring terms and produces a list for you to translate. Some of the suggested terms might not be important or meaningful to work on, but see the list of terms as a suggestion to save you time.
ar: قد يكون من الأفضل البدء بقائمة صغيرة من المصطلحات، لذا من المهم البدء بالمصطلحات الأكثر شيوعا. قد تعرف بعض المصطلحات الشائعة التي تستحق وضعها في القائمة لكن محاولة بناء قائمة المصطلحات بنفسك مضيعة للوقت، من المهم كذلك اختيار مصطلحات موجودة فعلا في الترجمة التي تعمل عليها بدلا من العمل على مصطلحات قد تكون مفيدة لكنك لا تحتاجها في الوقت الحالي. من الحلول المناسبة لهذه المهمة استخدام أداة استخراج مصطلحات مثل <f0>poterminology</f0> من عُدّة الترجمة (انظر صفحة <bf1>12</bf1>)، كما يحتوي بوتل على نفس الوظيفة (انظر صفحة <bf2>42</bf2>). تعمل هذه الأدوات على تحليل النص لاستخراج قائمة المصطلحات المتكررة منه، قد لا تكون كل المصطلحات في القائمة الناتجة مهمة أو ذات دلالة تبرر تضمينها في المسرد لكن يمكن عدُّ هذه القائمة اقتراحات مبدئية توفر الوقت.

source: One disadvantage of a terminology extraction program, is that it probably has no knowledge of which terms are most used in the very visible parts of the software. For example, you might get some terms used very frequently in error messages. Of course these are very useful to standardise if you will be translating the error messages, and has all the advantages it offers to the team in terms of productivity and motivation. Do what you think is most useful with the time you have available.
ar: يعيب أدوات استخراج المصطلحات أنها في الأغلب لا تعرف أي المصطلحات يكثر ورودها في أكثر أجزاء البرمجية ظهورا للمستخدم. فقد تحصل -مثلا- على مصطلحات تشيع في رسائل الأعطال، وهذه بالطبع مفيدة للغاية إن كنت ستترجم رسائل الأعطال، و تفيد الفريق من ناحية الإنتاجية و التحفيز. عليك فعل ما يحقق أفضل استغلال للوقت المتاح لك.

source: There might be many resources available to help you with your terminology work. Remember that you probably want to use an existing, known term rather than creating something new. Therefore it is a good idea to always look at existing sources of terminology, even if just for inspiration. Even looking at terms in languages related to yours could be helpful.
ar: توجد مصادر تساعد في العمل على المصطلحات. تذكر أنه من الأفضل استعمال المصطلحات الراسخة مادامت جيدة بدلا من وضع مصطلحات جديدة إلا عند الضرورة، أو لتصويب اختيارات سابقة خاطئة، أو لفض اشتباكات دلالية. لذا من المستحسن مراجعة المصادر المتاحة حتى وإن يكن لمجرد استلهام الأفكار. أحيانا قد يفيد الاطلاع على المصطلحات المستعملة في اللغات القريبة من لغتك، أو حتى في لغات أخرى غريبة عنها عوضا عن الاكتفاء باللغة المصدر التي هي غالبا الإنگليزية، لأن هذا يعرِّفك على أنماط تفكير مختلفة و مقاربات مختلفة لمسألة وضع المصطلحات.

source: Here are some places that might be useful:
ar: هذه بعض المصادر التي قد تفيدك:

source: The website Open-Tran.eu collects many translations from FOSS projects, and provides a way of searching these translations. Although this can never be an authoritative resource for terminology, you will be able to get a good idea of which terms might already be in use in FOSS projects. If your language does not yet have a lot of useful suggestions in Open-Tran.eu, keep in mind that the latest translations from several projects are imported from time to time, and if you are creating new translations, you will help to make this service more useful over time.
ar: يجمع موقع Open-Tran.eu ترجمات مشروعات البرمجيات الحرة ويتيح البحث فيها. ورغم أنه لا يمكن اعتباره مرجعا لترجمة المصطلحات إلا أنه يعطي صورة عامة عن ترجمات المصطلحات التي تستعملها البرمجيات الحرة. إذا لم يحتو Open-Tran.eu على كثير من الاقتراحات بلغتك فربما لقلّة الترجمات المتوفرة لها، الترجمات الجديدة من عدة مشروعات تضاف إلى الموقع مع الوقت وترجماتك أنت تساعد في زيادة فائدة هذه الخدمة.

source: The results from Open-Tran.eu indicate from which project a suggestion originates. Keep in mind that you might want to align your current style and terminology with similar projects. For example, if your current translation is part of the GNOME project, you might want to pay particular attention to the suggestions coming from the GNOME project.
ar: يعرض Open-Tran.eu إلى جانب كل اقتراح المشروع الذي جاء منه، وهذا يساعد على توحيد المصطلحات مع المشروعات الشبيهة. فإن كنت تترجم أحد مشروعات گنوم مثلا فسيفيدك الانتباه إلى الاقتراحات الآتية من مشروعات گنوم الأخرى.

source: Microsoft language portal
ar: موقع جماعة عُيون العرب (عربايز)

source: The Microsoft language portal contains style guides, terminology lists, and existing translations for many languages, and this might be very useful. If the software you are translating will be running on Microsoft Windows, be aware of the terminology used in the Microsoft products. Users might be more used to them.
ar: عيون العرب جماعة من المعنيين بتوطين البرمجيات من أرجاء العالم العربي، يُنسِّقون فيما بينهم توطينَ مشروعات برمجيات حرة عديدة، كما ينخرط بعضهم في مشروعات مختلفة معنية بتقنيات اللغة العربية و تشغلهم مسألة الكتابة التقنية بالعربية، و يتواصلون بقوائم بريدية. في الموقع مُعجم تقني تجري مُراكمته جماعيا هو مصدر جيّد لترجمات المصطلحات، مفتوح لكل من يهمه الأمر و يُرَّحب فيه باقتراحات التعريبات و بالتعليقات، كما يضم الموقع مصادر عديدة و إرشادات و أدلّة أسلوبية و مفاهيمية تهم المُوَطِّنين، و مجتمعا يُرحّب بالقادمين الجدد.

source: http://www.microsoft.com/language/
ar: http://wiki.arabeyes.org/القاموس_التقني

source: Wikipedia
ar: ويكيبيديا

source: Wikipedia is an online encyclopaedia. Although it is not primarily intended as a terminology resource, it covers a very wide range of topics in many languages, and you might be able to see how a term is already translated by another translator at Wikipedia. Of course an article at Wikipedia, even if it is not in your language, might help you to properly understand a concept, which in turn will help to properly define and translate it into your language.
ar: ويكيبيديا موسوعة تشاركية على الإنترنت، و هي إن كانت لا تختص بترجمة المصطلحات إلا أنها تتناول طيفا واسعا من الموضوعات التقنية بلغات عدة و تربط ما بين تلك الموضوعات عبر اللغات مما يُمكّن من البحث فيها عن مصطلح لترى كيف تُرجم في ويكيبيديا إلى لغات أخرى، كما قد تفيدُ مقالات ويكيبيديا في استيعاب المفهوم الذي يدل عليه المصطلح، حتى إن لم تكن تلك المقالات مترجمة إلى لغتك، وهذا يساعد كثيرا في صوغ ترجمة مناسبة للمصطلح.

source: Technical correctness
ar: الدِّقة تقنيا

source: Terms must convey the correct meaning. Watch out for a translation that is more general than the original term, or only refers to part of the original concept. Keep in mind that there might be similar but distinct terms used in the source language that might need to <t0/>be translated differently, whereas your first guess at a translation might lead you to translating them all in the same way. For example, you might want to make sure your translated terms reflect the differences between “photo”, “drawing”, and “diagram”. Think how the terms “file”, “directory”, and “document” are different and how to properly translate these terms.
ar: يجب أن يَدُلَّ المصطلحُ على المعنى الصحيح، فلا يحمل دلالة أعَمَّ مما للمصطلح الأصلي و لا دلالة أخَصَّ تتناول جانبًا من المفهوم و حسب. كذلك تنبغي مراعاة وجود مصطلحات متقاربة لكنها متباينة يجب تمييزها عن بعضها وإلا قد ينتهي الأمر إلى ترجمتها جميعا بنفس الكلمة. مثلا مصطلحات مثل “photo” و “image” و “picture” قد ينبغي التمييز بينها في الترجمة، أو التفرقة بين “file” و “directory” و “document”.

source: On the other hand, the source text might unnecessarily have two terms for the same concept. If you are sure that the two concepts are the same, you might want to translate them with the same term. Only do this if you are sure it is safe to do.
ar: لكن أحيانا ما ترِدُ في النص الأصلي مصطلحات مختلفة للدلالة على مفهوم واحد، فإذا كنت متأكدا من عدم اختلاف المعنى فيمكنك استعمال ترجمة واحدة للدلالة على هذا المفهوم. لكن عليك التأكد أن هذا التوحيد لا يسبب أية لبس أو غموض.

source: On the other hand, a term might have more than one meaning. Ensure that you translate the correct meaning of the term. Some words in English are both nouns and verbs. The term “list” can be a noun (a grouping of things) or a verb (the action of putting things in a list). Ensure that you translate the correct meaning, or that you add both forms to your terminology list.
ar: في أحيان أخرى يكون للمصطلح ذاته في اللغة المصدر دلالات عدة، و عندها عليك التأكد أن الترجمة تستعمل المصطلح الصحيح في لغتك للدلالة على المفهوم المقصود، فإذا لم تكن للمصطلح ترجمة واحدة تحمل كل معانيه فعليك وضع ترجمة مختلفة لكل معنى واستعمال الترجمة الصحيحة حسب السياق. بعض الكلمات الإنگليزية يمكن أن تكون اسما أو فعلا، مثل كلمة “list” قد تكون اسما بمعنى “قائمة” أو فعلا “اسرد”، وعليك الانتباه إلى المعنى المقصود.

source: Always ensure that you really understand the source concept correctly. Use dictionaries and read up on the web to ensure that you know the exact meaning of a term before trying to translate it. Also check your target terms to ensure that you are not using them incorrectly, or maybe conveying an unintended meaning associated with the term. <f0>Ensure the correct spelling and orthography of your term.</f0>
ar: عليك دوما التأكد من فهم المعنى العام للنص الأصلي، باللجوء إلى المعاجم ومطالعة الموضوع المعني في الوِب حتى تفهم معنى المصطلح وما يرمي إليه. عليك كذلك التأكد أن المقابل الذي تستعمله يوصل المعنى المقصود وأنك تستعمله في سياقه الصحيح فقد يكون له دلالات أخرى لا تقصدها. راعِ كذلك قواعد الإملاء، و اسْعَ إلى تقليل اللَّبس عند القراءة بقدر الإمكان حتى لو تطلب ذلك وقتا إضافيا في الصياغة و التشكيل و مراجعة الإملاء.

source: Concept recognisability
ar: وضوح المفاهيم

source: Remember that you want ordinary users to understand the terms that you use. It might sound impossible to coin technical terms that ordinary users will understand, but keep in mind that terms are often built from plain words, and that users get used to all sorts of terms that might have been strange a few years ago (also in English).
ar: تذكَّر أن الهدف هو أن يفهم الناس العاديون المصطلحات التي تستعملها. قد يبدو صوغ مصطلحات تقنية يفهمها عامة الناس مستحيلا، لكن ثِق في قدرة الناس على فهم مفردات لغتهم و تذكّر أن المصطلحات هي في واقعها مفردات من اللغة، و هذا حقٌّ في العربية أكثر من لغات أخرى، فبها تزيد قدرة القارئ على استنتاج دلالات مصطلحات لم يرها من قبل، أكثر من الإنگليزية مثلا. الناس تعتاد المصطلحات الجديدة مع الوقت وكثير من الكلمات المعتادة اليوم، خاصة في مجال المعلوماتية، كانت غريبة قبل بضع سنوات، حتى في الإنگليزية، و على مَن هي لغتهم الأم.

source: Existing terms from engineering, mathematics or office administration might help you to create a term that is much more recognisable than something entirely new.
ar: المصطلحات القائمة المتداولة في مجالات العلوم و الهندسة والرياضيات والإدارة ليست غريبة عن الحوسبة و المعلوماتية، و عموما ينبغي استعمالها عند ملاءمتها فهي أقرب للفهم، بدلا من صوغ مصطلحات لم تستعمل من قبل، كما يجب استعمالها عندما يكون موضوع البرمجية مرتبطا بأحد تلك المجالات.

source: Back-translatability
ar: رَدُّ المصطلح إلى أصله

source: Ideally you want to use terms that users will be able to “translate back” to the original term. This is particularly useful in cases where users would already be used to the English terms. An added benefit of being able to translate terms back, is that users can guess more easily for which terms to look for on the web or in untranslated product documentation.
ar: أحيانا يكون من المفيد كون المصطلح في الترجمة واضحا كفاية بحيث يستطيع المستخدم استنباط المصطلح الأصلي منه، خاصة عندما يكون المستخدمين معتادين على المصطلحات الإنگليزية، أو عندما يحتاج المستخدم معرفة المصطلح باللغة الإنگليزية ليبحث عنه في الوب أو في وثائق غير مترجمة للبرمجية.
