Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: Software is distributed under certain conditions which determines what you are allowed to do with the software. These conditions form the licence which is often shown when installing software, or maybe in a file in the source code of the software. Of course Free and Open Source Software is distributed under very attractive licences allowing us to do many things with it, including localisation. <f0>There are a few issues that deal with licencing and copyright that might be relevant to localisers.</f0>
ar: تُوَزَّعُ البرمجيات بشروط معينة تحدد ما المسموح لك به فيما يخص كل برمجية. تؤلِّف هذه البنود الرخصة التي عادة ما تُعرَض عليك أثناء تنصيب البرمجيات، أو ربما توضع في ملف ضمن الكود المَصدَريّ. توزع البرمجيات الحرة مفتوحة المصدر بِرُخصَ جذابة للغاية تتيح للمستخدم فعل الكثير بها، بما في ذلك توطين تلك البرمجيات. توجد بعض مسائل الرُّخص وحقوق النشر تهم المترجمين.

source: Firstly, you have to understand that your contributions to the project will be distributed under the terms of the licence used for the rest of the software. You might want to familiarise yourself with these terms to ensure that you know what other people are allowed to do with your translation. For example, most FOSS licences allow people to sell copies of the software, and it is best if you are not surprised when you see this for the first time!
ar: أولا، اعلم أن مساهماتك في المشروع ستوزع بالرخصة ذاتها التي توزع بها باقي البرمجية. من المستحسن أن تطّلع على بنود هذه الرخص لتعرف ما الذي يتاح للآخرين فعله بترجمتك، فمثلا أغلب رخص البرمجيات الحرة تسمح ببيع نسخ من البرمجية، لذا من الأفضل ألا تتفاجأ بشيء كهذا.

source: To contribute to some projects, they might require you to sign a <f0>copyright assignment form</f0>. The project might do this for different reasons such as wanting to know your real identity, enabling them to relicense the software at another stage, or to be able to act on your behalf in legal disputes. While this is not very common, it can be encountered in some projects.
ar: بعض المشروعات تشترط لقبول المساهمات توقيعَ المساهم على <f0>استمارة نقلٍ لحقوق النشر</f0>. تختلف الدوافع وراء هذا، فقد تكون لإثبات هويتك الحقيقية أو لإعطائهم الحق في تغيير الرخصة المنشورة بها البرمجية لاحقا، أو لإعطائهم سندا قانونيا لتمثيلك أمام المحاكم حال وقوع نزاع مع آخرين بشأن البرمجية. وهو أمر غير شائع لكنك قد تقابله في بعض المشروعات.

source: In some cases, you might not have the rights to distribute your own translated version while maintaining the original branding (like the name and logos) of the software. Enquire if the project has any requirements with regards to branding.
ar: في بعض الأحيان لا يُسمح لك بتوزيع نسخة من البرمجية ترجمتها بنفسك خارج إطار المشروع بذات العلامات التجارية (مثل الاسم والشعار) للمشروع الأصلي. استفسر عن أية اشتراطات تخص العلامة التجارية للتيقن.

source: Keep in mind that projects are free to reuse your translation according to the terms of the licence, and that you can’t retract the rights you gave to the project when you submitted the translation. It is even possible that the project could appoint someone else for translation in your language who will change some of your work without your permission. Although very rare, this might be required to keep the project alive. This should almost never impact your work.
ar: ضع في اعتبارك أن للمشروعات الحرية في استعمال ترجمتك وفقما تحدده الرخصة وأنك لا تستطيع سحب الحقوق التي منحتها للمشروع بإيداعك للترجمة. بل قد يُسنِد المشروعُ مهمة الترجمة إلى شخص غيرك فيغير بعضا من الترجمة دون إذن منك، بالرغم من ندرة حدوث هذا إلا أنه يكون مطلوبا أحيانا للحفاظ على استمرارية المشروع، وينبغي ألا يؤثر هذا على عملك.

source: For more reading, see Free/Open Source Software Licensing by Shun-ling Chen.
ar: لمزيد من المطالعة طالع “ترخيص البرمجيات الحرة\مفتوحة المصدر” من تأليف Shun-ling Chen.

source: Wider involvement
ar: مشاركة أوسع

source: An interesting aspect of FOSS projects is that contributions are usually welcome in all activities of the project. Translation, documentation, testing, marketing, programming, design – these are all useful ways of contributing to a project. You might only be interested in translation, but you might find that your involvement in many other activities can be very useful; not only for the project, but also for your localisation work.
ar: من الجوانب الرائعة في مشروعات البرمجيات الحرة ترحيبها بالمساهمات في كل الأنشطة المتعلقة بالمشروع سواء الترجمة أو التوثيق أو الاختبار أو التسويق أو البرمجة أو التصميم؛ كلها مساهمات مفيدة. قد تكون مهتما بالتوطين فقط لكنك قد تكتشف أن المشاركة في جوانب أخرى مفيدة، ليس للمشروع فحسب بل أيضا لعملك على التوطين.

source: Reviewing English text<f0> is very important for English users, but also to ensure that translators are working from clear source text. If your English is not very good, you might still be able to point out which things are hard or impossible to translate, thereby helping to improve the source text for your own translation work. As a translator you are probably one of the people who read the English text with the most attention, thereby making yourself a good proof reader of the English text. You can usually report errors with the source text in the bug tracker for the project.</f0>
ar: <f0>مراجعة النص الإنگليزي</f0> تفيد مستخدمي الواجهة الإنگليزية وفي الوقت ذاته تعين المترجمين في عملهم. إذا لم تكن تتقن الإنگليزية فإن قيامك بالتنويه عن المواضع في النص التي تصعب ترجمتها أو تستحيل يفيد في تحسين النص المَصدَر وهو ما يعود بالتحسين على عملك في الترجمة. فالمترجم من القلائل الذين يقرؤون النصَّ المَصدَر في الإنجليزية بتمعن بالغ مما يجعله مراجعا جيدا. تستطيع في الأغلب الإبلاغ عن الأخطاء في النص المصدر باستخدام مقتفي علّات المشروع.

source: Testing the software<f0> with the translated interface is an important part of your localisation work. Testing is discussed later on page </f0><f1><bf2>53</bf2></f1><f3>. A valuable side-effect of this is </f3><t4/><f5>that you can make a useful contribution to testing the software itself in preparation for a release. You are also the best person to test compatibility with anything related to your language or country, such as handling of text in your language, compatibility with local websites, font support, etc.</f5>
ar: <f0>اختبار البرمجيات</f0> في واجهتها المترجمة خطوة مهمة في عملك على توطينها. نتناول موضوع الاختبار لاحقا في صفحة <bf2>51</bf2>. من الفوائد الثانوية لهذا إمكان مساهمتك في اختبار البرمجية ذاتها قُبيل الإصدار، كما أنك أفضل من يختبر التوافقية مع أي من الأمور المتعلقة بلغتك أو بلدك مثل التعامل مع النصوص المكتوبة بلغتك أو التوافق مع مواقع الوِب أو المحلية أو دعم الخطوط إلخ.

source: Designing the software<f0> for a diverse user group all over the world isn’t always easy, and this is another way where you can help the project to ensure that the designs take your language and culture into account. It could be as simple as asking for more space for a string with a very long translation in your language. It could also include more far reaching design decisions such as features that are required for your language that the developers might not have been aware of.</f0>
ar: <f0>تصميم البرمجيات</f0> لتناسب مجموعات متباينة من المستخدمين حول العالم ليست مهمة سهلة وهذا أحد الجوانب التي تستطيع مساعدة المشروع بها للتأكد من أن التصميمات تناسب لغتك وثقافتك. قد تكون مجرد أمور بسيطة مثل طلب مساحة أكبر لمقطع طويل في الترجمة، وقد تكون أمورا أعمق في التصميم مثل إضافة خصائص تحتاجها لغتك لم ينتبه لها المطورون.

source: Marketing the software<f0> all over the world sounds like a lot of work for a small group of volunteers, except if a project has contributors in many countries. You can become an ambassador for the project in your country or geographical area, and even in this case, it could often involve translation. Marketing material, websites, brochures, etc. might be available for translation, and the project might depend on you to ensure their success in the place where you live.</f0>
ar: <f0>تسويق البرمجيات</f0> عبر العالم قد يكون مجهودا كبيرا على مجموعة صغيرة من المتطوعين إلا إذا كان مساهمو المشروع من بلدان كثيرة. يمكنك أن نكون سفيرا للمشروع في بلدك أو في إقليمك وقد تكون الترجمة جزءا من هذا أيضا؛ مثل ترجمة المواد التسويقية ومواقع الوِب والمطويات الترويجية وغيرها، وقد يعتمد المشروع عليك للنجاح في المنطقة التي تعيش فيها.

source: Involvement in events<f0> is not a frequent activity for many contributors to FOSS projects, but you might get an opportunity to represent a project you are very familiar with at a local event. This is a great way to promote the software, and maybe to gain more contributors for your localisation work.</f0>
ar: <f0>المشاركة في الفعاليات الاجتماعية</f0> ليست من الأنشطة المعتادة لكثيرين من المساهمين في مشروعات البرمجيات الحرة، لكن قد تكون أمامك فرصة لتمثيل مشروع تعرف الكثير عنه فعالية محلية، وهذه طريقة رائعة للترويج للمشروع وربما دعوة مساهمين جدد لمساعدتك في التوطين.

source: Beyond mere translation
ar: ما بعد الترجمة

source: In earlier sections several important issues in FOSS localisation is discussed. With some time and practice, these should all become easy and natural for you to do. You can improve your localisation work even more with some of the topics discussed in this section. This should help you to spend your time more effectively, and work at higher quality.
ar: تناولنا في الأقسام السابقة بعض الجوانب المهمة في توطين البرمجيات الحرة، ومع الوقت وبالممارسة ستصبح الأمور أسهل وستعتادها. الأمور التي نتناولها في هذا القسم يمكن أن تحسن عملك أكثر وأكثر، وستساعدك في تنظيم وقتك على نحو أفضل.

source: Testing your localisation is very important. It is natural to make mistakes, but too many mistakes in your localisation will leave a bad impression with the users, and put them at a disadvantage for using the localised version of the software. This section explains some different ways of testing.
ar: اختبار الترجمة أمر في غاية الأهمية، حدوث الأخطاء أمر طبيعي لكن كثرة الأخطاء في الترجمة تعطي المستخدمين انطباعا سيئا وتحرمهم من الاستفادة من البرمجيات المترجمة. يشرح هذا القسم بعضا من أساليب الاختبار.

source: Automated review
ar: المراجعة الآلية

source: For the purposes of this book, automated testing refers to using software to automatically review our translations. Since software is really good at simple repetitive tasks, it is ideal to help us discover things like spelling mistakes, errors in capitalisation, unwanted spaces, as well as mistakes with variables and markup. Several of the issues we discussed in “<bf0>Technical issues</bf0>” on page <bf1>27</bf1> might be detected by automated review tools.
ar: يُقصد بالمراجعة الآلية في هذا الكتاب استخدام البرمجيات لأتمتة مراجعة الترجمات. قدرة البرمجيات على إتقان المهام البسيطة المتكررة تؤهلها لاكتشاف الأخطاء الإملائية والمسافات الزائدة بالإضافة إلى أخطاء المُتَغيِّرات والرَّقْم. كثير من الأمور التي ناقشنها في قسم “<bf0>مسائل تقنية</bf0>” صفحة <bf1>27</bf1> يمكن أن تكتشفها أدوات المراجعة الآلية.

source: Pootle and Virtaal incorporates several quality checks that will help you to find certain types of errors. Some of these are only of a cosmetic nature (such as spaces and punctuation). Others are a bit more serious (such as a missing web address or suspiciously short translation). Some tests might indicate serious issues that could crash the software or prevent some functionality from working (such as errors with variables).
ar: يحتوي كلا من بُوتِل وفِرتال على عديد من فحوص الجودة التي تساعد في اكتشاف أنواع معينة من الأخطاء، بعضها متعلق بالتنسيق (مثل المسافات وعلامات الترقيم) وبعضها أخطر (مثل نسيان مسار وِب أو ترجمةٍ أقصرَ من اللازم) وبعض الفحوص قد تشير إلى أخطاء فادحة قد تؤدي إلى انهيار البرمجية المترجمة أو تعطيل وظائفها (مثل أخطاء المتغيرات).

source: Read more about all these quality checks here:
ar: طالع المزيد عن فحوص الجودة هنا:

source: It is important to realise that these tests could suggest that some translations contain mistakes when they are indeed valid. Don’t follow the advice of these tests blindly, and don’t let their results encourage you to do something incorrect or unusual for your language. The tests are just tools intended to help you. We have found them of crucial importance in our work, especially with inexperienced translators, although even the most experienced translators sometimes make mistakes.
ar: من المهم إدراك أن بعض هذه الاختبارات قد تنوِّه عما تحسبه أخطاء في حين أنها قد لا تكون أخطاء فعلية، لذا لا تتبع توصيات هذه الفحوص بلا تدقيق ولا تجعل نتائجها تدفعك إلى تعديل الترجمة على نحو لا يناسب لغتك لمجرد إخماد الإنذار، فليست هذه الفحوص إلا أدوات لتعينك، و أنت أدرى بلغنك، وقد وجدنا هذه الفحوص مهمة للغاية في عملنا خاصة للمترجمين الجدد، مع أن حتى أكثر المترجمين خبرة يقعون في الأخطاء.

source: Automated testing is cheap in the sense that it doesn’t require much of your time. It quickly shows you where to spend your time to fix a possible problem. Always review the quality checks – it is an easy way to avoid certain errors.
ar: الفحوص الآلية لا تستغرق طويلا من وقتك، و هي تبين لك الأجزاء التي تتطلب عناية أكثر لعلاج مشكلة محتملة. لذا راجع دوما نتائج فحوص الجودة فقد تجنبك أخطاء.

source: Software written using the Gettext translation system usually use a program called <f0>msgfmt</f0><f1> to convert the translation file into the file needed by the software. It also does some basic checks, such as checking the file format, invalid use of variables, etc. Any serious error reported by this tool </f1><f2>must</f2><f3> be fixed. Usually the translation will not be used if there are any errors reported by msgfmt. Software written using the Qt translation system, has a similar program called </f3><f4>lrelease</f4><f5>.</f5>
ar: البرمجيات التي تترجم بنظام جتتكست تستخدم عادة أداة اسمها <f0>msgfmt</f0> لتحويل ملف الترجمة إلى الملف التي يمكن للبرمجية استخدامه، كما تجري هذه الأداة بعض الفحوص (مثل فحص تنسيق الملف و الاستعمال الخاطئ للمتغيرات) و غيرها،و الأخطاء التي تكتشفها هذه الأداة <f2>يجب</f2> تصويبها فغالبا لن تُستعمل الترجمة إن وَجَدَت msgfmt فيها أخطاء. البرمجيات التي تعتمد على نظام Qt للترجمة تستخدم أداة أخرى اسمها <f4>lrelease</f4>.

source: Manual review
ar: المراجعة اليدوية

source: Although automated review tools can help us a lot, there will always be room for review by another human translator. If you join an existing team, the existing team coordinator might review all submissions from other team members. You might be able to ask someone to read over your translation file and check for possible areas of improvement. Another pair of eyes can often help to improve the quality. A translation program with spell checker and quality checks is probably the best software to use for this task.
ar: مع أن المراجعات الآلية يمكن أن تساعد كثيرا إلا أنها لا تُغني عن مراجعة مترجم آخر. عندما تنضم إلى فريق ترجمة فغالبا ستجد أن منسق الفريق يراجع ترجمات باقي الأعضاء، ويمكن أن تطلب من شخص غيرك مراجعة ترجمتك وتنبيهك إلى المواضع التي قد تحتاج للتحسين، فقراءة شخص آخر للترجمة كثيرا ما تساعد على تحسين جودتها، وأنسب أداة ترجمة لهذا العمل التي تدعم التدقيق الإملائي وفحوص الجودة.

source: Mature translation teams usually have an arrangement of how work will flow between translators and reviewers, and might even have rules that all files have to be checked by a reviewer. In some projects there are tools available to help you implement such workflows, and to help in communication in the team. The localisation website of the GNOME project is a great example in this regard.
ar: عادة ما يكون لفرق الترجمة الناضجة نظام يحدد دورة العمل بين المترجمين والمراجعين، وأحيانا قواعد تحتم مراجعة كل الملفات. توفر بعض المشروعات أدوات للمساعدة في تطبيق دورات عمل كهذه والتواصل بين أعضاء الفريق، وموقع توطين مشروع گنوم من الأمثلة الرائعة على هذا.

source: When you are working with PO files, it might be easy enough to simply mark translations as fuzzy when you still want someone to review them. The reviewer can then approve the translation by removing the fuzzy marker. Although this might be a bit limiting in some cases, it is a simple way to incorporate manual review into your localisation process.
ar: عندما تعمل على ملفات PO فمن السهل وضع علامة “مبهم” على الترجمات التي ترى أنها تحتاج للمراجعة، ويستطيع المراجع إزالة العلامة بعد مراجعته للترجمة. قد يكون هذا معيقا أحيانا إلا أنها أبسط طريقة لإدخال المراجعة اليدوية في صيرورة الترجمة.

source: During review, reviewers should pay attention to spelling, grammar, terminology, consistency, and all the other things that might be important. When you review someone else’s work, always try to provide polite feedback to serve as encouragement.
ar: على المراجعين الانتباه لقواعد الإملاء والنحو وغيرها من القواعد اللغوية بالإضافة إلى الاتساق بين الترجمات وتوحيد استعمال المصطلحات وغيرها من الأمور المهمة الأخرى. وعندما تراجع ترجمات الآخرين حاول أن تكون تعليقاتك على الترجمة مهذبة لتشجعهم على الاستمرار.

source: In-product review
ar: المراجعة العملية

source: A very important step in your localisation process is to review the translations in the running application. This will allow you to see the result of your translation work, and is always exciting to see for the first time. The basic principles of testing is the same, regardless of how the translated application is executed or built. The ways of how to do this can be very different for different programs, therefore we’ll discuss only the most common case in the next section.
ar: من الخطوات المهمة في صيرورة التوطين مراجعة الترجمة بصريا أثناء تشغيل البرمجية. يتيح هذا لك أن ترى نتيجة عملك، وخاصة متعة رؤية البرمجية مترجمةً للمرة الأولى. أساسيات المراجعة واحدة بغض النظر عن طريقة بناء البرمجية أو تشغيلها، لكن قد تختلف أساليبها من برمجية لأخرى، لذا سنعرض للحالات الأشهر في القسم التالي.

source: The purpose of in-product review is to review the translation in the way that the user will experience it. Now it is not just about the language issues, but about the whole experience of the user. To ensure that you test the translation well, you have to try to find every part of the program. Go systematically through every menu, look at every option in every dialogue box. Look for tooltips when you keep the mouse over some part of the program. You can even try to do unusual things, like opening unsupported files or entering invalid values in the configuration to try to see error messages. Even the error messages should be translated and reviewed!
ar: الغرض من المراجعة العملية مراجعة الترجمة كما سيراها المستخدمون، وبهذا يتضح أن الأمر يتعدى مجرد الترجمة إلى كل ما سيتعرض له المستخدم أثناء تفاعله مع البرمجية. لاختبار الترجمة كما ينبغي عليك محاولة مطالعة كل أجزاءها، تنقَّل نظاميا بين القوائم واحدة تلو الأخرى وانظر في كل خيار وكل مربع حوار، انظر في التلميحات التي تظهر عندما تستبقي مؤشر الفأرة فوق بعض عناصر واجهة البرمجية، بل وعليك محاولة فعل أشياء غير معتادة مثل فتح ملفات لا تدعمها البرمجية، و إدخال قيم غير مقبولة في تضبيطاتها وملاحظة رسائل الأعطال التي تظهر؛ فحتى رسائل الأعطال تُترجَم وتُراجَع.

source: Important issues to check for include things like consistent style and terminology, whether references to buttons use the same text as the buttons themselves, and if translations make sense in the context where they are used on the screen. Remember that programs might sometimes combine translations from several files, so consistency isn’t just about the translation quality in a single file.
ar: من الأمور التي ينبغي الالتفات إليها مراجعة اتساق الأسلوب و توحيد المصطلحات، وانسياب العبارات في السياق الذي ترد فيه على الشاشة، وكون نصوص الشرح في الواجهة التي تشير إلى بعض تحكّمات البرمجية تستعمل نفس العناوين المكتوبة على تلك التحكّمات. لا تنس أن البرمجيات كثيرا ما تتضمن ترجمات من ملفات عدة قد يكون عمل عليها أشخاص عديدون لذا في الاتساق مسألة مركبة.

source: Another important thing to check for is any strange layout caused by very long or very short translations. It could be that the programmer didn’t anticipate a translation as long or as short as yours, and the user interface might not appear neatly any more. Most software in the FOSS world will try to adapt automatically to changes in the translation by resizing things as necessary. In a few remaining projects it is still necessary to resize these things yourself. This is a time consuming task that requires you to spend much more time on testing, and might also require that you test the software on multiple platforms.
ar: من المهم كذلك ملاحظة أي انحراف في مظهر البرمجية بسبب الطول أو القصر المفرطين للترجمة، ففي بعض الأحيان لا يضع المبرمج في حسبانه أن نصا قد يكون بالطول أو القصر الذي عليه ترجمتك وبالتالي تفقد الواجهة تناسقها. أغلب البرمجيات الحرة تتكيف بسلاسة مع طول الترجمة، لكن قد يتطلّب الأمر ضبط أبعاد عناصر الواجهة بنفسك في قليل من المشروعات. يستغرق هذا الأمر مزيدا من الوقت في الاختبارات، كما قد يلزم اختبار البرمجية على أنظمة تشغيل مختلفة.

source: Another important thing to test in the running application is the use of accelerators. We discussed accelerators earlier on page <bf0>34</bf0>. Now you need to check that the accelerators were chosen well, and make any necessary corrections. In each menu, and each dialogue box, it is important to test every accelerator. It is usually activated by pressing Alt and the underlined letter. It might be necessary to press Alt to see the characters underlined. Does the relevant letter activate the control correctly? What happens when you press the letter again? If two controls on the screen use the same letter as accelerator, it often happens that they are alternately activated when you press that key. This is not a big problem, but should be corrected in your translation if possible. In big menus and dialogue boxes, you might need to plan carefully to select unique accelerators for each control. However, remember that the most important functions, especially in the main application window is probably the most important for you to review, and to ensure that they work well. Also try to keep the accelerators consistent for common things (like “File” and “Help”) between applications.
ar: المُسرِّعات من الأمور التي ينبغي ملاحظتها أثناء تشغيل البرمجية. تناولنا المسرعات سابقا في صفحة <bf0>35</bf0>، والآن علينا التأكد من أننا عيّنّا المسرعات المناسبة، وتصويب أي أخطاء نجدها. من المهم اختبار كل مسرع في كل القوائم وكل مربعات الحوار. تحتاج أحيانا لضغط <Alt> لتظهر السطور تحت المسرعات. تأكد من أن المسرع يُفعّل العنصر الصحيح، و لاحظ ما يحدث عندما تضغط المسرع ذاته مرتين، فإن كان المسرّع ذاته مُعيّنا لأكثر من عنصر فإن العناصر تُفعَّل بالتبادل مع كل ضغطة، و هذا في العادة ليس مشكلة حرجة، لكن يُفضّل فضَّ هذا التداخل إن أمكن. قد يلزم التخطيط بعناية لأي المسرعات تُعيِّن، لكن تذكر أن تُبدي أولوية للوظائف الحيوية خاصة تلك الموجودة في نافذة البرمجية الرئيسية. كذلك حافظ على اتِّساق مسرعات العناصر الشائعة (مثل “ملف” و “مساعدة”) بين التطبيقات المختلفة.

source: If you translated documentation, you should review it in the help viewer. Check that page titles and links between pages are correct, and that any search features show the correctly translated entries. Ensure that the help text uses the same terminology as the application. Reviewing the translated content itself is similar to reviewing translated documents.
ar: إذا كنت ترجمت الوثائق فعليك مراجعتها في عارض وثائق المساعدة المناسب. تحقق من صحة عناوين الصفحات و من مسارات الروابط ما بين الصفحات، وأن وظيفة البحث تُظهر نتائج مترجمة. تأكد من أن نصوص المساعدة تستعمل فيها المصطلحات ذاتها التي في واجهة البرمجية. مراجعة متن المحتوى لا تختلف عن مراجعة أي وثيقة مترجمة.

source: Testing a program using Gettext
ar: اختبار البرمجيات التي تستخدم جتتكست

source: Many FOSS projects make use of software called Gettext to support many languages in their project. In such projects you would have translated a PO file, and need to generate an MO file for testing. Some translation programs might be able to do this easily. Otherwise you can use the program <f0>msgfmt</f0><f1> from the command-line like this:</f1>
ar: تستخدم كثير من مشروعات البرمجيات الحرة حزمة برمجية تسمى جتتكست (Gettext) لتطبيق دعم تعدد اللغات في المشروع. في مثل هذه المشروعات تترجم ملف PO ويُوَلَّد منه ملف MO للاختبار، بعض أدوات الترجمة تحدث هذا بيسر، وإلا فعليك استعمال أداة <f0>msgfmt</f0> من سطر الأوامر:
