Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: You will probably spend most of your time in a translation program, so paste some text in the translation program to check that you can view the text there as well, and not just in your web browser. Some applications (like Virtaal) allow you to customise the font settings. You might want to adjust settings for the best display while working.
ar: ولأنك غالبا ستقضي معظم الوقت مع أداة الترجمة فعليك التأكد من أن النص يظهر سليما فيها وليس في متصفح الوِب وحده، وذلك بنسخ نَصٍّ ولصقه في حقل في الأداة. بعض التطبيقات (مثل فرتال) تتيح لك تطويع تضبيطات الخط لتحصل على أفضل عرض للنصوص يناسبك.

source: Furthermore, if you don’t have the necessary font on your system by default, it could very likely be true for users of your localised software as well. If they need to install an extra font, ensure that there are good instructions available, customised for different operating systems. Keep in mind that users without fonts won’t be able to read a website written in your language without that font, unless you publish instructions in a PDF document with the fonts embedded. (This way the users don’t need the font on their computers.) Some emerging web technologies allow a website to supply a font, but you should probably not count on that.
ar: وأيضا إذا لم يأت نظام التشغيل مُزوَّدا بالخطوط التي تتطلبها لغتك فغالبا ستكون الحال هي نفسها مع مستخدمي البرمجيات المترجمة، لذا عليك التأكد من وجود تعليمات واضحة منشورة متوافقة مع مختلف أنظمة التشغيل لتنصيب الخطوط الإضافية. ضع في الاعتبار أن المستخدمين لن يستطيعوا قراءة التعليمات ذاتها المكتوبة بلغتهم ما لم تكن لديهم الخطوط المطلوبة، إلا إذا حفظت التعليمات في ملف PDF مُضمَّنة فيه الخطوط المناسبة (و عندها لن يحتاج المستخدمين لوجود الخطوط عند قراءة الملف). بعض تقنيات الوِب الحديثة تتيح للمواقع توفير الخطوط المطلوبة لعرض النص في المتصفح دونما حاجة لأن ينصِّبها المستخدم بنفسه، لكن لا يمكن الارتكان إلى هذا حاليا.

source: In some cases software can be distributed with fonts to ensure that your language can be viewed correctly in the application. The software developers will be able to tell you if it is possible to distribute fonts with their software.
ar: في بعض الحالات يمكن توزيع الخطوط مع البرمجيات لضمان عرض اللغة كما ينبغي، تَباحث في هذا مع المطورين وسيُعلمونك بإمكانية ذلك أو عدمه.

source: Now that you are able to view your language on screen, it is important to know that you can type the language. In the system configuration you should be able to select the correct keyboard layout or input method for your language. Make sure that you know how to type all the characters of your language that you will need.
ar: والآن بعد أن أصبحت قادرا على عرض لغتك على الحاسوب كما ينبغي، عليك التحقق من إمكانية الكتابة باللغة على الحاسوب أيضا. في الأغلب ستستطيع اختيار تخطيط لوحة المفاتيح أو طريقة الإدخال المطلوبة من تَحَكُّمات إعدادات نظام التشغيل. تأكد من أنك تستطيع إدخال كل الأحرف التي تتطلبها كتابة لغتك.

source: If you are not yet used to typing in your language, it might be worthwhile to practice to improve your speed. The faster you can type, the more work you can do, and the more you will enjoy translation.
ar: إذا لم تكن معتادا على الكتابة بلغتك على لوحة المفاتيح فقد يفيد التمرن على ذلك لزيادة سرعتك، إذ كلما كتبت أسرع كلما أنجزت عملا أكثر واستمتعت بالترجمة أكثر.

source: Whenever you contribute the first translation or support for your language to an application, you will need to identify your language accurately to the software developers. When referring to your language, remember to use the English name of your language, and keep in mind that the developers might not know about about your country and relevant dialects. Identifying the language properly is usually done by means of a two or three letter code for your language. For example, the two letter code for English is ‘en’, and the two letter code for Russian is ‘ru’. It is common in FOSS projects to use two letter codes whenever they are available, and to use three letter language codes when no two letter code exists. These codes come from a standard called ISO 639. More information is available on Wikipedia:
ar: عندما تساهم بأول ترجمة أو دعم للغتك في برمجية ما يتوجب تعريف اللغة للمطورين بدقة. تذكَّر أن تستعمل الاسم الإنگليزي للغة وضع في الاعتبار أن المطورين قد لا يعرفون كثيرا عن لغتك. يستعمل في العادة رمز من حرفين أو ثلاثة للإشارة إلى كل لغة، فمثلا رمز الإنگليزية من حرفين هو ‘en’ والعربية ‘ar’، وعادة ما تَستخدِم المشروعات الحرة الرمز ذي الحرفين إن وجد وإلا فالرمز ذي الأحرف الثلاثة. يحدد هذه الرموز معيار يسمى أيزو 639، تمكن مطالعة المزيد عنه في ويكيبيديا:

source: If your language is spoken in multiple countries, it might be customary to do separate localisations for the different variants of the language in the respective countries. In such a case, the code is augmented with a country code, such as ‘fr_CA’ for French in Canada, or en_GB for English in Great Britain. Note that the country is usually only specified if there is a need to do separate localisation for each country where the language is spoken. Only specify a country if needed by the software project, or if you know that your localisation is part of a set of different localisations for your language.
ar: بعض اللغات التي تُستعمّلُ تنويعات منها في أكثر من بلد تكون لها ترجمة مختلفة لكل بلد، وفي هذه الحالة تُمَيَّزُ يُلحق رمز البلد إلى رمز اللغة، مثل ‘fr_CA’ للفرنسية الكندية أو ‘en_GB’ للإنگليزية البريطانية. لاحظ أنه لا حاجة لتحديد رمز البلد إلا في حال وجود أكثر من ترجمة لأكثر من بلد تستعمل فيه ذات اللغة، لذا لا تُحدد رمز البلد إلا إذا كان مشروع البرمجية المترجمة يتطلب هذا أو كنت تعرف أن لغتك توجد لها ترجمات مختلفة باختلاف البلد.

source: For some applications to work correctly in your language, your operating system will need a <f0>locale</f0><f1>. A locale provides information to software about a language and some of its customs, such as the proper way to write dates and times in your language, the correct formatting of numbers, etc. The list of available locales usually indicate which languages are supported on the system. In some cases, some software also maintain their own locale information in order not to rely on the operating system.</f1>
ar: بعد التطبيقات تتطلبُ ما يُعرف باسم <f0>المحلية</f0> لتعمل كما ينبغي مع لغتك. المحلية هي مجموعة إعدادات في نظام التشغيل تُقدِّم إلى البرمجيات معلومات عن لغتك والأنساق المتعلقة بها مثل طريقة تنسيق التاريخ والوقت وطريقة كتابة الأرقام إلى غير ذلك. المحليات المتاحة في نظام التشغيل عادة تُحدِّد اللغات التي يدعمها نظام التشغيل. بعض التطبيقات تحتوي على محليات خاصة بها و لا تعتمد على نظام التشغيل في هذا.

source: For Linux and certain other software that require locales, you can create a locale if it doesn’t yet exist. In the case of Linux locales, you really want a locale for the project <t0/>called “glibc”. This page provides more information:
ar: فيما يخص لينُكس وبعض البرمجيات الأخرى التي تستعمل المحليات، يُمكن إنشاء المحلية إذا لم تكن موجودة. في حالة لينكس فالمشروع البرمجي الذي تُضاف إليه المحلية يسمى “glibc”، ويمكنك الاطلاع على مزيد من المعلومات عنه الصفحة:

source: Although not all applications on Linux require a glibc locale, many do, and it is a very good idea to create one if it doesn’t exist yet for your language. Hundreds already exist, so most people wouldn’t need to worry about this.
ar: بالرغم من أن بعض البرمجيات في لينُكس لا تتطلب محلية glibc إلا أنه من الأفضل على كل حال إنشاء محلية إذا لم تكن موجودة للغتك. توجد المئات من المحليات حاليا، لذا فأغلب الناس لن يكون عليهم القلق بهذا الشأن.

source: With the previously mentioned things in place, you can localise almost any application, but there are several other tools that might help you with quality, or might make you more productive. See if you can find any of the following to help you during translation:
ar: بعد ضبط الأمور السابقة تستطيع توطين أي برمجية تقريبا، لكن توجد أدوات أخرى تساعد في تحسين الجودة أو زيادة الإنتاجية. انظر إذا كنت تستطيع الحصول على أي من هذه المُعينات على الترجمة:

source: spell checker – see if you have a working spell checker in your web browser (for online translation) or in Virtaal, depending on where you will do your work
ar: مُدَقِّقٌ إملائيٌ – تحقق من وجود مدقق إملائي و تفعيله في متصفح الوِب (إذا كنت تترجم عبر الوب) أو في فِرتال.

source: rules of spelling, orthography or grammar for your language
ar: قواعد الإملاء و الرسم والنحو في لغتك

source: bilingual dictionaries, especially related to the field you are translating in
ar: معاجم ثنائية اللغة متخصصة في المجال الذي تترجم فيه

source: English dictionary
ar: معجم إنگليزي

source: Even if these are only available online, they might help you when you get stuck.
ar: وحتى إن لم تكن هذه متاحة سوى على الوب فقد تساعد عند الاضطرار.

source: Style
ar: الأسلوب

source: Any piece of writing will show some aspects of style. The original language of the software will also have a certain style. It might be characterised by being formal or informal, for being technical or very accessible, and by respecting the rules of spelling and grammar to some degree.
ar: لكل قطعة أسلوب يغلب عليها، وهذا ينطبق على اللغة المنشورة بها البرمجيات ابتداء. فقد تتميز بكونها رسمية أو غير رسمية، تقنية أو مُبَسَّطة، و بدرجة ما من الالتزام بقواعد اللغة.

source: When we translate, we will create a work with a certain style, and should think about what we want to achieve. Should the work be as formal as the original? Can we use loan words, or should we strictly use well-known words from our language? There might be several such questions that could affect how we approach a translation. Think of your goals and your target audience.
ar: و عندما نترجم فإننا ننشئ قطعة لها أسلوبها، لذا علينا تحديد هدفنا منذ البداية؛ هل نريد الترجمة رسمية بقدر النص الأصلي؟ هل يمكن استعمال كلمات مستعارة من لُغات أخرى أم يجب الاقتصار على الكلمات الشائعة في لغتنا؟ وغيرها من الأسئلة التي تشكل منهجنا في الترجمة. علينا أن نضع في الاعتبار الهدف من الترجمة والجمهور الذي نستهدفه.

source: It is advisable to form some guidelines for software localisation in your language. Where there is more than one way of doing something, different translators might choose differently, and the inconsistency might reduce the quality. Without guidelines, newcomers to your team might need to make hard choices which can be demotivating and can reduce productivity. This section describes some aspects of style that you might want to consider. You might want to discuss this with other translators and interested people and work on documenting your recommendations as these rules develop in your team.
ar: من المستحسن وضع إطار لتوطين البرمجيات بلغتك، فعندما تتعدد أساليب أداء الأعمال قد يتَّبع كل مترجم أسلوبا مختلفة لأداء العمل ذاته، وعدم الاتساق الناشئ عن هذا يقلل من جودة الترجمة. وبدون معايير محددة قد تواجه المترجمين الجدد في فريقك اختيارات صعبة تُنفِّرهم وتقلل إنتاجيتهم. يعرض هذا القسم لمسألة الأسلوب. تُستحسن مناقشة هذه المسائل مع باقي المترجمين والمهتمين بالأمر وتوثيق هذه الأطر و صقلها مع الوقت.

source: Also keep in mind that users will probably get used to the style used in software, as long as it is consistent and in line with your cultural conventions.
ar: لاحظ أن المستخدمين سيعتادون على الأسلوب المستعمل مادام متسقا مع بعضه ومع خلفيتهم الثقافية.

source: Most languages have standardised some aspects of writing, such as the alphabet, spelling, use of capitalisation and punctuation. These rules form the <f0>orthography</f0><f1> of the language. Some languages have multiple orthographies (like Hausa which can be written with the Latin or Arabic script), or might have newer versions of the same orthography – if spelling or other writing rules change.</f1>
ar: لأغلب اللغات قواعد قياسية للكتابة، تشمل الأبجدية والإملاء وعلامات الترقيم وغيرها تسمى <f0>نظام الكتابة</f0>، وقد تُرسَم بعض اللغات بأكثر من نظام (مثل الهَوسَ التي ترسم بالحرف العربي أو اللاتيني) أو قد تتغير قواعد نظام الكتابة بتغير الزمن لتغير قواعد الإملاء أو غيرها.

source: You should be certain about the orthography you are following in your localisation work. You will benefit from publications by institutions for language standardisation, or even good textbooks if you are not very informed about the writing rules of the language. Furthermore, dictionaries will help with issues of spelling, although spelling is not a big problem in all languages. If your language is not well standardised, you might have a lot of freedom to decide how to do things. See your work as part of the task to standardise the writing in the language.
ar: إذا كان للغتك أكثر من نظام للكتابة فعليك تحديد أيها ستستعمل، وتمكن الاستفادة من منشورات المجامع اللغوية وغيرها من المؤسسات المعنية بتقنين قواعد اللغة، أو حتى الكتب المدرسية الجيدة في حال لم تكن معرفتك بنظام الكتابة كافية. تساعد المعاجم أيضا في ضبط الإملاء. إن لم تكن للغتك قواعد مقننة فسيترك لك هذا حرية اختيار القواعد التي تلائمك، و عندها سيصب عملك في جهود تقنين كتابة هذه اللغة.

source: There are some aspects of orthography that might be well standardised, but different from English. When new members of your team translate, they might forget what the true writing tradition is in your language, and therefore it might be useful to write about any problematic issues in your team documentation.
ar: أحيانا ما يغفل المترجمون الجدد أثناء عملهم عن القواعد التي تتبعها لغتك، لذا من المهم توثيق الأخطاء الشائعة ليُنتبه إليها.

source: A common mistake when starting with localisation, is to ignore the capitalisation in the source text, and always or never using capital letters. If your language should use capital letters, this can create a bad impression and affect readability of the text. If your language doesn’t use capital letters, this mostly doesn’t affect you. However, capitalisation can possibly give a hint about the meaning or use of a message in front of you. Capitalisation could indicate proper names (like brands or product names) and a complete lack of capitalisation might indicate that the translation is part of a bigger sentence.
ar: في كتابة العربية تشيع أخطاء الإملاء في الهمزات، و التمييز ما بين التاء المربوطة و الهاء في أواخر الكلمات، و كذلك التمييز ما بين الألف المقصورة و ياءُ آخرِ الكلمة. كما تشيع إقليميا أخطاء مرجعها اللهجات المحلية، مثل الخلط ما بين الذال و الزّاي، و الظاء و الضاد، و غيرها. تلك الأخطاء كلّها قد تُغيّر المعنى (لأنها كلمات أخرى) أو على الأقل تُصعِّب الفهم، كما تُقلل مقروئية النصّ كثيرا، يزيد من هذا إيجاز نصوص البرمجيات. فَراعِ قواعد الكتابة و تحقّق مما تشكُّ في درايتك به. كذلك استعمل علامات الشّكل (الحركات) كلّما وَجَدتَ هذا يُقلل اللبس أو يُسهّل القراءة، فهي جزء أساسي من نظام كتابة العربية، لا كماليات.

source: Another common mistake, is to follow the English capitalisation too closely. A writing <t0/>style called “Title Case” is very common in English software. When something is written in Title Case, most words start with a capital letter. This is not very common in other languages (German and languages with similar orthographies being notable exceptions). Ensure that you follow your language's rules and customs with regards to capitalisation. In most cases, we will write brand names and product names unchanged.
ar: من الأخطاء الشائعة في اللغات المكتوبة بالأحرف اللاتينية التي تُميّز ما بين أشكال كبيرة و صغيرة للأحرف تجاهلُ نمط الأحرف كليا باستعمال إما الأحرف الكبيرة على الدوام أو إغفالها كليا وهو ما يعطي انطباعا سيئا عن جودة النص ويقلل مقروئيته، أو بنقل نمط حالة الأحرف من الإنگليزية. التمايُز المنضبط في حالة الأحرف يساعد على فهم المعنى؛ فأسماء الأعلام (أسماء الأشخاص أو العلامات التجارية أو البلاد) تُبدأ بحرف كبير في بعض اللغات، والعبارة التي لا تبدأ بحرف كبير قد تُفهم على أنها جزء من جملة. لذا يجب اتباع القواعد الصحيحة للكتابة.

source: Examples
ar: أمثلة

source: Here are some examples from Northern Sotho where capital letters are only used for the start of sentences and proper names. The English is followed for capitalisation at the start of each message, but otherwise the title case is avoided for proper writing according to the rules of Northern Sotho.
ar: الأمثلة التالية بلغة سوتو الشمالية التي ليست في كتابتها أحرف كبيرة سوى في أوائل الجمل وأسماء الأعلام، لذا فالحالة تطابق الإنگليزية في أوّل كل رسالة، إلا أنها تخالفها في باقي العبارة لمخالفتها قواعد كتابة سوتو الشمالية.

source: English
ar: الإنگليزية

source: Not good
ar: خطأ

source: Recommended
ar: صواب

source: Another area where guidelines for your team might help, is to ensure that attention is paid to punctuation and spacing. If the use of punctuation and spacing is similar to English in your language, it might still be useful to specify that translators should pay attention to whether a message ends with a colon (:), question mark (?), exclamation mark (!) or an ellipse (…). Also keep in mind that an ellipse can be represented with three separate dots, or a special ellipse character which might be hard to type. Virtaal makes it easy to insert the special ellipse character by highlighting it as a placeable in the source text (see page <bf0>40</bf0> for working with placeables).
ar: علامات الترقيم والمسافات من الأمور المهمة التي ينبغي توثيقها في قواعد الترجمة. وحتى لو كانت قواعد كتابة لغتك لا تختلف عن قواعد كتابة الإنگليزية فمن المهم أن ينتبه المترجمون إلى الجُمَل التي تنتهي بنقطتين (:) أو علامة استفهام (?) أو علامة تعجب (!) أو ثلاث نقاط (…). لاحظ أن النقاط الثلاثة قد تكتب على الحاسوب ثلاثة نقاط متتالية أو محرفا واحدا يصورها كلها، وقد يصعب إدخاله في لوحة المفاتيح. يُسهِّل فِِرتال إدراج المحارف الخاصة كهذه بتمييزها على أنها مُدرج (المُدرجات مفهوم خاص في فرتال نتناوله بتفصيل في صفحة <bf0>40</bf0>).

source: If your language uses different punctuation from English, it might be good to remind translators of the differences, and to provide examples. Also note the cases that are the same, to avoid confusion. The original punctuation usually indicates something important, but you don’t always need to follow it blindly. For example, you might want to avoid the exclamation mark (!) if it is not so commonly used in your language.
ar: أما إذا كانت للغتك علامات ترقيم تختلف عمّا للإنگليزية فمن المهم تذكير المترجمين بالاختلافات وضرب أمثلة، مع توضيع علامات الترقيم المتطابقة لتلافي اللبس. ومع أن علامات الترقيم في النص المصدرغالبا ما تدل على أمر هام، إلا أنك يجب ألا تتبعها دون تمييز، فمثلا يكثر استعمال علامات التعجب (!) في الإنگليزية، لكن إذا لم تكن شائعة في لغة ما بنفس القدر فيمكنك تجاهلها.

source: Unusual spacing in the source text might be important, such as a space at the start or the end of a message. It might be used to align text, or to implement spacing between different controls in a program, or when parts of a sentence is joined together. This is often a programming mistake which you should report, but you will still encounter this. The use of two spaces between sentences is usually not very important to follow, although it might help to ensure consistency. The quality checks performed by software (such as Pootle) will try to indicate any difference between the source text and your translation.
ar: الاستعمال غير المعتاد للمسافات في النص الأصلي قد يكون عند قصد، مثل وضع مسافات في بداية الجملة أو في نهايتها، فقد يقصد به محاذاة النص أو الفصل بين تَحَكُّمات في واجهة البرمجية أو لضبط المسافات في جملة تنقسم إلى عدة أجزاء. و قد يكون خطأ برمجيا يتوجب الإبلاغ عنه. أحيانا تُوضع مسافتان بين الجملة و التي تليها، لكن لا يلزم اتباع هذه القاعدة، وإن كان اتباعها قد يساعد على ضمان الاتساق مع ما سبق. فحوص تدقيق الجودة الآلية في بعض البرمجيات (مثل بوتل) تحاول التنبيه إلى أي اختلافات من هذا النوع بين الأصل والترجمة.

source: If your language uses a different alphabet from English, it might be important to decide when and if transliteration should be used. Also ensure that there is agreement on how transliteration is done in the team. Transliteration is discussed in more detail on page <bf0>21</bf0>.
ar: إن كانت لغتك تكتب بغير الأحرف اللاتينية فمن المهم وضع معايير لكتابة الأعلام الأجنبية؛ متى تنقل صوتيا ومتى تكتب بأحرف لغتها الأصلية، والاتفاق على قواعد التصويت. نتناول هذا الأمر بتفصيل أكبر في صفحة <bf0>21</bf0>.

source: There are often more than one way to say the same thing. You can be formal, polite, informal, demanding, verbose, and even rude! The appropriate wording to use in your software translation could depend on several things. Ask yourself some of these questions:
ar: توجد دوما أكثر من طريقة لصوغ نفس المعنى، فيمكن صوغ الجملة فتكون رسمية متكلفة أو غير رسمية، أو مُلحّة، أو مقتضبة أو مسهبة، أو حتى فظّة. الصياغة الأمثل التي تناسب ترجمة البرمجية تعتمد على عدة عوامل. اسأل نفسك الأسئلة التالية:

source: How old are the users of the software?
ar: ما عمر مستخدمي البرمجية؟

source: In what kind of setting will they be using this? At home or at work?
ar: ما البيئة التي تستخدم فيها؛ في العمل أم في المنزل؟

source: Are there any wordings which might be offensive or impolite?
ar: هل بعض الصياغات مسيئة أو غير مهذبة؟

source: While we obviously want to write in the correct grammar, we additionally want to choose the ways of saying something that won’t offend a user, and will feel appropriate for the particular program. Using business language in software for kids might be unsuitable. Being very informal and casual in accounting software might make a user uncomfortable. Asking the user for information in an impolite way might reduce the user’s spontaneity and leave a bad impression of the software.
ar: فإلى جانب أننا نريد صياغة سليمة قواعديا، علينا مراعاة الصياغة بما لا يسيء المستخدم و بما يناسب التطبيق. فلغة الأعمال لا تناسب برمجية للأطفال، واستعمل لغة غير رسمية قد لا يناسب برمجية للمحاسبة، وسؤال المستخدم عن معلومات معينة بصورة غير مهذبة قد يعطي المستخدم انطباعا سيئا عن البرمجية ويقلل تفاعله معه.

source: Some things you might want to describe in your team documentation include:
ar: بعض ما قد يفيد توثيقه في معايير الترجمة:

source: How formal should the software be? Should the user be addressed as an older or respected person? You might want to stay on the safe side to avoid giving offence.
ar: ما مدى رسمية النص؟ هل يفترض استعمال ألقاب التوقير عند مخاطبة المستخدم؟

source: <f0>How should you translate questions? You will often encounter the word “</f0><f1>please</f1><f2>” in English. What is the appropriate way to word such requests in your language? A direct translation of “</f2><f3>please</f3><f4>” in your language might sound as if the software is desperately pleading for something, while it intended to politely encourage the user to go ahead and do something. Software also often asks for confirmation. A bad translation for “</f4><f5>Are you sure … ?</f5><f6>” might sound as if the software doubts the user’s ability.</f6>
ar: كيف تترجم الأسئلة؟ في اللغة الإنگليزية يكثر استعمال ”please“، فما الكلمة المناسبة في لغتك عندما تطلب شيئا؟ الترجمة الحرفية ”رجاء“ أو الإكثار منها قد تبدو تحذلقا أو مبالغة في التزلّف فتظهر البرمجية كأنما تستجدي معروفا من المستخدم، بينما المقصود تشجيع المستخدم بتهذيبٍ على فعل شيء ما. أحيانا تطلب البرمجية من المستخدم توكيد شيء ما، لكن ترجمة العبارة ”Are you sure?“ بأسلوب سيئة قد تجعل البرمجية تبدو كأنما تشكك في قدرة المستخدم على الفهم.

source: How should you translate commands? In English software, the text on buttons and links are often command verbs. Many languages don’t translate these as commands, but use the infinitive form of the verb. Think about what is most appropriate for your language. Think about if there might be ambiguity about whether the command is addressed to the user or to the computer. If your language clearly distinguishes causative verbs, you might want to ensure fine attention to such detail in these cases.
ar: كيف تترجم الأوامر؟ في الإنگليزية غالبا ما تكون النصوص على الأزرار وفي القوائم أفعال أمر، لكن في لغات أخرى لا تُصاغ على أنها أوامر وتستعمل صيغة المصدر من الأفعال. عليك تقرير الأنسب للغتك، وعليك التفكير كذلك في اللبس المحتمل بين كون الأمر موجها للمستخدم أم للحاسوب، و إن كان سيفهم من الصياغة أن التفاعل مع عناصر الواجهة سيؤدي إلى إحداث فعل ما أم غير ذلك.
