Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: Introduction
ar: مقدمة

source: Computers are amazing tools. They can help us in so many ways, yet we are often frustrated when they don’t work the way we want them to. We are frequently in interaction with technology where we change the way they work, and they change the way we work. A lot of this change is good, but we are not always aware how it changes us.
ar: الحواسيب أدوات رائعة يمكن الانتفاع بها على أوجه لا حصر لها، إلا أننا ننزعج عندما لا تعمل على النحو الذي نريد. نتفاعل باستمرار مع التقنية فنغير من طريقة عملها وتغير هي بدورها من طريقة عملنا، ومع أن هذا التغيير كثيرا ما يكون محمودا، إلا أننا لا نكون دوما واعين لكيف يغيرنا.

source: A lot of technologies we work with often, such as software, web sites and cell phones, contain text which is in some language or another. Today, it is often in one of the major languages of the world, such as English or French. Those of us who understand the language of the technology are able to use it, while other people might be entirely locked out, or unable to fully enjoy the benefits that the technology brings.
ar: تحتوي كثير من التقنيات التي نتعامل معها –مثل الحواسيب ومواقع الوب والهواتف المحمولة– على نصوص بلغة ما، وهي غالبا إحدى اللغات الأكثر انتشارا في العالم مثل الإنگليزية أو الفرنسية، مما يقصر إمكانية استخدام تلك التقنيات على من يفهمون تلك اللغات، ويحرم غيرهم من استخدام التقنية أو الانتفاع بكل فوائدها.

source: This book explains how software can be <f0>localised</f0><f1> – the process whereby software is translated or adapted in some other way. It will empower the user with knowledge of the issues and tools involved in translating software into new languages. Translated software can ensure that technology is usable for more people, and to ensure that more languages become used in information technology.</f1>
ar: يشرح هذا الكتاب أساليب <f0>توطين</f0> البرمجيات؛ أي ترجمتها وتطويعها لاحتياجات المستخدمين. يشرح الكتاب أدوات تستخدم للترجمة و مسائل متعلقة بترجمة البرمجيات إلى لغات أخرى. ترجمة البرمجيات تقرِّب التقنية إلى المتحدثين بتلك اللغة وتتيح استعمال لغات أكثر في تقنيات المعلوماتية.

source: It is important to realise that even if we are able to use technology in our second or third language, the constant exposure to this language doesn’t only allow us to use the technology, but it also slowly degrades our ability to use our own language. It is my belief that languages that are not used in all the important spheres of our lives will have a hard time surviving the onslaught of globalisation. Software localisation can therefore not only help with access to information and useful technology, but also with language revival and cultural preservation.
ar: من المهم الوعي بأهمية توطين البرمجيات، فحتى وإن استطعنا استخدام التقنية بلغة أجنبية فإن التعرض المستمر للغات الأجنبية يُضعف تدريجيا من ملكة اللغة الأم. و نحن نعتقد أن اللغات التي لا تُستعمل في كل النواحي الهامة للحياة اليومية تواجه خطر الانقراض في عصر العولمة الطاغية. لذا فتوطين البرمجيات لا يساعد فقط على إتاحة التقنية للعامة، بل ويساعد أيضا على إحياء اللغات والمحافظة على ثقافاتها.

source: This book specifically discusses the localisation of so-called <f0>Free and Open Source Software</f0><f1> (FOSS) – software that we are able to localise and distribute freely. Many such software projects are leading the industry in language support. </f1>Although this book is about FOSS, it will also be useful for learning about software localisation in general, and about contributing to FOSS projects in more ways than just localisation.
ar: يُعنى هذا الكتاب على وجه الخصوص بتوطين ما يعرف <f0>بالبرمجيات الحرة مفتوحة المصدر</f0>، وهي برمجيات يمكن توطينها ونشرها بحرية، والكثير من هذه المشروعات البرمجية لها الريادة في دعم اللغات المختلفة، مع هذا فالكتاب يبقى مفيدا في مجال توطين البرمجيات عموما، وفي المساهمة في البرمجيات الحرة في مجالات أخرى غير التوطين.

source: While several topics are discussed in this book, the scope is obviously limited to keep it at a manageable size. Many more topics might be relevant to localisation in a specific language, or with certain tools. We limit the discussion to topics of general interest to most FOSS localisation, and we limit the discussion on tools mostly to Virtaal and Pootle.
ar: بالرغم من تعدد الموضوعات التي يعرض لها هذا الكتاب إلا أنه لا يشمل كل شيء بهدف إبقائه في حجم معقول. توجد موضوعات أخرى عديدة تتعلق بلغة بعينها أو أداة بعينها، غير أننا في هذا الدليل نقتصر على التعرض للموضوعات المشترَكة في توطين أغلب البرمجيات الحرة، وعلى أداتي بُوتِل وفِرتال.

source: Acknowledgements
ar: إشادات

source: Some of the content of this book is based on material from the website of the Translate project:
ar: بعض محتويات هذا الكتاب بُنَيَت على مواد من موقع مشروع Translate:

source: Thank you to Samuel Murray for his material that is used in the section on terminology. The original Afrikaans article is available here:
ar: نشكر صمويل مُري على مقالته التي استعنّا بها في قسم المصطلحات. المقالة الأصلية باللغة الأفريقانية:

source: Thank you to Khaled Hosny suggesting guidelines on transliteration. The original Arabic article from the Arabeyes project is available here:
ar: نشكر أحمد غربية و خالد حسني على توصيات تخص اللغة العربية و على الإشارة إلى موقع عربآيز <a0>http://wiki.arabeyes.org</a0> كمصدر معلومات للموطنين العرب.

source: Licence
ar: الرُّخصة

source: This book is licensed under the Creative Commons licence called “Attribution Non-Commercial Share Alike”:
ar: هذا الكتاب مُرخَّصٌ برخصة المشاع الإبداعي: النِّسبة، غيرالتجاري، الترخيص بالمثل:

source: Content
ar: المحتويات

source: Chapter 1: Background
ar: الفصل الأول: تمهيد

source: Software localisation
ar: توطين البرمجيات

source: Open Source localisation
ar: توطين البرمجيات الحرة

source: Differences from normal translation
ar: الاختلافات عن الترجمة العادية

source: Differences from commercial localisation
ar: الاختلافات عن التوطين التجاري

source: Chapter 2: Orientation
ar: الفصل الثاني: نظرة عامة

source: What do you want to achieve?
ar: ما الذي تسعى لتحقيقه؟

source: Some principles to keep in mind
ar: مبادئ ينبغي الانتباه لها

source: Your environment
ar: البيئة المحيطة

source: Chapter 3: Before you start
ar: الفصل الثالث: قبل البدء

source: The tools that we’ll use
ar: الأدوات التي سنستخدمها

source: Viewing your language
ar: عرض لغتك

source: Typing your language
ar: كتابة لغتك

source: Codes and locales – initial support for your language
ar: الرموز والمَحَلِّيات – الدعم الأوَّلِيُّ للغتك

source: Useful extras
ar: إضافات مفيدة

source: Chapter 4: Style
ar: الفصل الرابع: الأسلوب

source: Orthography
ar: قواعد الكتابة

source: Grammatical style
ar: الأساليب البلاغية

source: Be true to the source text
ar: احفظ روح النص المَصدَر

source: Be true to the target language
ar: ابتعد عن الترجمة الحرفية

source: Chapter 5: Terminology
ar: الفصل الخامس: المصطلحات

source: Why develop terminology?
ar: ما أهمية تطوير المصطلحات؟

source: Which terms should be developed?
ar: أي المصطلحات نطوِّر؟

source: Available resources
ar: المصادر المتاحة

source: General principles
ar: مبادئ أساسية

source: Acronyms, abbreviations, brand names, product names
ar: الاختصارات والأسماء والعلامات التجارية

source: Terminology assistance in translation tools
ar: مُعينات ترجمة المصطلحات في أدوات الترجمة

source: Chapter 6: Reuse
ar: الفصل السادس: إعادة الاستخدام

source: When should translations be reused?
ar: متى يُعاد استخدام الترجمة؟

source: Some available sources
ar: بعض المصادر المتاحة

source: Some techniques and tools
ar: بعض الأساليب والأدوات

source: Translation memory, terminology and machine translation
ar: ذاكرة الترجمة و المصطلحات والترجمة الآلية

source: Reuse in Virtaal
ar: إعادة الاستخدام في فِرتال

source: Chapter 7: Technical issues
ar: الفصل السابع: مسائل تقنية

source: Things to leave untranslated
ar: ما لا يُترجم

source: Escapes
ar: الخُلوص

source: Markup
ar: الرَّقْم

source: Simple plurals
ar: الجموع الساذجة

source: Variables
ar: المتغيرات

source: Proper plurals
ar: الجموع الصائبة

source: Accelerators
ar: المُسرِّعات

source: Advanced handling of variables
ar: التعامل المتقدم مع المتغيرات

source: Chapter 8: Localisation tools
ar: الفص الثامن: أدوات التوطين

source: Virtaal
ar: فِرتال

source: Pootle
ar: بُوتِل

source: Chapter 9: Localisation projects
ar: الفصل التاسع: مشروعات التوطين

source: A simple localisation process
ar: صيرورة توطين بسيطة

source: Finding the relevant files
ar: إيجاد الملفات المطلوبة

source: Project communication
ar: التواصل مع المشروع

source: Version control systems
ar: نظم إدارة الإصدارات

source: Project schedule
ar: جدول المشروع

source: FOSS issues
ar: البرمجيات الحرة

source: Chapter 10: Beyond mere translation
ar: الفصل العاشر: ما بعد الترجمة

source: Testing and review
ar: الاختبار والمراجعة

source: Prioritisation (when you can't do everything)
ar: تحديد الأولويات (عندما لا تستطيع فعل كل شيء)

source: Non-textual localisation
ar: توطين ما هو خلاف الواجهة و غير النصوص

source: Chapter 11: Project case studies
ar: الفصل الحادي عشر: دراسات حالة

source: Tux Paint
ar: رسم تُكس

source: GTK+ and xdg-user-dirs
ar: جتك+ و xdg-user-dirs

source: Firefox
ar: فَيَرفُكس

source: The Debian installer
ar: مُنصِّب دِبيان

source: Background
ar: تمهيد

source: Computer software is often created to communicate with the user in a certain language, such as English. For the software to be usable by people who speak a different language, the software messages would have to be translated. This process is at the heart of <f0>software localisation</f0><f1>. Localisation really refers to all the changes made to a product to adapt it to a new language, country, culture or even legislation.</f1>
ar: تُصمَّم البرمجيات عادة بحيث تتواصل مع المستخدِم بلغة ما مثل الانجليزية، لذا تنبغي ترجمة الرسائل التي تعرضها ليمكن لمتحدثي اللغات الأخرى استخدامها، وهذا هو لب صيرورة <f0>توطين البرمجيات</f0>. ويُقصد بالتوطين كل التغييرات التي تُجرى على المُنتَج لتطويعه إلى لغة أو بلد أو ثقافة أو حتى نظام قانوني مختلف.

source: Example
ar: مثال

source: Look at how this text editor is completely adapted for Arabic:
ar: انظر كيف طُوِّعَ محرر النصوص هذا ليناسب اللغة العربية:

source: Although translation is the most prominent part of software localisation, there are many other changes to software that might be considered to adapt it to a new set of users. Maybe some images should be replaced, references to money should be adapted to the local currency, and dates and numbers might be formatted in a different way depending on the writing tradition of the new users.
ar: مع أن الترجمة هي الجزء الأهم في عملية التوطين إلا أن تغييرات أخرى يجب أخذها في الحسبان لتطويع برمجية لمجموعة من المستخدمين. فقد تكون حاجة لاستبدال بعض الصور أو إشارات العملة المحلية أو تنسيق الأرقام والتاريخ حسب الطريقة المتبعة في اللغة المستهدفة.

source: Mozilla Firefox version 3.6 was released in 65 localised versions, with more languages available as extensions.
ar: صدرت الإصدارة 3,6 من موزيلا فَيَرفُكس في خمس وستين لغة إضافة إلى لغات أخرى تتوفر عبر إضافات للبرمجية.

source: <f0>Software companies often consider software localisation when they are trying to find new clients in a country they didn’t operate in before, and localisation is a huge industry. Whereas even the most popular software was only available in a few languages during the 1990s, it is common these days for some software to be available in more than 30 languages, with some even available in more than </f0><f1>50.</f1>
ar: <f0>كثيرا ما تحسب شركاتُ البرمجياتِ التوطينَ وسيلة لفتح أسواق جديدة في بلدان لم يسبق لها العمل فيها، والتوطين صناعة كبيرة. فبينما لم تكن حتى أشهر البرمجيات في التسعينيات توجد سوى ببضعة لغات صار من المعتاد اليوم أن تتوفر بعض البرمجيات بأكثر من ثلاثين لغة، بل وأكثر من </f0><f1>خمسين</f1> أحيانا.

source: Making software available in a new language allows a whole new group of people to use software who might not have been able to do so before. Localised software might be a crucial requirement for someone to be able to take part in the digital world. As we spend <t0/>more time with computers, and more people do their jobs with computers, the need increases for everyone to be able to use computers, even if they only know one language well. By localising software, you can empower users to be first-class citizens of the digital world, without being slowed down by a language barrier or needing to feel as if their language is unimportant. Using your language in the realm of information technology is part of keeping it alive and relevant to the everyday activities of people.
ar: تمهد إتاحة البرمجيات بلغة جديدة طريق استخدامها أمام طائفة من المستخدِمين ربما لم تكن تستطيع استغلالها من قبل، وقد لا يستطيع بعض الناس الانخراط في العالم الرقمي دون البرمجيات المُوطّنة. ومع التوسع في استغلال الحواسيب لإنجاز مهام أكثر وأكثر تزيد الحاجة إلى إتاحتها لكل الناس حتى لمن لا يجيدون غير لغة واحدة. توطين البرمجيات يتيح للمستخدمين أن يكونوا مواطنين من الدرجة الأولى في العالم الرقمي دون أن تعوقهم حواجز اللغة أو أن يشعروا أن لغتهم غير هامّة. استعمالك لغتك الأم في عالم تقنية المعلوماتية من مقوّمات الحفاظ عليها و إبقاءها مفيدة في الحياة اليومية.

source: Although lots of companies sell computer software or only give you a licence to use their software under many restrictions, lots of software is available without such restrictions and often at no cost. Such software is often called <f0>Free Software</f0> or <f1>Open Source Software</f1><f2>. Great emphasis is placed on the </f2><f3>freedoms</f3><f4> given to users of the software, and to the availability of the software for any purpose. The localisation of this type of software is the focus of this book.</f4>
ar: مع أن كثيرا من الشركات تبيع برمجيات الحاسوب أو تعطيك ترخيصا وحسب باستخدامها مقيدا، إلا أنه توجد برمجيات كثيرة دون هذه القيود بل وكثيرا ما تكون مجانية. يُطلق على هذه البرمجيات <f0>البرمجيات الحُرَّة</f0> أو <f1>البرمجيات مفتوحة المصدر</f1>، ويُولي مناصروها اهتماما كبيرا <f3>للحريات</f3> الممنوحة لمستخدمي هذه البرمجيات و لتوافرها لكل الأغراض. توطين هذه البرمجيات هو محور هذا الكتاب.

source: <f0>Read more about Free Software: </f0><a1><f2>http://www.gnu.org/philosophy/free-sw.html</f2></a1>
ar: لمطالعة المزيد عن البرمجيات الحرة في: <a1>http://www.gnu.org/philosophy/free-sw.html</a1>

source: <f0>Read more about Open Source Software: </f0><a1><f2>http://opensource.org/docs/osd</f2></a1>
ar: وللمزيد عن البرمجيات مفتوحة المصدر طالع: <a1>http://opensource.org/docs/osd</a1>

source: <f0>Free and Open Software is often abbreviated as FOSS – an abbreviation that is also used in this book. Software released under stricter licences which is not Free and Open Source Software, is often called </f0><f1>proprietary software</f1><f2>. Although some proprietary software is aimed at the global market and available in many languages, it is usually entirely up to the software developer to decide which languages to support, and whether or not to release the localised versions at the same time as the official version.</f2>
ar: البرمجيات التي تخضع لتراخيص أكثر تقييدا بحيث لا تكون حرة أو مفتوحة المصدر كثيرا ما تسمى <f1>برمجيات مملوكة</f1>. ومع أن بعض البرمجيات المملوكة موجهة للسوق العالمي وتتوفر بالعديد من اللغات إلا أن توطين تلك البرمجيات في يد مطوريها وإليهم يرجع القرار في أي اللغات يدعمونها ومتى تصدر النسخ المترجمة.

source: Because Free Software allows modification, anyone is allowed to adapt the software to their needs. If we believe software localisation is important, Free Software allows us to localise the software and to distribute the modified version. In reality, Free Software is usually created by a community with an interest in seeing the software succeed in many ways, and welcome localisers to take part in the project to improve the software and contribute translations and other improvements necessary to make it more suited for a wider audience.
ar: لكن الأمر مختلف في حال البرمجيات الحرة إذ يُمكن لأيٍ كان تطويعها لتلائم احتياجاته، فإذا كنا نؤمن بأهمية توطين برمجية ما، فإن البرمجية الحرة يُمكننا توطينها ونشر النسخ المعدلة، وعادة ما يقوم على تطوير البرمجيات الحرة مجتمع يهمه نجاحها لذا يرحب بمساهمة المترجمين بالترجمة والتحسينات الأخرى الضرورية لتناسب البرمجيات الحرة جمهورا أوسع.

source: Since FOSS is valuable because it allows us to do more, and because it is usually available at little or no cost, we might want to localise FOSS simply as a way to support these projects, and to make them more popular.
ar: ولأن البرمجيات الحُرَّة تعطينا الحرية لنفعل بها المزيد ولأنها تتوفر في الأغلب بلا مقابل أو بتكلفة زهيدة، فقد يكون التطوع بتوطين تلك البرمجيات ردًا للجميل و مساهمة إيجابية في المجتمع.

source: Therefore we see many reasons for localising FOSS:
ar: لهذا تتعدد أسباب توطين البرمجيات الحرة:

source: Anyone is free to contribute and cause the change they want to see for their language
ar: الجميع بوسعه المشاركة والمساهمة بالتعديلات التي تتطلبها لغتهم

source: You can promote software that values your freedom
ar: مساهمة في نشر البرمجيات التي تقدّر حريتك

source: You can influence developers of proprietary software by improving their competition
ar: دفع مطوري البرمجيات المملوكة إلى تحسين برمجياتهم بطريق منافستهم

source: You can gain experience in localisation and translation
ar: التمرُّس على توطين وترجمة البرمجيات

source: Any professional translator will tell you that translation isn’t just some mechanical process. It is a creative process, a topic of academic research, and students can study translation at many institutions. When we see how software struggles to translate from one language to another, we see that a translation requires attention to detail to really feel right. The principles of document translation apply to software localisation as well, <t0/>and you will definitely benefit from any knowledge of translation. Don’t think that any computer programmer can translate software well just because they understand computers.
ar: أي مترجم متمرس سيخبرك أن الترجمة ليست عملية آلية، بل هي فن وموضوع للأبحاث والدراسة الأكاديمية. وعندما نرى قصور برمجيات الترجمة الآلية فإننا نعي أهمية الاهتمام بالتفاصيل الدقيقة لتخرج الترجمة مقبولة. ومبادئ ترجمة الوثائق تنطبق كذلك على توطين البرمجيات، و كُلُّ خبرة مكتسبة في الترجمة تفيد في الترجمة، و لا تظُنَّ أن كل مبرمج يستطيع ترجمة البرمجيات لمجرد معرفته بالحوسبة.

source: However, there are several areas in which software translation is different from other types of translation. Although the text is often of a more technical nature, that is not the only issue. Different tools are used, and there are different constraints on what you can do in a translation. We devote a whole chapter in this book to some of the technical issues that appear in software localisation (see page <bf0>27</bf0>). Therefore, keep in mind that very skilled translators will still need to be trained in the issues particular to software translation.
ar: لكن توجد اختلافات بين ترجمة البرمجيات وباقي أنواع الترجمة، منها الطبيعة التقنية للنصوص المترجمة لكنها ليست الاختلاف الوحيد، فالأدوات المستخدمة في الترجمة مختلفة، كما تختلف القيود على ما يُمكن فعله. خصصنا فصلا كاملا في هذا الكتاب لمناقشة المسائل التقنية التي تظهر عند توطين البرمجيات (انظر صفحة <bf0>27</bf0>). لذا ينبغي الأخذ في الحسبان أن حتى أمهر المترجمين بحاجة إلى التمرس على المسائل التي تختص بها ترجمة البرمجيات.

source: An interesting thing to keep in mind is that a translated document is usually read in a predictable way, from top to bottom, and seen in the same way it left the hands of the translator. With software, it is impossible to know exactly what a user will see, and in which order. Some of the text is changed when the software is running. A user might use software differently from you and therefore experience your translation in a different way than you do when using the translated software!
ar: من المهم الانتباه إلى أن الوثيقة المترجَمة عادة تقرأ بتتابع معروف من أولها إلى آخرها على الصورة التي وضعها المترجم عليها، لكن في حال البرمجيات لا تمكن تحديد ما سيراه المستخدم و بأي ترتيب، إذ تختلف طريقة استخدام البرمجية من شخص لآخر لذا فقد يطالع مستخدِم ما المترجمة بطرق غير الذي تراها أنت عندما تترجمها.

source: If you are familiar with commercial localisation, you probably already saw that FOSS localisation can be quite different. Whether or not money is involved, can obviously make a big difference to the motivations that participants have. It means that a translator might have much more freedom. Workflows are usually not dictated by the software project.
ar: إن كانت لك خبرة بتوطين البرمجيات المملوكة، فإنك على الأغلب لاحظت الاختلاف بينه و توطين البرمجيات الحرة. فوجود المال أو عدمه قد يكون له أثر على حفز المساهمة، و قد تعني ترجمة البرمجيات الحرة مزيدا من الحرية للمترجم، كما قد لا يفرض المشروع دورة عمل معينة.

source: There is often much closer contact between programmers and localisers in FOSS projects, and therefore you can usually get quick feedback on any questions or problems with the source text. Users and translators are also often in more direct contact, allowing feedback to reach you more directly.
ar: عادة ما يكون التواصل مباشرا بين المبرمجين والمترجمين في المشروعات الحرة، مما يسرّع الإجابة عن الاستفسارات أو المشكلات المتعلقة بالنص المصدر. كذلك فالمستخدمون والمترجمون يكونون أكثر قربا مما يتيح تشاورا مباشرا.

source: Many FOSS projects are really welcoming to localisers, and realise that they need to be attractive to volunteers, and often work hard to make things easy for volunteers to contribute translations. For this reason, it often happens that popular FOSS projects get contributions in many languages, even for languages not yet commercially viable outside the FOSS world.
ar: كثير من المشروعات الحرة ترحّب بالمُوَطِّنين و يسودها إدراك بأهمية جذب المتطوعين لذا يعمل أفرادها بجد لتسهيل مشاركتهم، ولهذا السبب كثيرا ما تتلقى المشروعات الحرة المشهورة مساهمات ترجمة بلغات كثيرة، بل وأحيانا بلغات لا تجذب الاهتمام التجاري خارج عالم البرمجيات الحرة.

source: In terms of tools and file formats, obviously FOSS translation tools are the preferred tools to use for FOSS localisation. The PO format is by far the most popular file format. Since this format contains both source and target text (similar to XLIFF), there is a lesser focus on retranslation and the exchange of translation memories. An example workflow is discussed in the section on “<bf0>A simple localisation process</bf0>” on page <bf1>45</bf1>.
ar: فيما يخص للأدوات يُفضل بالطبع استخدام أدوات حرة لتوطين البرمجيات الحرة. نَسَق الملفات PO هو الأكثر شيوعا، ولأنه يحوى النص المصدر إضافة إلى الترجمة (مثله مثل XLIFF) فالاهتمام أقل بإعادة الترجمة وتبادل ذواكر الترجمة. قسم “<bf0>صيرورة توطين بسيطة</bf0>” في صفحة <bf1>44</bf1> يعرض مثالا على صيرورة التوطين.

source: Orientation
ar: نظرة عامة

source: Formulating objectives
ar: تحديد الأهداف

source: As we saw in the previous section, there are many reasons to localise FOSS. Your reasons might be different from other contributors, but that usually won’t be a problem. What you should always keep in mind is this question:
ar: في الفصل السابق رأينا دوافع عديدة لتوطين البرمجيات الحرة، فدافعك قد يختلف عن المشاركين الآخرين، لكن هذه ليست مشكلة في الأغلب، كل ما عليك هو أن تضع نصب عينيك هذا السؤال:

source: If you just want to localise software because it is fun, it probably doesn’t matter much which software you localise or how you do it. However, many people might have specific goals. Maybe your main goal is to empower people of your country. Maybe you have language preservation in mind. Maybe you just want to promote some software. All of these are valid and noble goals, but it is useful to articulate them and keep your goals in mind, since they can influence your decisions.
ar: إن كنت تريد توطين البرمجيات لمجرد المتعة فغالبا لا يهمك كثيرا أي برمجية تترجم ولا كيف. لكن كثيرا من الناس يسعون وراء هدف معين، فقد يكون هدفك مساعدة الناس في بلدك، أو المحافظة على اللغة، أو ربما دعما لهذه البرمجية أو تلك. كلها أهداف نبيلة، لكن يجب تحديدها بوضوح ووضعها دائما نصب عينيك لأن كثيرا من القرارات التي ستأخذها تنبني على الهدف.
