Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: <f0>This will perform some basic tests on your translation file (refer to page </f0><f1><bf2>54</bf2></f1><f3>) and mention any serious issues that still need to be fixed. If nothing serious was detected, it will generate the file “program_name.mo”. The correct name will depend on the application (look for the current .mo file in your or other languages), but is usually just the name of the application in lower letters, followed by “.mo”.</f3>
ar: ستجري هذه الأداة بعض الفحوص الأساسية (انظر صفحة <bf2>51</bf2>) وستبلغك بأي مشاكل خطرة واجبة التصويب، فإذا لم تجد مشاكل خطرة ولَّدت ملف باسم مثل “program_name.mo”، والاسم الفعلي لهذا الملف يتوقف على الملف المصدر الذي مررته إليها، لكنه عادة ما يطابق اسم البرمجية مكتوبا بأحرف لاتينية صغيرة متبوعا بالامتداد “‪.mo‬”.

source: Now copy the new .mo file you created over the existing file (after making a backup), or copy it in the correct location. Here are the most common directories that are used (replace ‘xx’ with your language code ):
ar: الآن انسخ ملف ‪.mo‬ الذي ولَّدته إلى موضع وجود ملفات الترجمة (بعد أخذ نسخة احتياطية من الملف السابق إن وجد)، فيما يلي أكثر أسماء الأدلة المستخدمة شيوعا (استبدل ‘xx’ برمز لغتك):

source: <f0>/usr/share/locale/</f0><f1>xx</f1><f2>/LC_MESSAGES/</f2><f3> </f3><f4>(most Linux-based systems)</f4>
ar: <f0>/usr/share/locale/</f0><f1>xx</f1><f2>/LC_MESSAGES/</f2><f3> </f3><f4>(في أغلب نظم لينُكس)</f4>

source: <f0>C:\Program Files\</f0><f1>Program Name</f1><f2>\share\locale\</f2><f3>xx</f3><f4>\LC_MESSAGES\</f4><f5> </f5><f6>(Windows)</f6>
ar: <f0>C:\Program Files\</f0><f1>Program Name</f1><f2>\share\locale\</f2><f3>xx</f3><f4>\LC_MESSAGES\</f4><f5> </f5><f6>(في وِندوز)</f6>

source: You might need to create the directories if they are missing (especially on Windows). Remember that your system language must be set correctly.
ar: قد يتوجب إنشاء هذه الأدلة إن لم تكن موجودة (خاصة في وندوز) ولا تنسَ ضبط لغة النظام إلى اللغة المطلوبة.

source: As much as we might want to have all software in our own language, we will always have too little time, too few people to help us, and the amount of software will just get more and more. Does that mean we should give up? Of course not. It has been shown many times in the FOSS world that a small team or even an individual person can do a lot of good localisation work and have a lot of translated software available. This section explores some ideas of how to maximise your impact, and tries to provide an idea of what to do if you can’t do everything. Remember to keep your goals in mind!
ar: بقدر ما نرغب في ترجمة كل البرمجيات إلى لغتنا إلا أننا دوما تخضع لقيود الوقت وقلة المساهمين، وزيادة العمل المطلوب يوما بعد يوم. هل نتخلى عن التوطين إذا؟ بالطبع لا، فقد رأينا مِرات عديدة في عالم البرمجيات الحرة أن فريقا صغيرا أو حتى شخصا واحدا يقدر على إنجاز الكثير وتوطين قدر كبير من البرمجيات. يستعرض هذا القسم بعضا من الأفكار التي تساعدك تعظيم أثر عملك، و تعطي فكرة عما يمكن فعله عندما لا تستطيع كل شيء. لا تنس أن تضع أهدافك نصب عينيك.

source: Counting and estimating
ar: العدُّ والتقدير

source: If there is too much work to do, or you think there is too much work to do, it is very useful to know <f0>exactly how much work is involved in translating a certain file or piece of software. It is common in many FOSS projects to count the number of strings (messages), but in reality this doesn’t give a very complete view of how much work is required to finish a certain task. Counting the number of words is a very good indication of the amount of work required to complete a translation.</f0>
ar: إذا كان العمل كبيرا، أو كنت تظن هذا، فمن المفيد للغاية معرفة مقدار العمل المطلوب لترجمة ملف أو برمجية ما. أغلب مشروعات البرمجيات الحرة تُحصي عدد المقاطع (الرسائل) لكن هذا لا يرسم صورة واضحة عن مقدار العمل المطلوب، عدد الكلمات معيار أدق لحساب العمل الذي تستغرقه الترجمة.

source: <f0>Some projects might give a summary of the progress in each language. Always check if the numbers they mention are messages or words. Most translation tools can also give such a summary. Pootle and Virtaal prefer to mention word counts rather than message counts. You can also count many files easily on the command line with </f0><f1>pocount</f1><f2> from the Translate Toolkit (see page </f2><f3><bf4>9</bf4></f3><f5>).</f5>
ar: بعض المشروعات تُبيِّن ملخصا بتقدم كل لغة. انظر هل يَعُدُّون الكلمات أم المقاطع. أغلب أدوات الترجمة يمكن أن تعطيك ملخصات كهذه أيضا، ينحو بُوتِل وفِرتال إلى ذكر عدد الكلمات لا عدد الرسائل، كما يمكن عدّ كلمات أي عدد من الملفات تريد من سطر الأوامر بيسر باستخدام أداة “pocount” من عُدّة الترجمة (انظر صفحة <bf4>12</bf4>).

source: Of course this doesn’t say anything about the difficulty, the amount of reuse you might get from a translation memory, or the quality of the English. These and other issues will still influence how long a translation takes, but the information will help you to make better decisions.
ar: لا يبين هذا طبعا درجة صعوبة الترجمة أو بأي قدر ستفيدك ذاكرة الترجمة أو حتى جودة النص المَصدَر، و هذه و غيرها عوامل تحدد الوقت الذي تستغرقه الترجمة، ومع هذا ستفيدك هذه المعلومات في التخطيط لعملك.

source: Choosing the product or project
ar: اختيار منتَج أو مشروع

source: Depending on your goals, you might already know what software you want to translate. If you are still deciding what to translate, some projects might be more attractive or useful than others. Therefore you should try to find a bit of information about a project to help you make your decision:
ar: قد تعيِّن لك أهدافُك أي البرمجيات تريد أن تترجم، إما إن كنت لم تقرر بعد فعليك أن تحاولَ جمع بعض المعلومات عن كل مشروع لتساعدك في اتخاذ قرارك:

source: How much translation work is required?
ar: ما مقدار العمل المطلوب؟

source: How easy is it to submit a new translation?
ar: ما مدى سهولة إيداع ترجمات جديدة؟

source: Does the software support any special needs of your language, such as right to left display for languages like Arabic, or special fonts?
ar: هل تدعم البرمجية خصائص لغتك، مثل الكتابة من اليمين لليسار أو الخطوط التي تتطلبها؟

source: Are you able to use your preferred translation tools?
ar: هل ستستطيع استخدام أدوات الترجمة التي تفضلها؟

source: Is this end-user software? Specialised software might not help you to have big impact.
ar: ما شريحة المستخدمين الموجه إليها؟ قد لا يكون للبرمجيات المتخصصة الأثر الذي تصبو إليه.

source: Does it run on multiple platforms like Windows and Linux? Are versions for all supported operating systems available at the same time?
ar: هل يعمل على أنظمة تشغيل مختلفة مثل وندوز ولينُكس؟ هل تتوفر إصدارات لكل الأنظمة المدعومة في الآن ذاته؟

source: Will users be able to activate the localised interface easily, or will some configuration be required?
ar: هل سيستطيع المستخدمون تفعيل الواجهة الموطنَّة بيسر أم يتطلب الأمر تضبيطات؟

source: Does the software require translations of other software like software libraries? If so, you should probably ask all these same questions about the other pieces of software.
ar: هل يتطلب توطين برمجيات أخرى مثل المكتبات البرمجية؟ وإن كانت الإجابة نعم فيتوجب بحث إجابة كل هذه الأسئلة عن تلك البرمجيات الإضافية أيضا.

source: Obviously you don’t need to restrict your involvement to projects that are ideal in all regards. You might simply want to translate something because it is fun or because you personally use it. But any software that is harder than necessary might break your speed, and can be demotivating.
ar: بالطبع لست ملزما بقصر مساهمتك على المشروعات المثالية من كل هذه الجوانب؛ يمكن أن تترجم مشروعا ما لأن الأمر ممتع أو لأنك تستخدمه، لكن المشروعات الصعبة ستقلل من سرعتك وقد يكون الأمر محبطا لك.

source: Partial localisation
ar: التوطين الجزئي

source: While we would usually want to translate everything in a given piece of software, there are definitely some parts of the software that is more important than others to translate. If we can’t translate everything, we can look for ways to take some shortcuts, especially for the first translation in our language. We should therefore look for ways of maximising <t0/>our coverage while reducing the scope of the work.
ar: في أي برمجية نترجمها نرغب عادة في ترجمة كل شيء، لكن بعض الأجزاء أهم من غيرها، فإذا كنا لن نستطيع ترجمة كل شيء فمن الأفضل أن ترجم الأجزاء الأهم أولا، خاصة إذا كانت هذه أول ترجمة بلغتنا. لذا علينا البحث عن وسائل لتعظيم مخرجات العمل مع تقليل نطاق العمل.

source: In some cases, especially for very technical text, it might even be better to leave certain things untranslated. If things like error messages contain many new terms that are not well established yet, users who are very familiar with the English might be put off using the translated version. Remember that your audience will develop with you – the more people use localised software, the more they will get used it. If you are starting with new localisation, skipping things like the technical error messages in the internals of the software just makes sense, and provides you with an opportunity to work on things that more users will see. You will also get more satisfaction initially from more visible parts of the software.
ar: في بعض الحالات، خاصة في النصوص ذات الطبيعة التقنية المتخصصة، قد يكون من الأفضل ألا تُترجَم بعض الأشياء. إن كان رسائل الأعطال وما شابهها تحتوي على مصطلحات جديدة عديدة لا ترجمات راسخة لها فقد ينفرُ المستخدمون المعتادون على المصطلحات الإنگليزية من الترجمة. تذكَّر أن جمهورك يتطور معك؛ فكلما زاد استخدام الناس للبرمجيات الموطنة كلما اعتادوها أكثر. إن كنت تستحدث ترجمة جديدة فربما كان من المستحين تجاوز رسائل الأعطال التقنية التي تتعلق بدواخل البرمجية والتركيز على الأجزاء التي سيراها المستخدمون أكثر، فالأجزاء الظاهرة أكثر للمستخدمين هي ما سيبنون عليه انطباعهم.

source: An easy way to reduce the number of words, is to only translate certain files in a project with several files. If it is easy to identify the more important files, this could help you get started. If the project has only one file, or the important work is in all the files of the project, we might want to look for a way to extract the important things to work on. A tool from the Translate Toolkit called <f0>pogrep</f0><f1> is a great help in this regard (see page </f1><f2><bf3>9</bf3></f2><f4>). You could for example only extract short strings, or only strings that don’t come from programming files with the word “admin” in them. Read more </f4><f5>about pogrep here:</f5>
ar: من الوسائل السهلة لتقليل عدد الكلمات أن تترجم ملفات محددة إذا كان المشروع يتألف من ملفات كثيرة، فإذا أمكن تحديد الملفات الأهم بسهولة فسيساعدك هذا في خطواتك الأولى. أما إن كان المشروع من ملف واحد أو كانت الأجزاء المهمة موزعة على كل الملفات فيمكن استخلاص الأجزاء المهمة. أداة “pogrep” من عُدّة الأدوات يمكن أن تكون عونا كبيرا لك في هذه المسألة (انظر صفحة <bf3>12</bf3>). يمكنك مثلا استخلاص المقاطع القصيرة و حدها، أو تلك التي لا تأتي من ملفات برمجية يحتوي اسمها على كلمة “admin” (وظائف الإدارة). طالع المزيد من المعلومات عن هذه الأداة هنا:

source: Although we discuss a lot of issues relating to translation, some projects might contain more than just translation work. A typing program might need information about the characters in your language and words for the typing exercises sorted by difficulty. Some games allow you to create sound files in your language. A word processor might allow you to specify a list of common typing mistakes to correct.
ar: رغم أننا تناولنا أمورا كثيرة متعلقة بالترجمة إلّا بعض المشروعات لا تقتصر على الترجمة وحدها؛ فبرمجية لتعليم الكتابة على لوحة المفاتيح تحتاج لمعلومات عن أحرف لغتك وكلمات للتمارين مرتبة حسب درجة صعوبتها، و معالج النصوص قد يحتاج إلى قائمة بالأخطاء الشائعة التي يمكن تصويبها، و بعض اللغات يمكن تضمينها ملفات صوتية تنطق بلغتك، إلخ.

source: While you are translating you might notice some mistakes in the original text, or realise that it can’t be translated properly because of the programmers made certain assumptions about languages or cultures that aren’t true in your case. Help the programmers by reporting these issues and thereby make translation easier for other people as well.
ar: أثناء الترجمة قد تجد أخطاء في النص المصدر أو تكتشف صعوبة ترجمته على نحو واضح لأن المبرمج أو كاتب النصوص الأصلية لم يضع في اعتباره الاختلافات بين اللغات والثقافات المتعددة. ساعد المبرمجين بإبلاغهم عن هذه الحالات فهذا يسهِّلُ الترجمة على الآخرين.

source: Discussing all of these issues are outside the scope of this book, but in this section we discuss some non-textual localisation that are a little more common.
ar: هذه المواضيع خارجة عن نطاق هذا الكتاب لكننا نتناول في هذا القسم بعض المسائل الشائعة في توطين ما هو غير النصوص.

source: Number and date formats
ar: تنسيق الأعداد والتواريخ

source: There are different traditions for writing numbers and dates around the world. Some languages have their own digits – an entirely different set of symbols to represent 0,1,2...9. Even in languages that use the same digits as English, there are different conventions about how to show fractions, and how to show large numbers. The same number and date is written differently in different places around the world.
ar: تختلف أساليب كتابة الأعداد والتواريخ من بلد لآخر، فبعض اللغات تستعمل في كتابتها أرقام تختلف عن الأرقام الشائعة، وحتى اللغات التي تستعمل الأرقام الشائعة قد تختلف فيها طرق كتابة الكسور أو تمييز الأعداد الكبيرة؛ فالعدد والتاريخ ذاتهما يكتبان بصور مختلفة حول العالم.

source: Number example
ar: مثال على الأعداد

source: 10509 (unformatted – ten thousand five hundred and nine)
ar: 10509 (غير منسق؛ عشرة آلاف وخمسمئة وتسع)

source: 10,509 (USA)
ar: 10,509 (الولايات المتحدة)

source: 10.509 (Germany)
ar: 10.509 (ألمانيا)

source: ൧൦,൫൦൯ (India – Malayalam)
ar: ൧൦،൫൦൯ (الهند؛ مالايلام)

source: Date example
ar: مثال على التاريخ

source: 15 March 2010 (2010-03-15)
ar: 15 مارس 2010 (2010-03-15)

source: March 15, 2010, 03/15/2010 (USA)
ar: March 15، 2010، 03/15/2010 (الولايات المتحدة)

source: 15. März 2010 (Germany)
ar: 15. März 2010 (ألمانيا)

source: Ensure that you are familiar with the correct custom for writing numbers and dates in your language. Some projects might ask you to specify how numbers should be formatted by the software. This is usually done as part of locales (refer to page <bf0>10</bf0>), although it might be duplicated in a piece of software, and might even be indicated with special variables in the translation file. Refer to the section on date and time variables on page <bf1>37</bf1>.
ar: انتبه إلى النسيق الصحيح للأعداد والتواريخ في لغتك. بعض المشروعات تطلب منك تحديد كيفية تنسيق الأرقام، عادة ما يكون هذا جزءا من المَحلَّية (انظر صفحة <bf0>13</bf0>) لكنه أحيانا يتكرر وروده في بعض البرمجيات بل وقد تُستعمل له متغيرات خاصة في ملف الترجمة، راجع قسم متغيرات الوقت والتاريخ صفحة <bf1>38</bf1>.

source: Currency and units of measurement
ar: العملة ووحدات القياس

source: When software displays amounts of money (such as accounting software), it should not only format numbers correctly, but also indicate the correct currency for the relevant country. Similarly, countries might use different units to measure physical amounts such as distance, weight, etc. Always check that software follows the correct customs for your language or country. In some cases it might be necessary to convert the unit of measurement in translation. You will find some websites or software that can help you do a conversion from miles to kilometres, for example. However, when a physical quantity is only used as an example (usually with a nice round number), consider simply leaving it at a round number and changing the unit. For example, when a game talks about some gold weighing 100 pounds, changing it to 100 kg might make it easier to read without impacting the message. Make sure that it is definitely safe to do this. If you are unsure, translate it more literally or convert the unit.
ar: عندما تعرض البرمجيات قيما مالية (في برمجيات المحاسبة مثلا) فإنها لا تُنسِّق وحسب الأعداد بل توضِّح العملة الصحيحة كذلك. كما أن بعض البلدان تستعمل فيها وحدات قياس مغايرة للمسافات والأوزان وما شابهها. تحقق من أن البرمجية تتبع المعايير المناسبة للغتك وبلدك. أحيانا تحتاج للتحويل من وحدة لأخرى في الترجمة مثل التحويل من ميل إلى كيلومتر، وستجد بعض المواقع أو البرمجيات التي تساعدك في هذا، لكن إذا كانت الكمية مذكورة على سبيل المثال ليس وحسب (عادة ما تكون عددا صحيحا) فمن الأفضل أن تترك العدد كما هو وتغير الوحدة فقط، فمثلا إذا كانت لعبة تتحدث عن بعض الذهب وزنه 100 رطل فربما من المستحسن تحويلها إلى 100 كجم لتكون أسهل في القراءة، لكن عليك التأكد من أنه لا ضرر من فعل هذا وفي حال الشك ترجمها حرفيا أو حول القيمة.

source: Images
ar: الصور

source: Images are a good tool to help with understanding. However two people from different cultures can look at the same image and react differently or understand it differently. This has a lot to do with the background, culture and the environment an individual lives in. Images might make references to geographical features, activities, brand names, etc. that are not well known to the target audience, or which might not convey the intended meaning.
ar: الصُّور معينات عظيمة على التوضيح، لكن شخصين من ثقافتين مختلفتين قد ينظران إلى الصورة ذاتها فيستنتجان أمرين مختلفين تماما. فالصورة قد تشير إلى معالم جغرافية أو أنشطة معينة أو أسماء معينة إلخ تخص ثقافة بعينها ولا يعرفها جمهور المستخدمين أو لا تحمل عندهم الدلالة المقصودة.

source: You might do localisation for years without ever needing to change an image, but it is good to be aware of the fact that images aren’t necessarily suitable for your target audience. Always consider if an image might have a negative connotation, or if it might not succeed in communicating the correct message.
ar: قد تمر عليك سنوات من الاستغال بالتوطين لا تحتاج فيها لتغيير صورة واحدة، لكن من المهم معرفة أن بعض الصور قد لا تناسب الجمهور الذي تستهدفه، لذا ضع في الحسبان أن بعض الصور قد تحمل معان سيئة في بعض الثقافات أو قد لا توصل الرسالة المطلوبة.

source: In some cases images might contain text which might need to be localised. This is usually bad practice by the programmers, but there might be valid reasons to do this.
ar: أحيانا ما تحتوي الصور على نصوص تنبغي ترجمتها، ومع أن هذه لا تعد ممارسة برمجية جيدة إلا أن الحاجة قد تدفعك إليها لسبب أو لآخر.

source: Images can be edited in a number of different programs, but it is best to check with the programmers of the project which files should be used, and if the software supports alternate images for your localisation. You don’t want to spend time working on images with no result. Take extra care to review any text you have to place in images – since you are probably not editing this in a translation program, it is easier for spelling mistakes or other inconsistencies to happen.
ar: توجد برمجيات تحرير صور عديدة لكن من الأفضل أن تراجع مطوري المشروع لتعرف ما الملفات التي ستستخدمها وهل تدعم البرمجية صورا بديلة في الترجمة أم لا، بدلا من أن تضيع وقتك في العمل على صُور لن تُستعمل. احرص على مراجعة الكتابات الظاهرة في الصور بعناية، فاحتمال الأخطاء الإملائية وغيرها أكبر لكونك لا تحررها في أداة ترجمة متخصصة. كذلك اسأل عن الصور في أنساق تحرير وسيطة عِوضا عن العمل على أنساق قد ينتج عنها تدهور في الجودة أو الذوق أو تتطلب جهدا عظيما و مهارة كبيرة لترجمة الكتابات الظاهرة فيها.

source: Sorting and lists
ar: الترتيب والقوائم

source: Many languages have their own rules to describe the desired order in which words are sorted alphabetically. Even languages that use the Latin alphabet might have specific rules on how to sort specific words or character patterns due to the nature of the language, or due to historical practices. Check for places where sorting might be relevant, and check that the correct rules are used for your language. This is usually obtained from a locale or a programming library.
ar: تختلف قواعد الترتيب الهجائي للكلمات من لغة لأخرى (و في العربية يوجد كذلك الترتيب الأبجدي)، حتى اللغات التي تُكتَب بنفس نظام الكتابة (العربي أو اللاتيني مثلا) تختلف القواعد فيما بينها بسبب الاختلافات في طبيعة كل لغة، أو حتى لممارسات تاريخية. تحقق من المواضِع التي يرد في ترتيب للكلمات وانظر هل تتبع القواعد المناسبة للغتك أم لا. عادة ما تؤخذ هذه القواعد من المحلية أو من مكتبة برمجية.

source: Project case studies
ar: دراسات حالة

source: In this section, we show a few case studies of well known FOSS projects, and how you might want to evaluate them. You might want to refer back to the section on “<bf0>Choosing the product or project</bf0>” on page <bf1>56</bf1>. We will be using some of the criteria mentioned in that section to evaluate these projects here.
ar: نعرض في هذا القسم بعض دراسات الحالة لمشروعات حرة شهيرة، وكيفية تقييمها. قد ترغب في مراجعة قسم “<bf0>اختيار مشروع أو منتج</bf0>” في صفحة <bf1>54</bf1> إذ سنستعمل بعضا من المعايير المذكورة هناك لتقييم هذه المشروعات.

source: Tux Paint is a drawing program for kids.
ar: “رسم تُكس” برمجية رسم للأطفال.

source: A translation of the application only is about 1500 words.
ar: ترجمته حوالي 1500 كلمة فقط.

source: It is trivial to submit new translations – an e-email to the programmer is enough.
ar: إيداع الترجمات الجديدة بسيط للغاية؛ تكفي رسالة بريد إلكتروني إلى المبرمج.

source: It has some support for advanced text layout, but each language would have to check for any special requirements. It supports right to left languages, several Asian languages, and languages needing complex text layout..
ar: يحتوي على بعض الدعم المتقدم لعرض النصوص لكن على كل لغة التحقق من تحقق متطلباتها الخاصة. يدعم اللغات التي تكتب من اليمين إلى اليسار والعديد من اللغات الآسيوية بالإضافة إلى اللغات التي تتطلب عرضا مُعقَّدا للنصوص.

source: Plain Gettext PO files are used, supported by Virtaal and a wide selection of translation tools.
ar: يستخدم ملفات جتتكست (PO) العادية التي يدعمها فِرتال وأدوات ترجمة أخرى عديدة.

source: It is aimed at end users, and specifically children who might not know any second language.
ar: موجه للمستخدمين النهائيين بخاصة الأطفال الذين أغلبهم لا يعرفون أية لغات أجنبية.

source: It is cross-platform software, available for many operating systems.
ar: عديد المنصات ومتوفر للعديد من أنظمة التشغيل.

source: A small change is required to test the localised interface. However, it is usually easy to replace an existing language’s file to test. There is a configuration program to select the language as soon as it is one of the official languages.
ar: يلزم إجراء بسيط لاختبار لغة الواجهة، لكن من السهل استبدال ملف أي من اللغات الموجودة للاختبار، وتوجد برمجية تضبيط لاختيار اللغة بعد إضافتها رسميا إلى البرمجية.

source: No other software needs to be translated, although the website and extra functionality can also be translated.
ar: لا حاجة لترجمة أي برمجيات إضافية، لكن يمكن ترجمة الموقع وبعض الوظائف الإضافية.

source: From the list it should be obvious that Tux Paint is a very attractive program for localisation. The text isn’t very technical, although you might have to think a bit about some of the colours and shapes. It is an ideal project for someone who is new to localisation. It is fun, and the work pays off quite easily.
ar: من هذه القائمة يظهر جليا أن “رسم تُكس” مرشح جذاب للترجمة، والنص ليس تقنيا للغاية وإن كان عليك التفكير في أسماء الألوان والأشكال، وهو مشروع مثالي لشخص حديث عهد بالتوطين؛ فالعمل عليه ممتع ويظهر أثره بسهوله.
