Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: Translating software is different from translating documents, and this section will discuss several of the most common issues that a localiser should be familiar with. Although some of these issues might seem complicated at first, you can rest assured that you will get used to them quite quickly, and that most translation doesn’t involve a lot of such technical issues.
ar: تختلف ترجمة البرمجيات عن ترجمة الوثائق، ويتناول هذا القسم بعضا من المسائل الشائعة التي على المُوَطِّن الإلمام بها. قد تبدوا بعض هذه المسائل معقدة لأول وهلة، لكن لا تقلق فستعتادها بسرعة كما أن أغلب الترجمات تخلو من هذه المسائل.

source: It is common to find things in translations that should be left untranslated. Easy examples include things like <f0>e-mail addresses</f0> and <f1>website addresses</f1> (URLs) that should be left unchanged. Ensure that everyone on your team knows what e-mail addresses and URLs look like. There are exceptions: example addresses such as <a2>http://example.com</a2> or <a3>user@business.com</a3> might simply be intended to show the user what type of input they should provide to the software. If you are sure that these are only examples, it might make them more accessible if they are translated, since a user might realise that it is only an example. In the case where a URL points to a website or documentation that is available in different languages, you might want to change the address to point to the version in your language (if it is available).
ar: من الشائع وجود عناصر في الترجمة تترك كما هي، مثل <f0>عناوين البريد الإلكتروني</f0> و <f1>مسارات مواقع الوب</f1>، فينبغي التأكد من أن أعضاء الفريق يعلمون كيف تبدو عناوين البريد و مسارات ومواقع الوب. لكن هناك استثناءات، مثل عناوين الوب أو المسارات التي تشير إلى مواقع أو وثائق بعدة لغات، ففي هذه الحالة يمكن تغيير المسار ليشير إلى الإصدارة باللغة المستهدفة، إن وُجدت.

source: We mentioned <f0>brand names</f0><f1> and </f1><f2>product names</f2><f3> on page </f3><f4><bf5>20</bf5></f4><f6>. Ensure that you know what the appropriate handling of these are in your translation.</f6>
ar: ذكرنا من قبل <f0>العلامات التجارية</f0> و <f2>أسماء المنتجات</f2> في صفحة <bf5>22</bf5>. تأكد من إلمامك بالطريقة المثلى للتعامل مع هذه الأسماء في ترجمتك.

source: For some languages spreadsheet functions are translated. You should know if this is the case in your language.
ar: بعض اللغات تترجم فيها الدَّوَال الإحصائية و الرياضية في تطبيقات جداول العمل الممتدة، وعليك إن تعرف إن كان هذا مطبقا في لغتك في التطبيق موضوع الترجمة.

source: <f0>A slightly more obscure one, is references to </f0><f1>function calls</f1><f2> or other aspects of a network protocol, or programming or query language. Error messages sometimes mention the specific command that caused some error, and these should almost never be translated</f2><f3><t4/></f3><f5>. For example, spreadsheet software might refer to the COUNT() function – an entry in a spreadsheet cell to count something. There are two clues that this is a function – the fact that it is in capital letters and, and the two brackets after the word. Another clue to indicate that something should not be translated, is when some term is enclosed in quotation marks.</f5>
ar: وهناك أيضا <f1>الدوال البرمجية</f1> وغيرها من جوانب بروتوكولات الشبكات أو لغات البرمجة. يُذكر أحيانا في رسائل الأعطال اسم الأمر الذي نتج عنه العطل، وهذه الأوامر يجب في الأغلب الأعم ألا تترجم<f3><t4/></f3>. مثلا قد يشير تطبيق جداول العمل الممتدة إلى الدالة ‪COUNT()‬ (مدخلة في أحد خلايا الجدول لحساب المجموع). نرى تلميحان يشيران إلى أنها دالة؛ كونها مكتوبة بأحرف لاتينية كبيرة، وزوج الأقواس في نهايتها. وضع كلمة بين علامتين تنصيص قد يكون أيضا إشارة إلى أنها لا تترجم.

source: Incorrect range passed to <f0>COUNT()</f0>.
ar: مُرِّرَ مجالٌ غير صحيح إلى <f0>COUNT()</f0>.

source: Syntax error in <f0>SELECT</f0>.
ar: خطأ نحوي في <f0>SELECT</f0>.

source: Wrong number of arguments to <f0>printf()</f0>.
ar: عدد معاملات غير صحيح إلى <f0>printf()</f0>.

source: Network time-out during <f0>POST</f0>.
ar: انتهت مهلة الشبكة أثناء <f0>POST</f0>.

source: Invalid “<f0>errno</f0>” value.
ar: قيمة “<f0>errno</f0>” غير صحيحة.

source: Of course, there could be other reasons why something is written in capital letters or with quotation marks, but hopefully this will help to identify several cases.
ar: بالطبع قد توجد أسباب أخرى لكتابة كلمة بأحرف لاتينية كبيرة أو ضعها بين علامتي تنصيص.

source: Another thing that might be unfamiliar to many translators, is <f0>command-line options</f0><f1>. When a program is started by typing its name rather than clicking on an icon or menu, it is often possible to specify extra options to influence its behaviour. Although this is hidden from most users, documentation might refer to such options. These options should not be translated, since a translated version won’t be recognised by the program. Users therefore should see the untranslated option, even in translated documentation.</f1>
ar: مفهوم آخر قد يكون غريبا على مترجمين عديدين هو <f0>خيارات سطر الأوامر</f0>. فعند تشغيل برمجية بكتابة اسمها في سطر الأوامر (بدلا من النقر على أيقونة أو في قائمة) فمن الممكن عادة تمرير خيارات إضافية إليه للتحكم في مسلكه، و بالرغم من أن هذا محجوب عن معظم المستخدمين فإن وثائق الاستخدام قد تشير إلى هذه الخيارات. يجب ألا تترجم هذه الخيارات لأن البرمجية لن تتعرف عليها إلا في نصّها الأصلي (إلا إن كانت مُوطنّة في البرمجية ذاتها)، لذا يجب أن تتضمن الوثائق المترجمة الخيارات بنصِّها الأصلي.

source: See the program version by running with <f0>--version</f0>.
ar: لمعرفة رقم إصدارة البرمجية شغّلها مع <f0>--version</f0>.

source: In the case where an option can receive an <f0>argument</f0>, documentation referring to the argument can usually translate the argument, since it is usually just a place-holder for something else.
ar: في حال كانت الخيارات تقبل تمرير <f0>مُعامِلات</f0> إليها، فيمكن ترجمة الكلمة التي تشير إلى المُعامِل لأنها في العادة ليست إلا مثالا يوضح نوع المعامل و معناه.

source: Source text
ar: المصدر

source: Translation
ar: الترجمة

source: --playlist=<f0>SPEELLYS</f0>
ar: --playlist=<f0>قائمة استماع</f0>

source: --add-to=<f0>ARGIEF</f0>
ar: --add-to=<f0>أرشيف</f0>

source: There is a convention to write the argument in capital letters, which should help you to recognise it. Having the argument (such as “PLAYLIST”) translated should help the user to realise that the option (such as “--add-to”) should be used unchanged, and that the argument (the translated placeholder) should be changed to the relevant value. When other help text refers the argument, it is also customary to use it capitalised in a similar way. If your language doesn’t use capitalisation, you might want to put the argument in quotes to emphasise its role as a placeholder.
ar: جرت العادة في بعض مشروعات البرمجيات على كتابة المُعامِلات بأحرف لاتينية كبيرة مما يساعد على تمييزها. ترجمة مُعامِلٍ (مثل “PLAYLIST”) تنبه المستخدم إلى أن الخيار (مثل ‪“--add-to”‬) يجب أن يترك كما هو في حين عليه التعويض عن اسم المعامل بقيمة مناسبة. من المعتاد أيضا عند الإشارة إلى المُعامِل في مواضع أخرى من الوثائق أن يكتب بأحرف كبيرة، وفي اللغات التي لا توجد بها حروف كبيرة يمكن وضعه بين علامتي تنصيص لتمييزه عن باقي النص، أو تمييزه بصريا بوسيلة أخرى، مثل الأحرف المائلة إن أمكن.

source: Escaping is a way to represent special text. An escaped sequence consists of an escape marker followed by one or more reserved characters. Translators don’t need to work with this frequently, but it is good to be aware of them. The most common is the backslash (\) followed by a single letter. In most cases you will see from the original source text when these should be used, and in many cases you can follow the example of the source text closely.
ar: الخُلُوص وسيلة تقنية لإدراج محارف حاسوبية خاصة في النصوص؛ محارف ذات وظائف خاصة تمنع إدراجها في النصوص على النحو المعتاد بمجرد إدخالها من لوحة المفاتيح. يتألَّف تتابع الخلوص من علامة خلوص متبوعة بحرف أو أكثر من المحارف المحجوزة للاستخدامات الخاصة. مع أن المترجمين لا يحتاجون للتعامل مع هذا كثيرا إلا أن من الأفضل معرفته. أكثر الخلوص شيوعا الشرطة المائلة إلى الأمام (\) متبوعة بحرف واحد. في الأغلب سيوضح النص المصدر موضع هذه العلامات ليضعها المترجم في الموضع المقابل في الترجمة.

source: Types of escape characters
ar: أنواع محارف الخلوص

source: These <f0>escaped characters</f0><f1> have </f1>a special meaning:
ar: لهذه <f0>المحارف المُخلّصة</f0> معانٍ خاصة:

source: Escape sequence
ar: تتابع الخلوص

source: Effect
ar: أثره

source: Description
ar: وصفه

source: newline
ar: سطر جديد

source: A new line in the text (similar to pressing Enter). It might be shown with the ¶ in your translation program.
ar: يبدأ سطرا جديدا (مماثل لضغط زر الإدخال). قد تمثِّله أداة الترجمة بالرمز ¶.

source: tab
ar: جدولة

source: Add a tab marker at that point in the text. This is sometimes used to align text in columns.
ar: يُدخل علامة جدولة في هذا الموضع من النص. يستخدم هذا أحيانا لمحاذاة النصوص في أعمدة.

source: carriage return
ar: الرجوع (إلى أوّل السطر، كالآلة الكاتبة)

source: This is usually used together with \n in software for Windows.
ar: عادة ما يُزاوج هذا مع ‪\n‬ في نظام وندوز عند كل سطر جديد، بينما يُستخدم بدلا منه في نظام ماكنتوش.

source: real backslash
ar: الشرطة مائلة للأمام ذاتها.

source: If you need a real backslash then you need to escape the backslash. The computer will only print one backslash.
ar: لإدراج الشرطة المائلة للأمام بذاتها، فبما أنها محرف مخصص للخلوص، فطباعتها تتطلب خلوصا.

source: double quote (")
ar: علامة تنصيص مزدوجة (")

source: In some cases a double quote has a special meaning, and should be escaped if you really want a double quote.
ar: في بعض الحالات تكون لعلامة التنصيص المزدوجة معنى خاصا، وينبغي تخليصها إن أردنا إدخال علامة التنصيص ذاتها.

source: special character
ar: محرف خاص

source: Special characters like © or ™. Programmers might use \u to refer to the special character. Here xxxx is the hexadecimal or decimal value for the specific Unicode character. You probably want to leave it as is.
ar: أي محرف أو علامة خاصة مثل © أو ™. أحيانا يَستخدِم المبرمجون ‪\u‬ للإشارة إلى أي من المحارف الخاصة غير المعتاد طباعتها من لوحة المفاتيح، حيث xxxx هنا هو رقم عشري أو سِتَّعَشريّ يدل على رمز المحرف الخاص في يونيكود، وفي الغالب لا حاجة لتغييره.

source: apostrophe (')
ar: علامة تنصيص مفردة (')

source: In some <f0>XML</f0> documents, you might need to represent the apostrophe and some other characters with <f1>XML</f1> entities. For example:
ar: في بعض مستندات XML ترد علامة التنصيص المفردة وغيرها من العلامات باستخدام ما يسمى كيانات XML. مثل:

source: <a href=“index.html” title=“Rock <f0>&apos;</f0>n Roll”>link</a>
ar: <a href=“index.html” title=“Rock <f0>&apos;</f0>n Roll”>مربط</a>

source: What you see
ar: ما تراه

source: What it means
ar: معناه

source: What you do
ar: ما تفعل

source: The newline appears between two sentences. When the program runs the sentences will appear on different lines.
ar: سطر جديد بين جملتين. عند تشغيل البرمجية ستظهر كل جملة في سطر وحدها.

source: Put your \n escape in the same place between the sentences.
ar: أدخل ‪\n‬ في نفس الموضع بين الجملتين في الترجمة.

source: This is harder to recognise. There will be a line break between “or” and “other”.
ar: هذه يصعب تمييزها إذ سيوجد سطر جديد بين “or” و “other”.

source: Look at the structure of the whole translation. In this case the author is probably using newlines to balance the text (make the lines appear to be equal in length). Balance your translations in a similar way.
ar: تمعَّن في بنية الجملة كلها. هنا غالبا يُقصد بالسطر الجديد توزيع النص على السطور بتساوٍ، فقطِّ أسطر الترجمة بما يحقق ذات الغرض و يناسب اللغة المستهدفة.

source: You can usually just copy the escape character exactly as you see it. Check that you have <t0/>the same number of escapes as the original. If your language doesn’t use double quotes or single quotes like English, you can ignore those ( \" <s1/>\' <s2/>&apos; ). In the case of quotation marks, place the quotes around the same concept as in the English.
ar: عادة يتوجب نسخ محارف الخلوص كما هي دون تغيير، ولا تُغفِل التأكد من أن عدد تتابعات الخلوص الذي أدخلت في الترجمة يساوي عددها في المصدر. إذا كانت لغة الوجهة لا توظِّف بعض هذه الأحرف، مثل علامات التنصيص، أو تستعمل بدائل لها فيمكنك إما إهمالها أو وضع البديل المناسب للغة، الأقواس المحدبة مثلا.

source: Don’t unnecessarily change the escape. For example, do not use <f0>/n</f0> instead of <f1>\n</f1> just because you can't find <f2><f3>\</f3></f2> on your keyboard. Be careful for cases like “File \ Open \ New”. This is not escaping. If they are not in the list above, then they are most likely not escape characters. Also be careful to use the same spacing around the escape characters.
ar: لا تغير تتابع الخلوص دون سبب، فلا تضع مثلا <f0>‪/n‬</f0> بدلا من <f1>‪\n‬</f1> لمجرد أنك لا تجد \ على لوحة المفاتيح. انتبه للحالات مثل “File \ Open \ New” فهذا ليس خلوصا، وعموما كل ما ليس في الجدول أعلاه فهو في الأغلب ليس من الخلوص. انتبه كذلك لنقل توزيع المسافات ذاته حول تتابعات الخلوص.

source: HTML is used to create web pages. You will also see XML (which looks very much like HTML) in GUI translations. They are both examples of markup languages used to specify some information about text. Be aware of which parts of HTML you can safely translate and which you should leave unchanged. HTML is recognised by tags between angle brackets:
ar: يُستخدمُ HTML لإنشاء صفحات الوب، كما سيمر عليك كذلك XML (الذي يشبه HTML كثيرا) في ترجمات واجهات البرمجيات. كلاهما مثال على لغات الرَّقْم التي تُستخدم لهيكلة النصوص بنسق معين. انتبه إلى مقاطع النصوص في HTML التي يمكن ترجمتها والمقاطع التي يجب أن تُترك كما هي لأنها جزء من لغة الرَّقْم ذاتها. تتميز HTML بوسومها المحفوفة بقوسين زاويين، مثل:

source: A tag can also contain extra information:
ar: كما يمكن أن يحتوي الوسم على معلومات إضافية:

source: Here the img (image) tag contains an extra attribute to specify the file name of the picture to show. Furthermore, tags often occur in pairs:
ar: يحتوي وسم img (صورة) هنا على خصيصة إضافية تحدد اسم ملف الصورة. وقد تكون الوسوم في أزواج كذلك:

source: Note the difference between the opening and closing tag.
ar: لاحظ الفرق بين وسم الفتح ووسم الغلق.

source: What not to translate
ar: ما لا يُترجَم

source: Do not translate the actual tags. <f0>HTML</f0> consists of tags which indicate the start and end of a section of text. This text could be a heading, a paragraph, a hyperlink or just a piece of text to display in bold:
ar: لا تترجم الوسوم ذاتها. تتألَّف HTML من وسوم تحدد بداية ونهاية مقاطع من النص، قد يكون النصَّ عنوانا أو فقرة أو رابطا أو حتى جزءًا من النص سيعرض بتنسيق مغاير:

source: <f0><h1></f0>A heading<f1></h1></f1>
ar: <f0><h1></f0>عنوان<f1></h1></f1>

source: <f0><p></f0>A paragraph<f1></p></f1>
ar: <f0><p></f0>فقرة في النص<f1></p></f1>

source: <f0><a href=bob.html></f0>A hyperlink<f1></a></f1>
ar: <f0><a href=bob.html></f0>مربط إلى صفحة<f1></a></f1>

source: This is normal and <f0><b></f0>this is bold<f1></b></f1>
ar: نص عادي و <f0><b></f0>نص عريض<f1></b></f1>

source: Some markers just beg to be translated, such as these: <title>, <center>, <body>. Do not be tempted – these need to remain in English.
ar: بعض الوسوم تغري بترجمتها، مثل <title> و <center> و <body>، لكن تجب مقاومة الإغراء ولا تترجمها، و إلا لن تعمل.

source: Reordering or changing tags
ar: تغيير الوسوم أو ترتيبها

source: In some cases, it might be necessary to reorder the tags. If tags surround some text, it means that the translation representing the text inside the tags should probably also be surrounded with the same tags.
ar: يكون من الضروري أحيانا تغيير ترتيب الوسوم، تبعا لتغيّر ترتيب الجملة المترجمة عن ترتيب المصدر.

source: Some inline tags can represent something that should be positioned in the translation, such as an image or a footnote. Take care where you put this in the translation to have the same effect as the original text.
ar: بعض الوسوم تمثل عناصر ينبغي ظهورها في مواضع معينة في الترجمة، مثل صورة أو هامش، ويجب وضعها في الترجمة لتعطي نفس التأثير كما في المصدر.

source: Whenever you work with tags, always ensure that opening and closing tags go together in pairs, and that the closing tags always follow the opening tags.
ar: تأكد دوما أن وسوم الفتح والغلق تؤلف أزواجا متكاملة، وأن وسوم الغلق تأتي بعد وسوم الفتح.

source: Attributes – which to translate
ar: أي الخصائص تُتَرجَم

source: An attribute is extra information associated with a tag.
ar: الخصائص معلومات إضافية في متن الوسم.

source: Here “bgcolor” is an attribute and “blue” is its value. Attributes, like tags, are never translated. However some values can be translated. In the example above the value “blue” should not be translated.
ar: فهنا “bgcolor” خصيصة قيمتها “blue”. الخصائص مثلها مثل الوسوم لا تُترجم، لكن بعض القيم تنبغي ترجمتها. القيمة “blue” في المثال السابق يجب ألا تترجم.

source: There are only a few attributes of which the values can be translated:
ar: بعض الخصائص ينبغي أن تترجم قيمها:

source: Attribute
ar: الخصيصة

source: Meaning
ar: معناها

source: A textual description of a picture, often used in img (image) tags. This is essential for people with disabilities.
ar: وصف نصي بديل للصورة، أحيانا يؤلف جزءا من وسم img (صورة)، وهو مهم للأشخاص المعاقين أو للمتصفحات النصية و لتيسير البحث.

source: A text title that pops up when you hover something, exactly like a tooltip.
ar: عنوان يظهر عندما يمر مؤشر الفأرة على شيء ما، يشبه تماما بالونات تلميحات الأدوات في واجهة المستخدم.

source: In some cases you might also need to change the “lang” or “dir” attributes. This is best left to people with good knowledge of <f0>HTML</f0>.
ar: في بعض الأحيان قد تحتاج لتغيير صفتي “lang” أو “dir”، لكن من الأفضل ترك هذا لمن لهم خبرة في استخدام HTML.

source: Translatable text that looks like tags
ar: نصوص تشبه الوسوم لكن تنبغي ترجمتها

source: Some things that look like tags are not really tags and should be translated. For example: <Error>, <File not found>, etc.
ar: أحيانا تكتب بعض العبارات بحيث تبدو كالوسوم لكنها ليست في الحقيقة وسوما، وتنبغي ترجمتها، مثل <Error> أو <File not found> إلخ.

source: If you are experienced with <f0>HTML,</f0> you will immediately know which are real tags. If you don’t know, use this rule: If its all in lower case or upper case then it is very likely a tag. If it combines case, it is most likely not a tag. If it contains any attribute such as <font color=blue> it is definitely a tag. And lastly if it's the only text in the message like in “<None>” then it is most probably not a tag.
ar: إذا كانت لك خبرة في HTML فستميز الوسوم الحقيقية من غيرها بسهولة. إذا كنت لا تعرف فاتبع هذه القاعدة: إذا كانت كل الحروف صغيرة أو كل الحروف كبيرة فهذا على الأغلب وسم، أما إن كانت مختلطة فغالبا ليس وسما، إن كان يتضمن خصائص (مثل <font color=blue>) فمؤكد أنه وسم، وأخيرا إذا كانت هي الكلمة الوحيدة في الجملة (مثل “<None>”) فغالبا ليست وسما.

source: <f0>English adds </f0><f1><f2>s</f2></f1><f3> to the end of most words to form a plural. You will often see that a programmer simply added </f3><f4><f5>(s)</f5></f4><f6> to the word to indicate that it can be both singular and plural. Here is an example in Tsonga, in this case plurals add/change text at the beginning of the word, not the end. This often looks ugly.</f6>
ar: تُصاغ أغلب الجموع في اللغة الإنگليزية بإلحاق الحرف <f1><f2>s</f2></f1> بآخر الكلمة، وستجد كثيرا من المبرمجين يضيفون <f4><f5>(s)</f5></f4> إلى الكلمة للدلالة إلى أنها قد تكون مفردا أو جمعا حسب السياق و العدد قبلها. في اللغة العربية (على سبيل المثال) يصاغ جمع التكسير بتغيير أحرف الكلمة، فقد تضاف حروف أو تحذف من أي موضع في الكلمة، فلا يمكن اتبّاع النسق ذاته كما في الإنگليزية للجمع.

source: Kombisa/Fihla <f0>(ti)</f0>nhlamuselo ya tikhona
ar: أظهر\اخفِ (أ)وص‍(ا)ف المحور

source: Furthermore, the grammar in other parts of the sentence might need to agree with either the singular or the plural case, but can't agree with both.
ar: علاوة على أن صياغة مفردات أخرى في الجملة قد تتغير حسب الإفراد أو التثنية أو الجمع ولا يمكن تمثيل كل الحالات بصياغة واحدة.

source: Here are the options available to you to deal with these type of plurals:
ar: هذه بعض خيارات التعامل مع هذا النوع من الجموع:

source: If your language does not use plurals, you can just translate it disregarding the embedded plural.
ar: إذا لم تكن في لغتك جموع فترجم الجملة متجاهلا صيغ الجمع.

source: Contact the programmer and hear if it can be improved to use proper plurals (see page <bf0>33</bf0>).
ar: تواصل مع المبرمج للتباحث في إمكانية تطبيق أسلوب الجموع الصائبة (انظر صفحة <bf0>34</bf0>).

source: Use a similar construct if it works in your language.
ar: استعمل بُنية مماثلة لجموع الإنگليزية إن كان هذا يناسب لغتك.

source: Abandon the singular and use only the plural form. This is what is done in languages where the singular and plural look too different, and the brackets will just make the translation ugly.
ar: تجاهل الصيغة المفردة وترجم الجملة كما لو كانت جمعا. هذا ما يُستعمل في اللغات التي تختلف فيها صيغة الإفراد عن الجمع اختلافا كبيرا ولا يمكن فيها استعمال طريقة اللواحق\البوادئ في الأقواس.

source: Variables are placeholders for numbers or some text that will be filled into a message when the program is running. For the software to be able to show a message such as “There are 3 files remaining” it has to have a generic message that will also allow it to say “There are 4 files remaining”, “There are 5 files remaining”, etc. This often looks like this:
ar: المتغيرات رموز تحجز الموضع لعدد أو نص آخر يعوّض عنها به أثناء تشغيل البرمجية. لتستطيع البرمجيات عرض رسالة مثل “There are 3 files remaining” تحتاج إلى رسالة مُعمَّمة الصيغة يمكن استعمالها لعرض “There are 4 files remaining” و “There are 5 files remaining” إلخ. وقد تبدو تلك الرسالة كالتالي:

source: Here we see that “%d” is a variable that serves as a placeholder for the number that will be filled in later. There are many other ways in which the same effect can be achieved. Here are a few examples:
ar: الرمز ‪“%d”‬ هو المتغير هنا ووظيفته حجز موضع سيشغله العدد لاحقا. توجد صور أخرى تؤدي النتيجة ذاتها:

source: These are all equivalent and will appear the same way in the running program: something like “There are 2 files remaining”. In these examples, the variable always represents a number written in digits. The number will therefore never appear in words such as “There are two files remaining”. Keep the variable exactly unchanged and don’t be tempted to translate “number”.
ar: الصيغ السابقة كلها متماثلة وستنتج عنها عند تشغيل البرمجيةِ النتيجةُ ذاتها، شيئ مثل “There are 2 files remaining”. في كل تلك الأمثلة يمثل المتغير عددا يكتب بالأرقام، لا بالكلمات مثل “There are two files remaining”. اترك المتغير كما هو ولا تحاول ترجمة “number” في المثالين الثاني والرابع.

source: Variables can also be placeholders for other things, not just numbers. Here the variable is a placeholder for the name of a program to open a file with:
ar: لا تُستخدم المتغيرات للأعداد و حسب، ففي المثال التالي يستخدم المتغير ليحجز موضعا لاسم التطبيق:

source: which will display something like
ar: ستظهر شيئا مثل:

source: or
ar: أو

source: Sometimes programmers might comment on what the variable represents, or you might need to work it out from context. If the variable has a name (like “number” in some of the examples above) you will usually know exactly what will be filled in. It is useful to remember that “%d” will always represent a number written in digits, and that “%s” usually refers to some text string that will be filled in. Messages can contain more than one variable, and could mix number variables and string variables.
ar: أحيانا يضع المبرمجون تعليقا يوضح ما يمثله المتغير و أية تغيير مطلوب. إذا كان اسم المتغير ذا دلالة (مثل “number” في الأمثلة السابقة) فسيبين لك نوعه. من المفيد تذكُّرِ أن “‪%d‬” يمثل دوما عددا، بينما يمثل “‪%s‬” نصّا سيحل محلّه. يمكن أن تحتوي الرسالة على أكثر من متغير من أكثر من نوع.
