Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: For example: in cases where two terms are closely associated in English, such as “log in/log out” or “enable/disable” it is useful if your translated terms can translate back to such an associated term pair. Ideally your translations should form a similar associated pair. Also try to translate a positive action (such as “enable”) with a positive action, and a negative action (such as “disable”) with a negative action.
ar: مثلا: في حال كون مصطلحين مرتبطين في الإنگليزية مثل “log in/log out” أو “enable/disable” أو “previous/next” فمن المفيد المحافظة على العلاقة في الترجمة، مثل ”ولوج\خروج“ و ”تفعيل\تعطيل“ و ”السابق\اللاحق“.

source: As a localiser you will often see acronyms, abbreviations and brand names in the text. Acronyms and abbreviations are things like “<f0>e.g.</f0>”, “<f1>i.e.</f1>”, “<f2>SQL</f2>”, “<f3>FTP</f3>”. Brand names include the names of products, companies and some technologies, such as “<f4>Firefox</f4>”, “<f5>OpenType</f5>”, “<f6>Google</f6>”, “<f7>Windows</f7>” and “<f8>iPhone</f8>”.
ar: كثيرا ما تمر عليك أثناء الترجمة اختصارات مثل “<f0>e.g.</f0>” و “<f1>i.e.</f1>” و “<f2>SQL</f2>” و “<f3>FTP</f3>”، وأسماء منتجات مثل “<f4>Firefox</f4>” و “<f5>OpenType</f5>” و “<f6>Google</f6>” و “<f7>Windows</f7>” و “<f8>iPhone</f8>”.

source: Since some of these don’t form part of normal conversational language, it might seem as if the only solution is to leave them unchanged as they occur in the source text. This will often be the correct decision, but let us be aware of a few of the issues.
ar: بعض تلك المصطلحات ليست جزءا من اللغة المحكية ولذا قد يبدو الحل الوحيد لها تركها كما هي، أحيانا يكون هذا أفضل اختيار، لكن علينا الانتباه لبضعة أمور.

source: Your language might have established translations for abbreviations like “etc.”. However, many languages don’t have a writing tradition of abbreviation. You might want to simply translate some abbreviations in full form. If the abbreviation is the name of a technology, such as “<f0>XML</f0>” it is often best left unchanged, since the target audience might know what it is, and only know this name. In document translation (such as help files or web sites) you might have space to also add a translated name for reference, but in software you will probably not have enough space to do that.
ar: قد يكون لبعض الاختصارات مقابلات متعارف عليها في اللغة الوجهة، مثل الإنگليزية “etc.” التي تقابل في العربية ”إلخ“. لكن بعض اللغات لا تعرف الاختصارات المكتوبة مطلقا، كما أنه ليست لكل الاختصارات مقابلات في كل اللغات، وسيكون عليك في هذه الحالة ترجمة المصطلح بغير اختصار، لكن إن كان الاختصار اسما لتقنية ما (مثل “<f0>XML</f0>”) فمن الأفضل تركه كما هو إذ قد لا يعرفه الجمهور المستهدف إلا بهذا الاسم المختصر، لكن في ترجمة المستندات (مثل ملفات المساعدة أو صفحات الوب) حيث لا قيود على طول النص (على عكس الحال في واجهات البرمجيات) تمكن إضافة ترجمة المصطلح لمزيد من التوضيح، حسب الجمهور المستهدف، فلست تريد أن تكرر على قارئ متخصص ما يعرفه سلفا.

source: Some companies and products might have local names in your language, and it might be appropriate to use them. On the other hand, some names may be trade marks, and you might not be allowed to change them. Special exceptions are sometimes made for languages that don’t use the Latin script, such as Japanese and Arabic. It is always best to ask in this case.
ar: قد تكون لبعض الشركات والمنتجات أسماء بلغتك تستعملها محليا، و عندها قد يكون من الأنسب إيرادها. في المقابل بعض الأسماء علامات تجارية مسجلة وليس مسموحا بتغييرها. لكن أحيانا تكون استثناءات خاصة للغات التي لا تكتب بالأحرف اللاتينية، مثل العربية واليابانية، وفي هذه الحالة من الأفضل السؤال للتأكد.

source: Some product names are plain words, and you might even be encouraged to translate them. Don’t blindly keep the original name of the software if it might be intended to be understandable in your language and readable in your script. Utility applications like the calculator and text editor are often referred to by general words – not names associated with the specific application.
ar: بعض أسماء المنتجات كلمات عادية وقد تكون ترجمة معانيها محبّذة، لذا إن كان الغرض من الاسم أن يكون مفهوما ويعبر عن وظيفة البرمجية فمن الأفضل ترجمته. الأدوات مثل برمجية الحاسبة ومحرر النصوص يشار إليها غالبا بكلمات عامة دالة على الجنس وليس بأسماء مخصصة.

source: Always take care to follow the capitalisation of the original product name. Using capitalisation in unusual places (or not at all) might be part of the brand identity of the company or product.
ar: إن كنت ستنقل الاسم كما هو بالأحرف اللاتينية فانتبه إلى استعمال الأحرف الكبيرة والصغيرة، ففي بعض أسماء المنتجات قد يكون نمط غير معتاد لحالة الأحرف في أسماءها يشكل جزءا من العلامة التجارية، و المحافظة عليه تسهَّل للقارئ التعرف على الاسم باللمح، خاصة إن كان لا يجيد قراءة الأحرف الأجنبية، كأنه صورة.

source: Transliteration
ar: النقحرة

source: If your language doesn’t use the Latin script (like Chinese or Arabic), a policy on transliteration will be useful. Here are some guidelines that might help your team:
ar: إذا كانت لغتك لا تُكتب بالأحرف اللاتينية (مثل العربية أو الصينية) فمن المهم وضع سياسة للنقحرة. هذه بعض المعايير التي يمكن الاستعانة بها:

source: If the name is a word explaining what it does, simply translate the name.
ar: إذا كان الاسم كلمة عادية تُوضِّح وظيفته أو دالة على جنس فالأفضل ترجمته.

source: If the name is obscure or very technical in nature, you can consider using it without transliteration if it doesn’t occur very often.
ar: إذا كان الاسم لمنتج غير شائع أو مصطلح تقني قليل التكرار فقد يكون من الأفضل تركه بالحروف اللاتينية كما هو ما دام لا يكثر وروده في الترجمة.

source: If the name has no obvious meaning, transliterate the pronunciation of the name. If this is too long for an acronym (such as HTML), you might want to transcribe each letter with an equivalent letter in your script, possibly separating them with dots or spaces if it might be confused with a word.
ar: إذا لم يكن للاسم معنى واضح فالأفضل تعريب كتابته صوتيا حسب النطق في لغته الأم (لاحظ مثلا أن لا معنى لنقل اسم إسباني بالنطق الإنگليزي)، لكن إن كان اختصارا ومنطوقه كلمة طويلة (مثل HTML) فقد يكون من الأفضل استبدال كل حرف لاتيني بأقرب حرف له في لغتك، إما متصلين أو منفصلين بنقط أو مسافات أو علامات فصل الأحرف إذا كان اتصال الأحرف يصعب القراءة أو يتشابه مع كلمة في لغتك.

source: A good dictionary can be very useful for your work. However, it can be cumbersome to look up words very often. Furthermore, someone might not know when it is important to check in a dictionary and could make incorrect assumptions.
ar: رغم أن وجود معجم جيِّد يفيد للغاية أثناء الترجمة، إلا أن تكرار النظر في المعجم أثناء الترجمة قد تكون مرهقة، وفي بعض الأحيان لا يعلم المترجم متى يراجع المعجم و قد يبني ترجمته على افتراضات خاطئة عن دلالات الكلمات.

source: If a translation tool provides terminology assistance, it can be a great help, since the translators can check the prescribed terminology more often, and might be confronted with it even when they didn’t consider checking. It should also make it easy to insert a term without typing, which can save time and avoid typing errors.
ar: إن كانت أداة الترجمة تدعم استخدام مسارد المصطلحات فسيساعد هذا المترجم على النظر في مسرد المصطلحات كما قد تدفعه إلى مراجعة المصطلحات التي غفل عنها. كما قد يساعد أيضا على إدراج ترجمة المصطلح دون الحاجة لكتابتها وهذا قد يوفر الوقت ويتفادى الأخطاء الإملائية.

source: Pootle can host a terminology project on the server with project specific terminology lists. For more information see page <bf0>42</bf0>.
ar: يمكن لبُوتِل استضافة مشروع مصطلحات على الخادوم يحوي مسارد مصطلحات تخص مشروع ترجمة معين. طالع صفحة <bf0>42</bf0> لمزيد من التفاصيل.

source: Virtaal can provide terminology suggestions from multiple sources, including terminology files on your computer, and certain network based services. It also provides easy access to look up phrases on websites. For more information see page <bf0>40</bf0> and the Virtaal preferences.
ar: يدعم فِرتال إظهار مقترحات للمصطلحات من عدة مصادر، بما فيها ملفات المصطلحات في الحاسوب، و خدمات خاصة عبر الشبكة. انظر صفحة <bf0>40</bf0> لمزيد من المعلومات.

source: Reuse
ar: إعادة الاستخدام

source: During translation, a translator creates valuable information – terminology and translations that can be useful later when translating something similar. Being able to reuse previous work is a crucial part of becoming more productive, and ensuring good consistency between different versions of a product, and between different products.
ar: يُنتِج المترجمُ أثناء عمله حصيلة قيمة من المصطلحات والترجمات التي يمكن أن تفيد في ترجمات مشابهة. القدرة على الاستفادة لاحقا من هذا العمل عنصر مهم في زيادة الإنتاجية، كما تضمن اتساق الترجمة بين المنتجات المختلفة أو الإصدارات المختلفة من نفس المنتج.

source: Here you can see how similar translations can be shown to a translator during translation.
ar: يظهر هنا مثال على عرض الترجمات المشابهة للمترجم أثناء الترجمة.

source: Storing and reusing previous translations is called <f0>translation memory</f0><f1>. This is different from terminology in that complete translations or sentences are handled, and software might provide a suggestion even if it isn’t quite the same as what you are translating. So while whole words might be wrong in the suggestion, it provides a way to save a lot of typing, and ensures a consistent sentence structure between similar translations.</f1>
ar: يسمى حفظ الترجمات السابقة وإعادة استخدامها <f0>ذاكرة ترجمة</f0>. يختلف هذا عن مسرد المصطلحات في أن ذاكرة الترجمة تتعامل مع جمل كاملة، كما أنها تعرض اقتراحات على المترجم حتى لو لم تتطابق النصوص المصدر. فحتى لو كانت كلمات برمتها في الاقتراح غير مناسبة، فإن اقتراحات ذاكرة الترجمة توفر الكثير من الكتابة، كما تضمن توحيد بنية العبارات بين الترجمات المتشابهة.

source: Any existing translations of sufficient quality should normally be considered for reuse. You might want to give preference to related translations, such as those for the desktop environment you are translating for. For example, you might prefer GNOME translations when translating a GNOME application, rather than KDE translations. In reality the style of translations between different desktop environments won’t differ substantially for most languages, and you will probably benefit from using all available translations in your translation memory.
ar: أي ترجمة موجودة ذات جودة مناسبة يجب اعتبار إعادة استخدامها. قد تفضل استعمال الترجمات الأقرب، فمثلا إذا كنت تترجم أحد مشروعات گنوم فقد تفضل ترجمات گنوم على ترجمات كدي، لكن في العادة لا تتباين أساليب الترجمة كثيرا بين المشروعات المختلفة في أغلب اللغات وبالتالي ستستفيد من وجود كل الترجمات السابقة في ذاكرة الترجمة.

source: Short messages are more likely to be ambiguous. Translations consisting of single terms such as “view” and “alert” probably have different translations depending on context. Even longer entries like “Empty trash” is ambiguous (it could describe the state of the trash, or be a command to make the trash empty). Blindly reusing old translations in <t0/>cases like these are obviously dangerous. All reuse of existing translations should be reviewed to ensure that they are suitable for the current application in terms of style and terminology. Reviewing the suggestions might also provide an opportunity to find errors that might exist in previous translations. Use the opportunity to fix the original source of the error if a suggestion contains a mistake.
ar: يكون اللبس أكثر في النصوص الموجزة، فالرسائل من كلمة واحدة مثل “view” أو “alert” قد تختلف ترجمتها حسب السياق، وحتى النصوص الأطول مثل “Empty trash” ليست واضحة كفاية (قد تكون تقريرا لحال سَلّة المهملات الفارغة، أو أمرا لإفراغ سلة المهملات)، لذا يجب الانتباه عند إعادة استخدام ترجمات مثل هذه. أي إعادة استخدام لترجمات سابقة يجب مراجعتها للتأكد من مناسبتها من ناحية الأسلوب والمصطلحات، وقد تساعد هذه المراجعة في اكتشاف أخطاء في الترجمات السابقة وعليك الاستفادة من هذه الفرصة لتصويب الخطأ في مصدره.

source: The most important source of translation memory, is any existing translations for the project you are working on. You also want to combine any translations for the software, help files, web site, etc. to speed up your work and ensure better consistency.
ar: الترجمات السابقة للمشروع الذي تعمل عليه هي أهم مصدر لذاكرة الترجمة. كما تستطيع جمع ترجمات الواجهة وملفات المساعدة وصفحات الوِب و غيرها معا لتسريع العمل وضمان اتساقه.

source: Next you should look for files of related applications. Files from the same desktop environment (such as GNOME or KDE) is easily available for reuse. This is one of the powerful aspects of FOSS localisation – you can usually easily get existing work.
ar: تليها ترجمات البرمجيات ذات العلاقة، مثل برمجيات بيئة سطح المكتب ذاتها التي تنتمي إليها (مثل گنوم مقابل كدي) وهي متاحة بسهولة، و سهولة الوصول إلى العمل السابق هو أحد مميزات الكبيرة لتوطين البرمجيات الحرة.

source: Next you might want to look for translations of similar programs. If you are translating an e-mail program, look for translations of other e-mail programs to use. If you are translating a graphics editor, maybe translations from a picture viewer will provide some help.
ar: تأتي في المرتبة التالية ترجمات البرمجيات المشابهة، فإذا كنت تترجم برمجية للبريد الإلكتروني انظر ترجمات برمجيات البريد الإلكتروني الأخرى، أو إذا كنت تترجم محرر صور فقد تمكنك الاستفادة من ترجمة عارض صور، وهكذا.

source: Finally you can also consult existing services where many translations are collected:
ar: أخيرا تمكن الاستعانة بالخدمات التي تجمّع الترجمات:

source: Open-Tran.eu collects translations from several FOSS projects and provides a website to access it. It is also integrated in some translation tools such as Virtaal.
ar: يجمّع Open-Tran.eu ترجمات العديد من مشروعات البرمجيات الحرة، ويوفر موقعا للبحث فيها، كما تدعم استخدامه بعض أدوات الترجمة مثل فِرتال للبحث عن اقتراحات.

source: Microsoft also has a website for their translation memory. Be sure to review the terms of use, and remember that there might be different conventions in the FOSS world in terms of style and terminology.
ar: تُوفر ميكروسوفت أيضا موقعا لذاكرة الترجمة. لا تنسَ مراجعة هذه الاقتراحات والانتباه إلى الاختلافات بين أسلوب الترجمة في ميكروسوفت والأساليب والمصطلحات المتعارف عليها في البرمجيات الحرة.

source: The best ways to access existing translations is different for each project, and might change over time. Here are a few useful tips that might save you some time:
ar: تختلف الطريقة الأمثل للوصول إلى الترجمات السابقة من مشروع لآخر وقد تتغير مع الوقت. هذه بعض الملاحظات المفيدة التي قد توفر عليك بعض الوقت:

source: GNOME
ar: گنوم

source: Existing translations of GNOME is easily available from the website at <a0>http://l10n.gnome.org</a0> – also known as Damned Lies. Find your language, and select any release set from the list. A link at the bottom of the page provides an archive with all the latest translations.
ar: يمكن الوصول إلى ترجمات گنوم بسهولة عبر موقع <a0>http://l10n.gnome.org</a0> والمعروف باسم “الأكاذيب اللعينة”. ابحث عن لغتك ثم أختر أيا من أطقم الإصدارات من القائمة، يوجد رابط في أسفل الصفحة لتنزيل أحدث نسخة من كل الترجمات.

source: KDE
ar: كدي

source: Existing translations of KDE is easily available from the website at <a0>http://l10n.kde.org/</a0>. Find your language team. A link under the section “Archives” provides an archive with several files, including translations in the “messages” directory.
ar: يمكن الوصول إلى ترجمات كدي بسهولة عبر موقع <a0>http://l10n.kde.org/</a0>. ابحث عن فريق ترجمة لغتك، وستجد رابطا في فقرة “الأرشيفات” لتنزيل ملفات الترجمة.

source: Debian
ar: دِبيان

source: The Debian project develops several pieces of software, such as the Debian Installer and the ISO codes package (with translations of language and country names). A single file with the translation memory of all projects developed by the Debian project is available here:
ar: يطوّر مشروع دبيان العديد من البرمجيات مثل أداة تنصيب دبيان وحزمة رموز أيزو (تحتوي على ترجمات لأسماء الدول واللغات). يمكن الحصول على ملف يحوي ذاكرة ترجمة كل المشروعات التي تطورها دبيان، من:

source: Translations of almost all packages distributed with the Debian project is available here:
ar: كما تتوفر ترجمات غالبية الحزم التي يوزعها مشروع دبيان، في:

source: Although it might be better to obtain translations from the specific projects directly, getting them here might be more convenient, while possibly being a bit out of date.
ar: من الأفضل الحصول على ملفات ترجمة كل مشروع مباشرة من موقعه، لكن الوصول إليها جميعا هنا قد يكون أسهل وإن كان من المحتمل ألا تكون هي أحدث نسخة من الترجمة.

source: Pootle servers
ar: خواديم بوتل

source: Pootle is used to manage the translations of many projects such as OpenOffice.org, and you can usually obtain the translations easily from a Pootle server.
ar: يُستخدم بوتل لإدارة ترجمة العديد من المشروعات ، منها أوبن​أوفس، ويمكن الحصول على الترجمات من خادوم بوتل بسهولة.

source: Visit the page for your language in a specific project on the server, and go to the “Translate” tab. You should see a link to download a ZIP file with all the files inside. If it isn’t visible, you might need to log in, or ask for permission from the site administrator.
ar: اذهب إلى صفحة لغتك في مشروع ما على الخادوم، و منها إلى لسان “ترجم” وسترى روابط لتنزيل ملف مضغوط يضم كل ملفات الترجمة. إذا لم تر هذا الرابط فقد يتوجب عليك الولوج إلى الخادوم أولا أو طلب صلاحيات التنزيل من مدير الموقع.

source: Mozilla
ar: موزيلا

source: The current Mozilla localisation process makes it non-trivial to obtain translations, although they are usually available through Open-Tran.eu. While no official source of translation memory is available, unofficial translation memories are published in TMX format. It isn’t clear which products are involved, and how accurate they would be for languages without official product releases, or during the development phases of upcoming versions of Mozilla projects:
ar: صيرورة التوطين الحالية في موزيلا تُصعِّب الوصول إلى الترجمات السابقة، وإن كانت متاحة عبر Open-Tran.eu. لا تتوفر أي ذاكرة ترجمة رسمية، لكن توجد ذواكر ترجمة غير رسمية منشورة بنسق TMX، وإن كانت المنتجات التي تشملها ذواكر الترجمة هذه غير محددة، ولا تُعرفُ دقتها فيما يتعلق باللغات التي لم تصدر رسميا أو أثناء مراحل تطوير الإصدارات المستقبلية من مشروعات موزيلا:

source: If you maintain your Mozilla translations in PO format using the Translate Toolkit (see page <bf0>9</bf0>), you can easily reuse your translations in the PO files.
ar: إذا كنت تستخدم نسق PO في ترجماتك لمشروعات موزيلا (باستخدام عُدة الترجمة، انظر صفحة <bf0>9</bf0>) فيمكنك إعادة استعمال الترجمات من ملفات PO بسهولة.

source: Collection of translation files
ar: تجميع ملفات الترجمة

source: If you have some translation files and want to combine them into a single file as a translation memory, you can use some tools from the Translate Toolkit to do that. With <a0>pocompendium</a0> there are several options for customisation (for how to handle accelerators, for example) and with <a1>po2tmx</a1> you can create a translation memory file in TMX format used by some translation tools.
ar: إذا كان لديك ملفات ترجمة تريد جمعها في ملف واحد وتحويلها إلى ذاكرة ترجمة، فيمكنك استخدام بعض من أدوات عُدّة الترجمة. يمكن تخصيص أداة <a0>pocompendium</a0> عبر عدة خيارات (مثل كيفية التعامل مع المسرعات) ويمكنك استخدام <a1>po2tmx2</a1> لبناء ذاكرة ترجمة بنسق TMX الذي تستخدمه بعض أدوات الترجمة.

source: For translations in other formats than the popular Gettext PO, there might be converters in the Translate Toolkit (see page <bf0>9</bf0>).
ar: كما قد تجد في عُدّة الترجمة أدوات للتحويل من أنساق الترجمة الأخرى غير نسق جِتتِكست الشائع (انظر صفحة <bf0>12</bf0>).

source: <f0>Machine translation</f0> refers to translation suggestions automatically generated by software. It is often based on some rules of how to translate between languages or a big collection of existing translations. Suggestions from machine translation software could be unnatural, inaccurate and contain grammar errors. It should be said very clearly that <f1>machine translation can’t replace human translators</f1>, but are sometimes useful to help translators save time. In reality some machine translation services can provide very useful results in certain cases, although results vary a lot between different languages and topics.
ar: <f0>الترجمة الآلية</f0> هي ترجمة يولدها الحاسوب آليا. عادة ما تعتمد هذه الترجمة على قواعد للترجمة بين اللغات المختلفة أو على متن ضخم من الترجمات السابقة. يمكن أن تكون مقترحات الترجمة الآلية غير طبيعية وغير صحيحة وبها أخطاء إملائية ولغوية، لذا نقول بوضوح أنه <f1>لا يمكن الاستعاضة بالترجمة الآلية عن المترجم الآدمي</f1> ،لكنها وسيلة يمكن أن تُساعد المترجم في عمله لاختصار بعض وقت البداية. بعض خدمات الترجمة الآلية تعطي مقترحات مفيدة في حالات معينة، وإن كانت جودة الترجمة تختلف كثيرا من لغة لأخرى ومن موضوع لآخر، فتحديد مدى ملائمة مُخرجات مترجم آليّ ما راجع إلى تقدير الفريق.

source: By contrast, suggestions from a translation memory is the result of software suggesting previous work done by human translators. It might be a translation of a different piece of text, and translation software should indicate the difference between your current source text and the source text of the suggestion. Virtaal highlights these differences to help make a judgement of how relevant a suggestion is and where it should be edited.
ar: في المقابل فإن الاقتراحات من ذاكرة الترجمة مصدرها دوما ترجمة سابقة لمترجم آدمي، أيا كانت جودتها. قد تكون ترجمة نصٍّ مختلف و على برمجية الترجمة إبراز الاختلافات بين المصدر الذي تترجمه والمصدر الذي بُني الاقتراح عليه. يبرز فِرتال هذه الاختلافات ليساعد في الحكم على مدى مناسبة الاقتراح وأي أجزائه ينبغي تعديلها.

source: Whereas a translation memory will not always have relevant suggestions, machine translation software might always be able to provide some suggestion, even if it is not very good. In some cases it might require less editing to use a suggestion from machine translation software than editing a less relevant suggestion from translation memory. Human judgement is required in both cases to review the usefulness of a suggestion and to correct any possible errors.
ar: لكن بينما قد لا تحتوي ذاكرة الترجمة دوما على اقتراح مناسب فإن الترجمة الآلية بوسعها دوما اقتراح ترجمة لأي نص، حتى ولو لم يكن اقتراحا جيدا. أحيانا يكون تحرير الترجمة الآلية لتصبح مناسبة أسهل من تحرير اقتراح من ذاكرة الترجمة لا يتعلق كثيرا بالنص موضوع الترجمة. الأمر متروك لتقدير المترجم ليحدد أي الاقتراحات أفضل وليصحح أي خطأ فيها.

source: Many people are pessimistic about the usefulness of machine translation, and caution in this area is required. It is important for users of machine translation to understand the limitations and to realise that using these suggestions might desensitise them to the proper style required for their language. However, machine translation can be a big help, especially for users who can’t type fast.
ar: كثيرون لا يثقون في جودة الترجمة الآلية، لذا يجب الانتباه عند التعامل معها. من المهم أن يعي مستخدمو الترجمة الآلية قصورها وأن الاعتياد على تلك الترجمة قد يقلل من قدرتهم على اتباع الأساليب اللغوية الصحيحة، لكن في ذات الوقت قد تكون الترجمة الآلية عونا كبيرا خاصة لمن لا يستطيع الكتابة سريعا.

source: Virtaal can provide suggestions from multiple sources. It can give suggestions from the current file, previously saved translations, and certain network based services. Some of these might be translation memory, and some of these might be machine translation. Make sure that you understand the value and characteristics of each source of suggestions. For more information see page <bf0>41</bf0> and the Virtaal preferences.
ar: يستطيع فِرتال عرض مقترحات من أكثر من مصدر، بما فيها الملف الحالي و الملفات التي سبق تحريرها وحفظها، ومن بعض الخدمات على الشبكة. بعض تلك المصادر الشبكية هي ذواكر ترجمة وبعضها ترجمات آلية، لذا تنبغي معرفة نوع كل مصدر و خصائصه لتقيّم اقتراحاته. انظر صفحة <bf0>41</bf0> لمزيد من المعلومات.

source: Technical issues
ar: مسائل تقنية
