Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: Because variables sometimes give special meaning to certain characters, you might need to use an unusual way if you really want this character in your translation. In some of the examples above, the percentage sign (%) is used at the start of a variable. This is part of the variable and disappears when the program is running. If you really want a percentage sign to show, you have to use the special placeholder “%%” which will display as a single percentage sign in the translated program. This is similar to escaping that was discussed on page <bf0>29</bf0>.
ar: أحيانا تعطي المتغيرات معان خاصة لبعض المحارف، فإذا رغبت في إيراد هذه المحارف في نص الترجمة فتنبغي كتابتها بصورة معينة هي نوع خاص من الخلوص. في بعض الأمثلة أعلاه استُخدمت علامة النسبة المئوية (%) كبداية لأسماء المتغيرات، و هي جزء من اسم المتغير لذا لن تظهر عند تشغيل البرمجية، فإذا رغبنا في إظهار رمز النسبة المئوية في الترجمة فعلينا كتابة “%%” لتظهر علامة نسبة مئوية واحدة أثناء تشغيل البرمجية.

source: This message will display something like “The download is 40% complete” or “The download is 100% complete” with a single percentage sign shown to the user. In your translation, you have to realise that the “%d” is the placeholder for the numeric value (such as 40 or 100 in the examples above), and that the “%%” represents the single percentage sign in the translated software.
ar: ستظهر هذه الرسالة نصا مثل “The download is 40% complete” أو “The download is 100% complete”. عليك الانتباه إلى أن ‪“%d”‬ متغير لقيمة عددية (مثل 40 أو 100 في المثال السابق) بينما تمثل “%%” علامة نسبة مئوية واحدة في الترجمة.

source: If you are unsure how to deal with these cases, don’t worry: they are rare and a programmer for the project should be able help you.
ar: لا تقلق إذا لم تعرف كيف تتعامل مع هذه الحالات فهي نادرة وتستطيع سؤال مطوري المشروع المساعدة حينها.

source: There are a few important things to keep in mind here:
ar: بعض الأمور التي ينبغي الانتباه إليها:

source: The variable itself should not be translated or changed in any way, unless you really know what you are doing. Make sure that you know which characters are part of the variable that needs to be kept in your translation.
ar: يجب عدم ترجمة اسم المتغير نفسه أو تغييره على أي نحو إلا إن كنت متأكدا مما تفعله. يجب أن تكون قادرا على تمييز المحارف التي تؤلِّف اسم المتغير من النص المحيط بها.

source: It is your responsibility to move the variable in your translation to the correct position in the message to ensure that it will read naturally and correctly in your language. You might also need to adapt other parts of the translation with reference to what will eventually replace the placeholder. Don’t follow the word order of the original sentence blindly.
ar: عليك وضع المتغير في الموضع المناسب له في الترجمة لتظهر الرسالة المترجمة طبيعية حسب قواعد اللغة، وقد تحتاج لضبط نص الترجمة ليناسب ما سيُعوَّض به عن المتغير، فلا تتبع ترتيب الكلمات في النص المَصدَر حرفيًا.

source: When there is more than one variable in the string, you might need to reorder them. Variables with names can usually be reordered and positioned freely, whereas symbolic variables (like “%d” or “%s”) might need to be handled with more care, or might not allow reordering.
ar: إذا تعددت المتغيرات فقد يتطلّب الأمر تغيير ترتيبها. المتغيرات ذات الأسماء يمكن ترتيبها بلا قيد، لكن المتغيرات الرمزية (مثل “‪%d‬” أو “‪%s‬”) تتطلب معاملة خاصة وأحيانا لا يمكن تغيير ترتيبها عمّا في المصدر.

source: Since variables might contain things unusual to your language, such as file names or untranslated error messages, consider surrounding a variable with quotation marks if this is a good way to indicate the unusual text in your language.
ar: أحيانا ما تشير المتغيرات إلى أشياء غير معتادة مثل بعض رسائل الأعطال غير المترجمة أو أسماء الملفات، لذا قد ترغب في إحاطتها بعلامتي تنصيص إذا كانت هذه طريقة مناسبة لتمييز النصوص غير المعتادة في لغتك.

source: There are many smaller issues related to variables. Read more in the section on “<bf0>Advanced handling of variables</bf0>” on page <bf1>36</bf1>, and also this article:
ar: توجد مسائل أخرى ثانوية متعلقة بالمتغيرات، طالع قسم “<bf0>التعامل المتقدم مع المتغيرات</bf0>” في صفحة <bf1>37</bf1>، وكذلك هذه المقالة:

source: Programs do have the ability to handle plurals correctly. When the application runs it will determine which plural form to use based on the number that is being displayed. So in English it would display:
ar: للبرمجيات القدرة على التعامل الصحيح مع صيغ الجمع. تحدد البرمجية أثناء تشغيلها أي صيغ الجمع يُستعمل بناء على العدد الذي سيُعرض، مثل قواعد المعدود في العربية. فمثلا سيعرض بالإنگليزية:

source: etc.
ar: إلخ.

source: Here you see that the text is different depending on the number of items. Languages will vary the word form depending on the number in different ways. You need to know exactly how this works in your language for all numbers. In the case of English, the translation is stored as two strings – one for the singular case (“1 file”) and one for the plural case (“files” – all numbers except 1).
ar: فكما ترى تغيَّر التمييز طبقا لعدد العناصر. في أغلب اللغات يختلف تمييز العدد طبقا للعدد وعليك معرفة القاعدة المطبقة في لغتك بدقة. في الإنگليزية، توجد حالتان؛ حالة للمفرد (“1 file”) وأخرى للجمع (“files”، أي رقم عدا 1).

source: Notice how the noun is different, and the grammar adapts to agree with the noun (“was” / “were”).
ar: لاحظ الاختلاف في تمييز العدد بين الحالتين وفي بنية الجملة كذلك (“was” و “were”).

source: If your language does not have plurals, you will simply translate the two English strings with one string. This is common for some languages in Asia. If your language uses singular and plural nouns like English, you will make a translation of the two strings by also entering two strings – one with the singular and one with the plural. If your language uses more than two noun forms, a separate string for each noun form should be entered to allow a correct message to be displayed to the user depending on the number of things mentioned.
ar: في اللغات التي ليست فيها صيغة للجمع ستُترجم كل من الجملتين بالجملة المقابلة ذاتها، وهذا شائع في بعض اللغات الآسيوية. في اللغات التي فيها قاعدة مطابقة للإنگليزية ستُترجم كل جملة بجملة مقابلة لها (واحدة للمفرد وواحدة للجمع). أما في اللغات التي فيها أكثر من حالتين فستتضمَّنُ ترجمَتُها جملةً لكل حالة حسب العدد طبقا للقواعد اللغوية.

source: Since an unknown number of things are involved, proper plural messages always make use of variables (see page <bf0>32</bf0>). In the example above, the variable “%d” represents the unknown number. Always remember what the placeholder stands for, and consider reordering things in the sentence to correctly reflect your language.
ar: دائما ما تحتوي صيغ الجموع الصائبة على متغيرات (انظر صفحة <bf0>32</bf0>) لأن العدد لا يكون معلومًا سلفًا وقت صياغة العبارات، ففي المثال السابق يُمَثَّل المتغير ‪“%d”‬ عددا مجهولا. انتبه دوما لما يُمَثِّله المتغير ولا تنسَ ترتيب الجملة لتكون اللغة طبيعية.

source: On rare occasions programmers might ask you for more information about how plural forms work in your language. The following page probably contains what is needed:
ar: قد يطلب منك المبرمجون –في حالات قليلة– معلومات إضافية عن قواعد التعامل مع صيغ الجمع في لغتك. قد تجد المعلومات المطلوبة في هذه الصفحة:

source: <f0>An </f0><f1><f2>accelerator key</f2></f1><f3> is a key on your keyboard that you can press to quickly access a menu or function. It is also sometimes called a </f3><f4><f5>hot key</f5></f4><f6>, </f6><f7><f8>access key</f8></f7><f9> or </f9><f10><f11>mnemonic</f11></f10><f12>. </f12>If you look at the menu bar on any application you will see that the first letter of each entry is underlined. Notice that <f13><f14>F</f14></f13>ile, <f15><f16>E</f16></f15>dit and <f17><f18>V</f18></f17>iew each have the first letter underlined. To quickly open the File menu press Alt+F. You will notice that most of the menu entries also have accelerator keys, to access <f19><f20>O</f20></f19>pen simply type <f21>o</f21> after typing Alt+F.
ar: <f2>المُسرِّع</f2> (“accelerator” ويسمى أحيانا “hot key” أو “access key” أو “mnemonic”) هو زر في لوحة المفاتيح تضغط عليه لتفعيل قائمة أو إصدار أمر ما بسرعة. إذا نظرت إلى شريط القوائم في أي تطبيق فستجد خطًا تحت بعض الحروف في عناوين القوائم. لاحظ الخط تحت الحرف الأول في كلٍ من <f13><f14>F</f14></f13>ile و <f15><f16>E</f16></f15>dit و <f17><f18>V</f18></f17>iew. لفتح قائمة ملف تضغط <Alt+F>. ستلاحظ كذلك أن أغلب عناصر القائمة لها مُسرِّعات، فللوصول إلى <f19><f20>O</f20></f19>pen تضغط <f21>o</f21> بعد الضغط على <Alt+F>.

source: An <f0>accelerator marker</f0> is the special character we use to mark accelerator keys when we translate.
ar: <f0>علامة المسرع</f0> هي رمز خاص نستعمله لتعيين حرف المُسَرِّع في الترجمة.

source: Identifying the accelerator
ar: التعرف على المسرع

source: In translations accelerator keys are shown by various marker characters:
ar: تتعدد علامات المسرعات وتختلف من برمجية\نظام لآخر:

source: Application
ar: البرمجية

source: Marker
ar: العلامة

source: Name
ar: الاسم

source: English Text
ar: النص الإنگليزي

source: Displays As
ar: كيف يظهر

source: Note
ar: ملاحظات

source: KDE, QT and wxWidgets
ar: كدي و Qt و wxWidgets

source: ampersand
ar: علامة &

source: GNOME and GTK
ar: گنوم و GTK

source: underscore
ar: الشرطة على السطر _

source: OpenOffice.org
ar: أوبن​أوفِس

source: tilde
ar: علامة ~

source: If using <a0>moz2po</a0>
ar: عند استخدام <a0>moz2po</a0>

source: Windows <a0>.rc</a0>
ar: ملفات <a0>.rc</a0> في وِندوز

source: Also used in Wine
ar: تستخدم كذلك في واين

source: In all of the above examples pressing <f0>A</f0> would take you to the <f1>Save As</f1> dialogue box.
ar: الضغط على <f0>A</f0> في أي من الأمثلة السابقة سيفتح نافذة الحوار <f1>Save As</f1>.

source: What happens if you want to use the & character without making it an accelerator? In <t0/>this case the accelerator is usually escaped by using && (for KDE) or &amp; (for Mozilla): “Mail && News” or “Mail &amp; News”. As a translator you would be free to drop the & and use the equivalent of the word “and” in your language.
ar: ماذا لو أردنا إيراد الرمز & دون أن يكون علامة على مسرع؟ في هذه الحالة سيُكتب بطريقة خاصة؛ && (في كدي) أو ‪&amp;‬ (في موزيلا): “Mail && News” أو “Mail &amp; News”. يُمكن بالطبع عند الترجمة تجاهل & ووضع الكلمة المقابلة في لغتك، “وَ” مثلا.

source: Selecting
ar: اختيار المسرع

source: How do you select an accelerator key for your languages? Keep these principles in mind:
ar: بعض القواعد التي قد تفيد في اختيار المسرع المناسب:

source: Try to keep it similar to the English. This makes it easier for users to switch to localised interfaces.
ar: عيِّن الحرف الأبرز، مثل فاء مصدر الكلمة، من الكلمة الأبرز في العبارة.

source: Accelerators should not degrade readability too much.
ar: تجنَّب الأحرف التي يقلل وجود شرطة المسرع تحتها من مقروئيتها.

source: Avoid duplication. Ideally, in any menu, window or dialogue box, a letter should only be used as an accelerator for one string. If the letter 'T' is used for two menu entries, it is usually not a big problem, but the software isn't as usable as it could be.
ar: تجنّب تكرار المسرعات. ينبغي ألا يُعيَّنَ الحرف ذاته أكثر من مرة كمسرّع في القائمة ذاتها أو النافذة أو المربع الحواري ذاتهما، و مع أن هذا لا يمنع تشغيل البرمجية إلا أن المسرع لن يعمل كما ينبغي فتَقِلَّ سهولة الاستخدام.

source: We usually follow these simple rules.
ar: عادة ما نتبع هذه القواعد البسيطة:

source: Try to keep the same letter as the original. “&File” → “I&fayile”
ar: حاول تعيين الحرف الأبرز في الكلمة: ‪“&Open”‬ ← “ا&فتح”.

source: Try to keep the same position as the original. “&File” → ”&Ifayile”
ar: حاول أن يكون في نفس الموضع من الكلمة المصدر: ‪“&File”‬ ← ”&ملف”.

source: Select an uncommon letter. This might avoid clashing accelerators.
ar: عيِّن حرفا غير شائع، لتقليل احتمال التعارض مع مسرعات أخرى.

source: Try to use a letter that is close on the keyboard to the original letter, therefore being easier for the user to adapt to.
ar: حاول تعيينَ حرفٍ موضعه على لوحة المفاتيح قريب من الحرف في اللغة المصدر، ليسهل على المستخدمين اعتياده.

source: Avoid narrow letters like <f0>i</f0> and <f1>l</f1>. It might be too hard to see the underlining under them.
ar: تجنّب الأحرف الشاقولية مثل <f0>ا</f0> فقد تصعب في بعض الخطوط رؤية الشرطة تحتها لقصرها.

source: Avoid adding accelerators under characters with descenders such as lower case <f0>g</f0>, <f1>j</f1>, <f2>p</f2>, <f3>q</f3> or <f4>y</f4>. The underlining might strike through the character and cause the character to look odd and not be immediately recognisable. For example in KDE, &g would appear as <f5><f6>g</f6></f5> which looks messy. It is best to confirm with an actual test, since some rendering systems actually support underlining clearly when the letter contains a descender.
ar: تجنّب الأحرف النازلة عن السطر مثل <f0>ح</f0> (مفردة أو في آخر الكلمة) أو <f1>ق</f1> أو <f2>و</f2>، إذ قد تتداخل الشَّرطة مع الحرف فيصعب تمييزه. مثلا في كدي &ح قد تظهر مثل <f5><f6>ح</f6></f5>. من الأفضل التأكد من هذا باختبار النتائج في البرمجية بصريا، فبعض النُّظُم تتعامل جيدا مع هذه الحالة.

source: Try to avoid the letter next to a descender for similar reasons as above.
ar: تجنَّب الأحرف التي تجاور أحرف نازلة عن السطر للسبب السابق ذاته.

source: Make sure the character is actually available on the user's keyboard. Accented characters such as <f0>ä</f0> might or might not be present on a keyboard in the language. It might even be difficult for some users to type unaccented characters like <f1>ɔ</f1> and <f2>ɛ</f2>.
ar: تجنّب الأحرف غير الظاهرة على لوحات مفاتيح أغلب المستخدمين، مثل <f0>ڤ</f0> أو <f1>پ</f1> أو <f2>گ</f2>.

source: If your language uses diacritics under certain letters such as <f0>ț</f0>, <f1>ḓ</f1> or <f2>ọ</f2>, avoid these characters as well, as the underline might run through the diacritic. Avoid letters with diacritics entirely unless you are very sure that they will be usable by the end-users.
ar: تجنَّب الأحرف المنقوطة من أسفل مثل <f0>ب</f0> أو <f1>ي</f1>، للسبب أعلاه.

source: If your language uses advanced input methods to type (like some Asian languages), you can’t use any of the characters in your translation. Use the original English accelerator: “&File” → “XXXX(&F)”. In some software you can ignore defining the accelerator in which case it will default to the English version.
ar: إن كانت لغتك تستعمل طريقة إدخال متقدمة (مثل بعض اللغات الآسيوية) فلا يمكن تعيين أي من أحرف اللغة الوجهة، وفي هذه الحالة يمكن تعيين المسرع الذي في النص المصدر (الإنگليزية): ‪“&File”‬ ←‏ ‪“XXXX(&F)”‬. في بعض البرمجيات يمكن ترك المسرع دون تعيين وعندها سيُعيَّن ما في المَصدَر تلقائيا.

source: Non-letters like numbers and punctuation marks can be used if they are present on a standard keyboard as is common amongst the speakers of your language. This will usually only be a relevant choice if it was chosen for the source text as well.
ar: يمكن تعيين مسرعات غير الأحرف مثل الأرقام وعلامات الترقيم ما دامت موجودة في لوحة المفاتيح الشائعة بين متحدثي لغتك، وخاصة إذا كان ذلك هو المُعيِّنُ في النَّص المَصدَر.

source: Accelerator Clashes
ar: التعارض بين المسرعات

source: If we have two accelerator keys using the same letter, we say that we have a clash. Assume that the following list are the top three entries in a menu:
ar: عند وجود مسرعين مختلفين يُعيِّنان الحرف ذاته يعد ذلك تعارضا، بفرض أن العناصر التالية هي أول ثلاث مدخلات في قائمة:

source: <f0><f1>A</f1></f0>uthor
ar: <f0><f1>م</f1></f0>لف

source: <f0><f1>A</f1></f0>ddress
ar: <f0><f1>م</f1></f0>ستندات

source: Available <f0><f1>A</f1></f0>ctions…
ar: وثائق ال<f0><f1>م</f1></f0>ساعدة…

source: You will notice that all the accelerators use the <f0>A</f0> key – this is a clash. Fortunately most applications will cycle through the options as you press A repeatedly.
ar: كما يظهر فإن المسرعات الثلاثة تُعيِّن الحرف <f0>م</f0>، وهذا تعارض. لحسن الحظ فأغلب التطبيقات ستختار العناصر بالتتالي إذا كررت ضغط <f0>م</f0>.

source: Here is a better choice of accelerators for the same menu:
ar: وهذا تعيين أفضل للمسرعات في تلك القائمة:

source: A<f0><f1>d</f1></f0>dress
ar: مس<f0><f1>ت</f1></f0>ندات

source: A<f0>v</f0>ailable A<f1><f2>c</f2></f1>tions…
ar: و<f0>ث</f0>ائق المساعدة…

source: We now use <f0>A</f0>, <f1>d</f1> and <f2>v</f2> – there are no conflicts.
ar: هكذا نُعيِّن <f0>م</f0> و <f1>ت</f1> و <f2>ث</f2> فلا يحدث تعارض.

source: English text
ar: النص الإنگليزي

source: Good translation
ar: ترجمة جيّدة

source: Bad translation
ar: ترجمة سيئة

source: Appearance in original
ar: شكل المصدر

source: Appearance in translation
ar: شكل الترجمة

source: Notes
ar: ملاحظات

source: &Faele
ar: &ملف

source: F&aele
ar: م&لف

source: <f0>F</f0><f1>ile</f1>
ar: <f0>F</f0>ile

source: <f0>F</f0><f1>aele</f1>
ar: <f0>م</f0>لف

source: Rule 1, 2
ar: قاعدة 1 و 2

source: &View
ar: &Jump

source: Le&belela
ar: ت&نقّل

source: &Lebelela
ar: &تنقّل

source: <f0>V</f0><f1>iew</f1>
ar: <f0>J</f0>ump

source: <f0>Le</f0><f1>b</f1><f2>elela</f2>
ar: ت<f0>ن</f0>قل

source: Rule 3, 4
ar: قاعدة 3 و 4

source: Rule 1, 3
ar: قاعدة 1 و 3

source: Rule 1
ar: قاعدة 1

source: Rule 8
ar: قاعدة 8

source: Rule 11
ar: قاعدة 11

source: Spaces
ar: المسافات

source: Review
ar: المراجعة

source: Review your choices in the running application. Clashes are not a big a problem, and can sort themselves out over time. Refer to the section on “<bf0>In-product review</bf0>” on page <bf1>54</bf1>.
ar: اختبر تعييناتك بصريا بتشغيل البرمجية. التعارض ليس مشكلة كبيرة وغالبا سيُحل مع الوقت. راجع قسم “<bf0>المراجعة العملية</bf0>” صفحة <bf1>51</bf1>.

source: A slightly more advanced use of variables occurs in some cases to allow the translator to customise the way that the variables are displayed. The examples and techniques in this section is a little bit more advanced. It isn’t important to understand all of these immediately, but understanding these issues might help you to solve some problems in your translation and improve the quality of your localisation work.
ar: أحيانا يتعرَّض المترجم للتعامل المتقدم مع المعاملات لتطويع كيفية عرضها. الأمثلة والأساليب في هذا القسم متقدمة قليلا، ولا يُشترط استيعابها كلها مرة واحدة إلا أن فهمها قد يساعد في حل بعض مشكلات الترجمة وتحسين جودة التَّوطين.

source: Reordering
ar: الترتيب

source: Your translation might just work best with the variables in a different order from the original text. Doing this is easy if variables have names, but it is common for programmers to use unnamed or symbolic variables such as “%d” and “%s”.
ar: أحيانا ينبغي تغيير ترتيب المتغيرات عما في المصدر للوصول إلى أنسب صياغة للترجمة. يَسهُل ترتيب المتغيرات ذات الأسماء الدّالة، لكن المتغيرات الأكثر شيوعا ذات أسماء رمزية مثل ‪“%d”‬ و ‪“%s”‬

source: This might display as “There are 55 photos on the device Nikon XYZ”. In your translation, you might prefer to reorder the variables, to say the equivalent of “The device Nikon XYZ has 55 photos”. You might be able to do it this way:
ar: وسيُظهر هذا شيئا مثل “There are 55 photos on the device Nikon XYZ”. لكن قد يكون من الأنسب صياغة الترجمة على “يحتوي الجهاز Nikon XYZ على 55 صورة”، وساعتها ستكون عبارة الترجمة كتالي:

source: The device <f0>%2$s</f0> has <f1>%1$d</f1> photos
ar: يحتوي الجهاز ‪<f0>%2$s</f0>‬ على ‪<f1>%1$d</f1>‬ صورة

source: The variables are now changed to reflect their order in the original English string. The variable “%d” was initially first, so now it is represented by “%1$d” now that it isn’t used first any more. In lots of software (especially in C like languages using the printf() function) you are able to do this. The programmers would be able to confirm.
ar: هنا غيّرنا الأسماء الرمزية للمتغيرات ليدل الاسم على موضع المتغير في العبارة المصدر بالإنگليزية. فالمتغير ‪“%d”‬ يصبح ‪“%1$d”‬ بإدخال ”$1“ فيه، وهذا يعني أنه يقابل المتغير الأول في العبارة الإنگليزية بغض النظر عن ترتيب وروده في الترجمة. قِس على هذا باقي المتغيرات. تدعم كثير من البرمجيات هذا الأسلوب (خاصة المبنية بلغة سي و شبيهاتها التي توظِّف دالة ‪printf()‬)، يمكن التأكد بسؤال المبرمجين.

source: Omitting
ar: الإغفال

source: In some cases it might be possible to entirely leave out a variable in the translation. This can be useful for the correct translation of certain plural forms, or if an entirely different wording will be used in the translation. This won’t be possible in all situations, so check with the programmers if it is safe to do.
ar: أحيانا نُضطَّر إلى ترك أحد المتغيرات بعدم استعماله في الترجمة، خاصة مع بعض صيغ المعدود (مثل حالة الصفر في العربية التي تصاغ بالنفي) أو في حال تحتّم أن تكون صياغة الترجمة مختلفة تماما عن المصدر. قد لا يكون هذا ممكنا في كل البرمجيات، لذا عليك التأكد بسؤال المبرمجين، و تذكَّر أنك بإغفال متغير فإنك قد تحجب معلومة عن المستخدم، و هو ما ينبغي تجنبّه إلا للضرورة، أو أخذه في الحسبان.

source: In some cases where it isn’t possible to entirely leave out a variable, it can be added in a way that will prohibit it from displaying. A “%s” variable can sometimes be represented with “%.0s” which would stop it from displaying at all.
ar: في حال تعذّر إغفال متغير فربما أمكنت كتابته بطريقة تجعله لا يظهر عند عرض النص، فيمكن كتابة المتغير ‪“%s”‬ على الصورة ‪“%.0s”‬ والتي ستمنع ظهور قيمته.

source: Times and dates
ar: الوقت والتاريخ

source: Variables are sometimes used to customise the display format for times and dates. Check the section on “<bf0>Number and date formats</bf0>” on page <bf1>57</bf1> for more information. In this case, you might need to use different variables from what was used in the original text.
ar: أحيانا تُستعمل المتغيرات لضبط تنسيق الوقت والتاريخ. طالع قسم “<bf0>تنسيق الأعداد والوقت</bf0>” في صفحة <bf1>54</bf1> لمزيد من المعلومات. هذه الحالة قد تتطلّب استعمال متغيرات غير ما في المصدر.

source: Here is a string used to format time to look something like “8:15 pm”:
ar: السطر التالي يُعيِّن تنسيق الوقت ليكون على نحو “8:15 م”:

source: This is the usual American 12 hour format with the extra “pm” or “am” indicating if it is in the morning or not. In a language where a 24 hour format is more appropriate, the translation should be:
ar: هذا نسق اثنتي عشرة ساعة مع إضافة “ص” و “م” إليها. في المَحليَّات التي يفضل فيها نسق أربع وعشرين ساعة ستكون عبارة الترجمة:

source: This will display the same time as “20:15” with no “am” or “pm” at the end. Different variables are used, and there are even a different number of variables. In the case of such time and date formatting strings, this is correct.
ar: وسيُظهر هذا الوقت ذاته على نحو “20:15” دون “ص” أو “م”. في حالة تنسيق الوقت والتاريخ يمكن استعمال متغيرات مختلفة أو حتى عدد مختلف من المتغيرات ولا مشكلة في هذا.

source: The exact details of how these variables work might depend on the programming language used by the project, although they are often the same. Here are a few pages for popular programming languages in FOSS projects:
ar: تختلف تفاصيل عمل هذه المتغيرات من لغة برمجة إلى أخرى، وإن كانت في الأغلب متماثلة. هذه وثائق بعض اللغات البرمجة الشائعة في مشروعات البرمجيات الحرة:

source: C / C++
ar: سي و سي++

source: PHP
ar: بي.إتش.بي

source: <a0>http://php.net/manual/en/function.strftime.php</a0> <s1/>or <s2/><a3><f4>http://www.php.net/date</f4></a3>
ar: <a0>http://php.net/manual/en/function.strftime.php</a0> <s1/>أو <s2/><a3><f4>http://www.php.net/date</f4></a3>

source: Python
ar: پيثون

source: .NET
ar: دوت نِت

source: On some systems you might also be able to consult the manual for strftime, which should correspond to the first link above.
ar: في بعض النُظُم تُمكن مراجعة دليل strftime وهو مماثل للرابط الأول أعلاه.

source: Formatting
ar: التنسيق

source: In some cases you can specify the exact format in which variables should display. This might be useful for the correct formatting of numbers in accounting software, for example. You can control if the sign (+/-) should show, if some zeros should be added to the front, etc.
ar: يمكن في بعض الحالات تحديد كيفية تنسيق قِيَم المتغيرات، وقد يفيد هذا في تحديد التنسيق المطلوب للأرقام في برمجيات المحاسبة على سبيل المثال. يمكنك التحكم في ظهور علامة الموجب والسالب (+\-) أو وضع أصفار قبل العدد إلخ.
