Repository: khaledhosny/l10n-manual
Catalog: manual.po
Languages: ar

source: GTK+ is an underlying platform used for building a lot of software, but maybe best known for its use in the GNOME project. GTK+ provides software with several things that are common in software: dialogue boxes to open and save files, print options, and most importantly for this part of the book, some commonly used strings for common things like “OK”, “Cancel”, “Preferences”, “Copy”, “Paste”, etc. Since many programs use these strings from GTK+, it is useful to look at translating the strings from the GTK+ project for the benefit of all these programs. Although the translation file for GTK+ is a bit big, it is mostly quite easy to identify the most interesting strings in the file from sight, or by looking for the strings marked as “stock items”.
ar: جتك+ منصة لبناء التطبيقات ومن أشهر ما بُني عليها مشروع گنوم. توفر جتك+ للبرمجيات بنية تحتية شائعة: مربعات حِوار لفتح الملفات، وخيارات الطباعة، والأهم - فيما يخص هذا القسم من الكتاب - بعض المقاطع الشائعة مثل “OK” و “Cancel” و “Preferences” و “Copy” و “Paste” إلخ. ولأن كثيرا من البرمجيات تستعمل هذه المقاطع من جتك+ فترجمتها تفيد كل هذه البرمجيات. و مع أن ترجمة جتك+ كبيرة نوعا ما إلا أنه من السهل التعرف على المقاطع المهمة بمجرد النظر، أو بالبحث عن العناصر المؤشر عليها أنها “stock items”.

source: A project called xdg-user-dirs has a small translation file for the names of the common directories in each user’s account. “Desktop”, “Documents”, “Music”, “Pictures” – these directories are commonly seen when opening and saving files, so it provides another way to have an impact in many pieces of software without a lot of work.
ar: ويوجد مشروع اسمه xdg-user-dirs له ملف ترجمة صغير فيه أسماء الأدلة الشائعة في حساب أي مستخدم؛ “Desktop” و “Documents” و “Music” و “Pictures”، وهذه الأدلة تكثر رؤيتها عند فتح ملف أو حفظه مما يعظم الفائدة وراء ترجمتها مع بساطة المجهود المبذول.

source: Let’s repeat our evaluation based on our earlier questions:
ar: لنكرر تقييمنا بناء على أسئلتنا السابقة:

source: GTK+ contains many words, but the stock items are only about 100 words. Xdg-user-dirs is less than 50 words.
ar: تحتوي جتك+ على كلمات عديدة لكن العناصر المهمة حوالي 100 كلمة، و xdg-user-dirs أقل من 50 كلمة.

source: GTK+ translations are submitted at the GNOME project, which is quite easy with several ways of submitting possible. Xdg-user-dirs is submitted with the “Translation Project” which is a bit harder, but you might also be able to ask someone else to help you with that.
ar: تُودع ترجمات جتك+ في مشروع گنوم بسهولة ويوجد أكثر من أسلوب مقبول لإيداع الترجمات. تُودع ترجمات xdg-user-dirs إلى “مشروع الترجمة” وهذا أصعب قليلا، لكن قد تجد من يساعدك في هذا الأمر.

source: No special considerations should be necessary for your language.
ar: على الأغلب لن توجد اعتبارات خاصة تتطلبها لغتك.

source: GTK+ is used with software running on several platforms. Xdg-user-dirs is mostly used on Linux-based systems.
ar: تُستخدم جتك+ في برمجيات تعمل على أنظمة تشغيل كثيرة، بينما xdg-user-dirs لا تستخدم غالبا إلا على أنظمة لينُكس.

source: These translations mostly rely on your system’s language selection.
ar: غالبا ما يعتمد تغيير لغة الترجمة على خيار اللغة في النظام.

source: Xdg-user-dirs doesn’t dependent on external libraries. Small parts of GTK+ use translations from Glib, which won’t be very important initially. Glib can also be translated at the GNOME project.
ar: لا تعتمد xdg-user-dirs على أي مكتبات خارجية. أجزاء صفيرة من ترجمة جتك+ تأتي من Glib لكنها ليست مهمة في البداية غالبا، ويمكن ترجمة Glib عبر مشروع گنوم أيضا.

source: These two projects present a very small amount of work to start having a positive impact in several applications that use them. The GTK+ translation will be especially effective for the GNOME desktop where most applications will use at least some of these strings.
ar: لا يحتاج هذان المشروعان إلا إلى قدر صغير من العمل لكن تأثيرهما كبير ويظهر في البرمجيات الكثيرة التي تستخدمهما. يظهر أثر ترجمة جتك+ على نحو أبرز في سطح المكتب گنوم و تطبيقاته حيث أغلب البرمجيات تستخدم ولو نزرا يسيرا من هذه المقاطع.

source: Firefox is a popular web browser from the Mozilla project.
ar: فَيَرفُكس متصفح وِب شهير ينتجه مشروع موزيلا.

source: Firefox is a humongous project to translate, with over 20 thousand words for the application alone, and several other things necessary to become an official translation. Incomplete translations are not accepted.
ar: فَيَرفُكس مشروع ضخم تتجاوز نصوصه عشرين ألف كلمة للتطبيق وحده، بالإضافة إلى العديد من الأمور الهامة الأخرى قبل أن تصبح الترجمة معتمدة رسميا، كما أن الترجمات الجزئية لا تُقبل.

source: Submitting new translations to the Mozilla project is extraordinarily hard, with many technical steps, several of them involving encryption keys and version control systems. Only already complete translations are accepted.
ar: إيداع ترجمة مُستحدثة في مشروع موزيلا أمر بالغ الصعوبة، إذ يتطلب العديد من الخطوات التقنية بعضها يشمل مفاتيح تعمية ونظم إدارة إصدارات، ولا تقبُل إلا الترجمات التامة.

source: Firefox has good support for many languages, including complex text layout, and bundling of fonts for specific localised versions.
ar: يدعم فَيَرفُكس العديد من اللغات بما فيها تلك التي تتطلب خصائص متقدمة لعرض النصوص، كما يمكن حَزم خطوط خاصة مع النسخ المُوَظَّنة.

source: The Translate Toolkit has converters that allow translating Mozilla software with PO files. However, these are not endorsed by the Mozilla project, and require translation teams to do it themselves. Other software is available, but nothing that translators would be used to from other projects.
ar: تحتوي عدة الترجمة على مُحوَّلات تتيح ترجمة برمجيات موزيلا باستخدام ملفات PO، لكن مشروع موزيلا لا يدعم هذه الأدوات وبالتالي على فرق الترجمة تولي الأمر بأنفسهم. توجد برمجيات أخرى لكن لا شيء مما يعتاد المترجمون استخدامه في المشروعات الأخرى.

source: Firefox is end-user software, and very popular.
ar: فَيَرفُكس موجه للمستخدم النهائي كما أن شعبيته كبيرة.

source: It is cross-platform software, available for several operating systems.
ar: عديد المنصات ومتوفر للعديد من أنظمة التشغيل.

source: Official Firefox localisations have separate downloads. Alternatively language packs can be installed, but needs an additional add-on to activate the new interface language.
ar: توطينات فَيَرفُكس الرسمية متاحة للتنزيل لكل لغة على حدة، ويمكن تنزيل حزم اللغات وتنصيبها لكن يتطلب هذا ملحقات إضافية لتفعيل لغة الواجهة الجديدة.

source: No other software needs translation, but several product pages and marketing material needs to be translated.
ar: لا حاجة لترجمة أي برمجيات أخرى، لكن توجد حاجة لترجمة العديد من صفحات المنتجات والمواد التسويقية.

source: Firefox is very popular, and a good target for localisation in very experienced teams. The text is quite technical in places. It is a humongous amount of work with no reward while you are doing the translation. If you can make the investment, the rewards can be big, since Firefox is used by many people, and Mozilla marketing will in effect also help you to promote your work.
ar: لفَيَرفُكس شعبية كبيرة ويشكل هدفا جيدا لفريق ترجمة مُتمرِّس. لغة النص تقنية في بعض المواضع، كما أنه مشروع ضخم بلا إثابات أثناء العمل عليه، لكنه استثمار ناجح لمن يقدر عليه لشعبيته الكبيرة، كما ستستفيد من دعاية موزيلا في الترويج لعملك.

source: The Debian project is a big FOSS project well known for their Linux distribution. It is also the basis used for building Ubuntu Linux. The installer could be the first software that people see when installing Debian or Ubuntu, and is a well managed project with a big focus on supporting languages.
ar: دِبيان من مشروعات البرمجيات الحرة الكبيرة، إذ يبني واحدة من أشهر توزيعات لينُكس، وهي أيضا الأساس لتوزيعة أوبونتو. قد تكون أداة التنصيب أول شيء يراه مستخدم دبيان أو أوبونتو، وهو مشروع جيد التنظيم ويبدي اهتماما كبيرا لدعم اللغات المختلفة.

source: It is not required to translate the complete installer, but at least two files need to be at 100%. This is more than 10 thousand words.
ar: ليس من الضروري ترجمة المنصِّب كله لكن يوجد ملفان يجب أن تتم ترجمتهما بالكامل، وفيهما أكثر من عشرة آلاف كلمة.

source: The project is very welcoming and accepts contributions in a few different ways, among them through their Pootle server.
ar: يرحب المشروع بالمساهمات ويقبلها بأكثر من وسيلة من ضمنها استخدام خادوم بُوتِل.

source: The Debian installer has good support for many languages, including complex text layout, and bundling of fonts for specific localised versions.
ar: يدعم مُنصِّب دبيان لغات عديدة بما فيها تلك التي تتطلب العرض المُعقَّد للنصوص، كما يمكن حزم خطوط خاصة مع الإصدارات المُوَطَّنة.

source: Plain Gettext PO files are used, supported by Virtaal and a wide selection of translation tools. They also host a Pootle server.
ar: يستخدم ملفات جتتكست (PO) التي يدعمها فِرتال وكثير من أدوات الترجمة الأخرى، كما يستضيفون خادوم بوتل.

source: The installer is not really end-user software, and more likely to be used by technically inclined people. The installer is used infrequently.
ar: لا يُعد المُنصِّب من البرمجيات الموجهة للمستخدم العادي وغالبا لا يستخدمه غير أشخاص لهم خلفية تقنية، كما أنه لا يُستخدم كثيرا.

source: This software is only relevant to certain Linux distributions.
ar: لا يُستخدم سوى في توزيعات لينُكس بعينها.

source: Once you are an official language, the users will select the language easily from a list. Testing might be a bit harder.
ar: بمجرد أن تصبح الترجمة رسمية يستطيع المستخدم اختيارها بيسر من قائمة اللغات، لكن قد تكون الاختبارات صعبا قليلا.

source: The translation of some country names are necessary, and several other files are available to translate the installer more completely. These are not strict requirements, however.
ar: من الضروري ترجمة أسماء بعض البلاد إضافة إلى بعض الملفات الأخرى لإتمام ترجمة المُنصِّب، لكنها ليست متطلبات مُلزِمة.

source: The Debian installer might be a nice target for technically inclined translators, but it will not reach many users, and the text is quite technical in places. The requirements for entering are quite high, and involves translating a lot of strings that don’t have high impact (such as time zones). The project is well managed, and values translations. With a well-resourced team, you might want to consider this eventually.
ar: قد يكون مُنصِّب دبيان هدفا جيدا للمترجمين ذوي الخلفية التقنية لكنه لن يصل إلى كثير من المستخدمين، كما تغلب اللغة التقنية على النص. عتبة الدخول مرتفعة وتتطلب ترجمة الكثير من المقاطع قليلة الأثر (مثل المناطق الزمنية). المشروع جيد التنظيم ويقدّر الترجمة، كما قد تستقي منه ترجمات مشروعات أخرى كما أوضحنا سلفا. إذا كان لديك فريق واسع الموارد أو طويل الأمد فقد ترغب في العمل عليه.

source: Heather Bailey
ar: هِيثَر بايْلي
